const 申时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   七杀   日元   枭神',
  天干: '壬(水) 庚(金) 甲(木) 壬(水)',
  地支: '戌(土) 戌(土) 戌(土) 申(金)',
  遁藏: '偏财   偏财   偏财   七杀',
  大运: '7辛亥 17壬子 27癸丑 37甲寅 47乙卯 57丙辰 67丁巳 77戊午',
  批注: [{
    作者: '九龙居士命理',
    出处: 'https://www.sohu.com/a/459856958_503994',
    命主甲: `一般来说，七杀立局，喜被制化，也就是说，七杀局要么用食伤制，要么用印化。若是食伤制杀，则食伤为用神一定要旺。若印化杀，印为用神也一定要旺才好，如印无根或印被财坏皆为不美。
          `,
    珠玑: `【太极法】
          戌月透二壬水，少阴成阴，立阴为体，以阳为用。
          分析：地支三戌，戊土藏而不露，然戊土为阳，有制水之力，甲木坐戌，但庚邻克甲木，甲木则难以制土，整体上阳气偏旺，阴阳相对能平衡，无大灾之忧，小富贵应有。
          【格局法】
          戌月不透丁戊，以庚金七杀立局，以壬水偏印化杀为用。戌月仍属于秋季，金有气，庚七杀克甲木，用壬水偏印化杀生身，
          但偏印两透，年上壬水坐戌土无力，时上壬水坐申金空亡，降低格局层次，八字有格局架，有杀印相生的组合，不失富贵潜力，小的富贵应有。
          【十干形法】
          甲木无根，以水滋木，身弱。
          甲木坐戌，月令庚戌为魁罡，具萧杀之气，财杀旺见印，应有正当职业，庚为白虎，戊土为平台，适宜公职，或者与国家政府相关的部门。
          甲木有好学的性质，甲木得印生，好学爱读书。庚七杀透出，具有管理才能，行运好了有一定的职权官运。
          地支三戌为财，也为华盖，时柱逢空亡，华盖多有佛性，对玄学易理有兴趣。
          戌为网络，也为大平台大单位，这可能跟命主的事业有关。
          偏印壬水又透，化七杀不得已用偏印，但偏印毕竟为凶神，好在八字没有偏印见食神的组合，偏印代表喜欢偏门学术，有强的逻辑思维与抽象思维，其人多思，有一定的权力。
          偏印七杀的人，有投机取巧之心态，喜欢冒险，容易参与风险投资，人多谋略，但需行正事，勿干违法之事为宜。
          杀生印有管理才能，有文采，多才艺，灵活变通，办事伶俐，气质佳。
          有金克木的组合，并且有驿马，宜远方就业，好动，对物质和精神都追求，有勤奋上进，不甘落下风的进取精神。
          【十神中和法】
          财：财为月令主气，日下坐财，钱财方面不缺少，不受穷，小康到小富不须疑。
          官：八字七杀独透，并且杀生印为权，应是有职权之人。
          印：有印代表有工作，有权力。
          比劫：八字中不见比劫，暗示兄弟少。
          【事业财运点评】
          事业中年不差，会持续到丙辰运58岁，希望努力上进，做对国家和社会有用之人，丙辰运食神杂局，出现枭夺食，此时应该退居，不再适合投资理财，也不适合再往上爬，整体一生有小富贵，比普通人强很多的。
          【后运走势】
          目前甲寅大运37到46岁，甲木比肩坐禄，寅戌拱午火为伤官，申寅相冲，七杀冲禄，驿马逢冲主动，多有频繁走动、远行，事业出现忙碌之象。杀冲禄在虎年猴年注意行车安全。这步运事业财运还是不错，后五年胜前五年。
          47到56岁乙卯运，乙庚相合，劫财合杀，卯戌桃花逢合，申卯暗合，这步运要防桃花，谨慎对待，事业仍能持续进步。
          57到66岁丙辰运，丙为食神，食神坐偏印，壬水克丙火，是枭冲食神，防工作失职，不宜再冒进。丙食神遇杀印格，影响了格局组合，此时应逐渐退居，不再宜激进，知进退则无忧。
          67到76岁丁巳，伤官运，申巳刑合，安享晚运即可，不必再图名利。
          `
  }]
}

export default {
  申时
}