const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   偏财   日元   比肩',
  天干: '甲(木) 己(土) 乙(木) 乙(木)',
  地支: '辰(土) 巳(火) 卯(木) 亥(水)',
  遁藏: '正财   伤官   比肩   正印',
  大运: '庚午 辛未 壬申 癸酉 甲戌 乙亥',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/60.html',
    命主甲: `四月乙木雨露根深富贵命`,
    珠玑: `初学者，面对一个八字，常常不知如何入手，觉得入门很难。其实如果能抓住出生时的月令（月柱地支），发挥想象力，将月令的特征作为入门的钥匙，便会起到事半功倍的作用。
          例如此造，出生日的日干为乙木，所以属乙木命，可将自己想象为藤萝芝兰，花草灌木。出生在夏天四月（巳火月），四月的特征是什么？火势炎炎，木性枯焦，火旺木泄，乙木位居病地（很弱的意思）。
          就像你家庭园中的花草灌木，在四月夏天烈日之下，干渴枯焦，此时最需要的什么？当然是最需要水来灌溉了。其次，四月为巳火，火旺木泄，气势弱，所以说木居病地，弱则喜木来帮助。
          如天干见有甲木，则如藤萝系甲，攀扶着甲木的身干，甲木为参天大树，或地支有木根。再者，水到夏天已干枯，喜见庚、辛金生之，则水源不断。
          现在就根据上面的需要来看看这个八字能否满足其条件。
          月柱己土、巳火，火生土旺；时干丁火透出再生己土。年柱甲木、辰土，甲木能帮身，满足了藤萝系甲的助力。唯甲己合化土，四月巳火当旺，又坐辰土位，化土可成，增加了土力，减轻了木之助力。
          到此为止，似乎都不能满足乙木生四月喜水、木、金来帮助的条件。再看下去，乙木日主自坐卯木之旺根，即此灌木根深，此是好现象。再看时支为亥水，亥为江湖河海之水、为天河大海之水，足可以用来灭火、灌溉。因此地支有此亥水来灌溉乙木，即使不见庚辛金发水源，亦可源源不断。
          更可喜的是亥卯半合木局，亥水在生木的同时，增加了卯木之根的力量，使它能抵挡得住前面两柱火土（伤官生偏财）的重压。辰为湿土，木之余气，水之库，也起到湿润燥土之作用。
          现在可见，全靠时支亥水，便起到了扭转乾坤的助力。喜用卯木、亥水，在日支、时支，且亥卯半合，喜用团结有力，且青年起大运走西北金水之地，助起用神，使得此造能成为富贵之命。
          此命是食伤生财用印格，身（乙木）不太弱（乙木日主自坐卯木为根，且亥卯半合木），能发挥才能（丁火、巳火）得到财富（己土、辰土），且能得时势、贵人（亥水）、客户、朋友（甲木）等之助力而成功之命。身弱喜水、木。地支有亥水，故地支行金运生水亦吉。忌火、土。
          大抵日支和时支为喜用的命，再得运助，很容易成为好命。又：以印为用，且在日、时支，不被合冲破坏，大多数会是有福气的命，常得到天时、地利、贵人之助。此命两者都具备。
          可能有人会问，此命二火二土，对三木一水，四对四，应该不会是身弱。其实在整个八字中，月令巳火的力量最重，几乎占了全局三至四成的力量。
          再加上甲己合化土，甲木只剩下一点原质而已，基本无力，而己土之力大大增加。再看五行四时之效应：夏月火旺（最旺）、土相（次旺）、木休（衰）、水囚（次衰）、金死（最衰）。
          因此，同样天干中的一个木和一个火，两者之间的力量就不相同，火旺当然重于木衰了。地支中可同样推论。
          `
  }]
}

export default {
  亥时
}