const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1988年十月二十四日午时'
  }],
  十神: '正印   食神   日元   正财',
  天干: '戊(土) 癸(水) 辛(金) 甲(木)',
  地支: '辰(土) 亥(水) 卯(木) 午(火)',
  遁藏: '正印   伤官   偏财   七杀',
  大运: '甲子，乙丑，丙寅，丁卯，戊辰，己巳，庚午，辛未，壬申，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/508.html',
    命主甲: `年纪很大了，婚姻的事情一直没有着落。以前谈了个女朋友，可是自己太穷，根本买不起房子，最后只能不了了之了。现在房价越来越高，而手中积蓄没有多少，年纪越来越大，我看不到希望，很是焦虑。
          出生地江苏连云港，以前小时候家境还可以，高三父亲去世后，家里渐渐没落，一贫如洗。
          无奈自己工作也不稳定，兜兜转转赚的钱几乎存不住，这个社会没有钱想娶人家女孩子，简直痴人说梦，对婚姻的事情不抱有希望，现在很是无奈。
          `,
    珠玑: `八字分析：辛金生于亥月，伤官格，透出癸水为食神。伤官要配印才有贵气，戊辰为印，但戊癸合合了食神，容易头脑不清晰，分析问题分析不到点子上，抓不住重点。
          亥中正财甲木透出在时干，中年走寅卯辰东方木运，婚姻理应不愁，只是流年未到而已。你的八字财旺、伤旺、杀也不弱，就是大运没有走到有力的印运，所以感觉买房困难，诸多阻滞。
          事业分析：八字水多木旺，但有戊辰土来制水，性格上比较诚实正直，但也比较胆小懦弱，甲木正财透天干，虚荣心较强，财多为忌，性格上体现为比较死板，喜欢钻牛角尖。
          月干食神透出，比较挑剔，容易抱怨，对现实不满情绪较多，眼高手低，也容易导致工作不稳定，容易这山望着那山高，频繁换工作，很难在一个领域坚持下去有所建树。
          地支伤官生财的组合，日主坐卯木偏财之上，求财的欲望很大，比较看重钱财，人比较贪婪，对于一些看着没有回报，赚钱少的事情没什么积极性，不愿意干，做事三分热度。
          时干甲木正财在地支有根，同时得亥水长生得生扶，亥水为司令，财得长生则财源不断，甲木在时柱也为财入门户，八字中的财富能量还是比较大的，
          但辛金日主身弱不担财，接触得到钱财但留不住，财来财去，求财劳累辛苦。八字身弱不担财，喜比劫星来制财，大运来助身才可以得到这个财。
          你的八字组合适合在一个稳定的平台上上班求财，不宜太过折腾。投资做生意不能单干，要找靠谱的合作伙伴共同求财为吉。
          2010年后一直走的木火运，财官耗身，身弱不担财，求财辛苦劳累，钱财累身，难得清闲自在，也难以聚财。2030年后走戊辰大运，土运助身则可以担财。
          婚姻分析：辛卯日出生为阴差阳错日，时柱空亡，为婚姻不顺，晚年孤独之象。八字食伤得令较旺，则对另一半比较理想化，比较挑剔，要求不低，婚姻上要降低标准才可以。食伤被制，为人不怎么乐观，忧虑多，纠结，压力较大，烦恼较多，所以在心态上也要调整。
          甲木正财代表妻星在时柱，时柱代表晚，婚姻来得晚，为晚婚之命。婚姻宫卯木偏财忌神，比较注重对方的的外在条件，婚后也容易为了金钱而争吵，或产生矛盾。地支卯辰相害，夫妻宫受损，也是婚姻矛盾争吵之象。
          八字先见卯木偏财，后见甲木正财，财星混杂，卯木偏财在婚姻宫，占据了正财妻星本应的位置，容易经历一段失败的感情。
          2022年为壬寅年，寅木正财星出现，寅卯辰三会，则会遇到正缘，要好好把握。妻子人性情浪漫，比较虚荣，做事投机，不拘小节，比较看重钱，花销较大不善理财，长相秀气，长发秀丽，皮肤有点白，鼻梁坚挺，嘴唇微薄，163左右，对自己帮助不大。
          大运分析：33岁-42岁走的是丁卯大运，此大运地支卯木伏吟，和年支辰土相害，辰土受损，辰土为印星用神，财星去破印损用，此大运开支花销会很多，会因为房产，母亲等而花钱很多。天干丁火去冲了癸水食神，要注意身体健康。
          43岁-52岁走的是戊辰大运，此大运干支一气为土运，印星来助身则运势会好很多，身旺可以担财，可以去投资做生意，能够赚到钱。此大运好好把握财运会有很大改善。
          53岁-62岁走的是己巳大运，此大运为驿马大运，比较奔波辛苦，天干甲己相合，财星去制印星，又会因为房产的问题而花销很大。地支巳亥相冲，伤官去冲克正官，容易对工作产生不满，犯口舌是非。
          后面的庚午大运天干庚金被地支午火戳脚，庚金在天干去制财无力，所以合作求财财运会好点，但获得的钱财比较有限。辛未大运天干辛金比肩去制财，可以得到这个财，地支未土印星出现可以助身，晚年运势较为理想。
          大道至简，人生也好，工作也好，道理就在身边，就这么简单，每一个行业的佼佼者都是把最简单的事坚持到底，最后做到极致，正确的坚持是必备素质，当我们抱怨生活不公，赚钱太少的时候，不妨想想我们这辈子坚持做了什么？
          你的八字求财欲望大，想来快钱，赚大钱，却没有想过好好去钻研，踏踏实实的去做份事情，和这只到处找“玩法”，原地打圈的蚂蚁又有什么不同呢？
          `
  }]
}

export default {
  午时
}