const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1990年四月十九日辰时'
  }],
  十神: '食神   伤官   日元   枭神',
  天干: '庚(金) 辛(金) 戊(土) 丙(火)',
  地支: '午(火) 巳(火) 寅(木) 辰(土)',
  遁藏: '正印   枭神   七杀   比肩',
  大运: '庚辰，己卯，戊寅，丁丑，丙子，乙亥，甲戌，癸酉，壬申，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/525.html',
    命主甲: `7岁的时候，工地老板卷款跑人，我爸那会是项目负责人，他义不容辞背负起所有工人的工资债，我们家一下从万元户变成负债十几万，爸妈外出工作还债三年，家里经济逐渐好起来，一直到我高三，妈妈检查出宫颈癌，一年不到，姐姐因为失恋又要回来医院治脚（她小时候小儿麻痹症，落下残疾），
          2011年，大二那年，妈妈的病还没完全好起来，姐姐也在医院做康复，爸爸一下检查出肝癌晚期，半年不到就过世，家里一下坍塌下来，全靠我妈一个人支撑着，那会还做完化疗没多久的她，带我们到市场摆摊各种，赚点生活费，直到我毕业，省吃俭用，供弟弟妹妹读书出来，家里也慢慢好起来，现在也买了两套房子。
          我在家乡做建筑设计工作，算过几次命，都说我是辛苦命，让我好好奋斗事业。
          `,
    珠玑: `八字分析：戊土日主生在巳月，干透丙火，为典型的偏印格八字。食神庚金在已月得长生，但寅、已、午连成一片，火旺金弱，丙火偏印要夺食，辛金伤官合丙可以减轻一定的程度，但辛金本身也弱。女命七杀偏印，夫宫寅木又被穿，婚姻肯定会有些困难和波折的。
          巳月天气逐渐转热，喜见水来调侯，但原局不见水，调侯无力，八字身旺日坐寅木克身，但寅木七杀去生了月支巳火偏印，属于是用神化忌神，天干虽然有庚金和辛金食伤来泄身，但坐午火和巳火被戳脚，用神无力，忌神得生，格局层次一般。
          事业分析：八字巳火枭神得令较旺，年支午火正印，时干透出丙火偏印，性格上有时候容易有些依赖心，遭遇挫折的时候缺乏冲劲，容易打退堂鼓，也比较思虑重重，考虑过多而做事缺乏魄力，八字午火正印和巳火枭神构成印星混杂，容易多学少成，杂而不专，学习成效不好，难以学以致用。
          八字身旺喜食伤泄秀，年月干有庚辛金食伤透出，但被印星戳脚，且有枭神夺食之象，食伤星代表思想，才华，心情等，庚辛金被制，有火旺金熔之象，也代表思想局限，能力受限，内心容易多忧愁，对学业有不利的阻碍信息。
          你现在走的是戊寅大运，地支寅木去旺了印星，对学业是不利的，此大运总体考学运不好，今年辛丑年，天干辛金伤官星高透，但丙辛相合，辛金被合克不吉，今年学业运也是不利的，考上的机会不大。
          明年开始走的是丁丑大运，考学运也不好，2022壬寅年，天干壬水虽制了丙火枭神，但地支寅木旺了印星，2023年癸卯年，天干戊癸相合，癸水合身，地支卯木旺了印星，也是机会渺茫。总体来说近几年学业运都不好。
          八字身旺财死，求财的机会较少，或有机会难以把握住，贵人运较差。好在时支辰土为财库，财入门户则衣禄无忧。八字枭印夺食，好的机会容易错失，事业难有大的发展。
          你现在从事建筑设计相关工作，而设计之类需要是才华，灵感等，枭印夺食会阻碍你的设计天赋，加上印星旺的组合，在做事上会思维不够灵活，偏于保守，要加强学习，多去钻研，尽力提升专业能力，才有机会具备更好的竞争优势。
          枭神和比肩较旺，不适合单干，也不适合合作求财，适合从事稳定保守一些的职业，在大一点的平台公司去求财比较好，不太适合去投资求财，容易破财。
          印星混杂，有多职业之象，可以考虑工作之余去做点副业，揽点私活。八字枭神比正印旺，则代表副业对自己影响较大。
          婚姻分析：婚姻宫为寅木七杀，时支辰土中暗藏乙木正官，为透杀藏官，且七杀在夫位，容易遭遇“烂桃花”，也很容易经历一段失败的婚姻，乙木正官暗藏，同时八字印星多为忌，食伤受制，对感情会有些被动，要适当主动才好。
          婚姻宫寅巳相害，寅木受损不吉，同时婚姻宫寅木七杀虽然为用神，但地支火土旺，寅木力量被消耗，暗示婚姻环境不太好，对象对你帮助不大，夫妻容易发生感情纠纷，有潜在离婚信息。
          而戊寅日出生为阴差阳错日，八字临寡宿，也为不利婚姻的体现，容易有婆媳关系不好的问题。
          枭神得令较旺，也是婆媳关系不好的象，地支寅巳相害，暗示婆婆会影响你的婚姻，对婚姻干扰较多，寅木去生巳火，暗示在婚姻当中遇到问题，丈夫会偏向婆婆一边，巳火去制辛金，且辛巳暗合，代表在婚姻中，婆婆会让你压力较大，不开心，心情压抑，最好是分开住比较好些。
          同时八字枭神较旺，性格上会有些内向，敏感，多疑，心眼较多，年支午火为羊刃忌神，比较固执己见，要强自我，性格刚强，有时候脾气暴躁，导致容易和另一半发生矛盾和争吵，且不容易低头，不利于感情的维护，是要注意的。
          未来丈夫长相一般，鼻直口方，肤色略青，身材偏瘦，身高175厘米左右，为人精明，个性有些急躁，倔强自我，容易冲动，家庭条件一般，对你帮助不大。
          2023癸卯年，天干戊癸相合，癸水连同卯木正官星一并被合入，地支寅卯辰三会，日支婚姻宫被流年太岁会动，卯木为桃花，天喜入命，会遇到缘分结婚的运气。
          子女分析：八字年干庚金为食神，月干辛金为伤官星，月令巳火中暗藏庚金食神，暗示有两个女儿一个儿子，但庚辛金食伤星被枭印星所克，有枭神夺食之象，时干丙火枭神在子女宫，命局申酉空亡，暗示子女缘分较弱，不容易怀孕，要孩子前要多注意调理。
          大运分析：33岁-42岁走的是丁丑大运，此大运天干丁火正印星透出，丁火去制食伤星不吉，表示才华难以发挥出来，从事设计工作会少很多灵感，亮点，难以做出好的业绩，贵人运较差。地支丑土帮身，事业上竞争也比较大，容易犯小人，运势较为低迷，要求稳为上。
          43岁-52岁走的是丙子大运，此大运天干丙火被地支子水戳脚，天干丙辛相合，则创造力受阻，才华受限，不容易施展出来。地支子午相冲，羊刃逢冲，要注意身体健康，意外受伤之事。子水见辰入墓，财星进入财库，总体财运是不差的。
          53岁-62岁走的是乙亥大运，此大运为财官相生的大运， 天干乙庚相合，乙木和庚金被合拌不吉，暗示工作有变动。地支巳亥相冲，巳火禄神逢冲，要注意身体健康和破财之事。寅亥相合，寅木得生，暗示丈夫运势有好转，家庭关系较为和谐。
          甲戌大运，地支戌土被天干甲木盖头，天干甲木旺了丙火枭神，地支寅午戌合火局，则要注意心脏，肺部等方面疾病。
          癸酉大运，为伤官生财的大运，戊癸相合，可以得到这个财，财运较为不错，可以安享晚年。
          你的父母在遇到挫折面前，没有轻言放弃，勇敢的挑起了家庭责任，克服困难，照顾你们三姐弟长大，给姐姐治疗，送你和弟弟上学，还买了房，一次次的变故没有被击垮，把日子过的越来越好。你的母亲为了你们操劳半生，身体也不好，一定要好好孝顺她。
          每个人的人生，都会有不顺，遇到困难的时候，遇到一点挫折就叫苦不迭，怨天尤人，自暴自弃，不妨看看他人苦中作乐，只要心中有信念，不放弃，办法总会比困难多，心中有信念，再大的困难都可以过去。
          `
  }]
}

export default {
  辰时
}