const 寅时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   七杀   日元   正官',
  天干: '乙(木) 癸(水) 丁(火) 壬(水)',
  地支: '丑(土) 未(土) 酉(金) 寅(木)',
  遁藏: '食神   食神   偏财   正印',
  大运: '壬午 辛巳 庚辰 己卯 戊寅 丁丑',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/68.html',
    命主甲: `公司董事长之命，藤萝系甲有大用`,
    珠玑: `一个大公司董事长的命会是怎么样？公司，是指依法成立，以营利为目的，由股东投资形成的企业法人，从事生产、贸易或提供服务等。里面当然首先有财星了。董事长，指的是一家公司的最高领导者，统领董事会，这种职位就是以官星来体现。
          董事长要带领企业做出正确的战略战策，更好地完成工作任务，这就要有印星来配合，有权盖印章，来指挥调动。能当上董事长的人，必须是有才能的卓越之才，不会是庸碌无为之辈，这就需要有伤官、食神等聪明、才智、才能的发挥之星了。
          财星、官星、印星、食伤星，都是作为董事长命里常有的星。当然许多常人的命，甚或夭死的命里也会有齐这些星，问题是在于配合。
          看命就是在看配合。不是看到有财、官、印三星就是富贵好命；看到有伤官、七煞、枭神就是坏命。配合好，伤官、七煞、枭神也是好命；配合得不好，满盘财、官、印也会是坏命。
          这个系列的文章就是讲论命的配合，尽量从初学入门的阶段来讲，让不懂命理的人能看懂入门，相信人各有命，各安其命，不胡作非为，不强求豪取而造业。命中有时终须有，命中无时莫强求，各安其份，社会就会详和，道德就能回升。
          此造出生日的日干为丁火，所以属丁火命，生六月未土当旺之时，土旺泄丁火，火气见竭。这是指火从夏天的盛极到将衰，火气发泄已尽，强弩之未，面临衰竭，这就是丁火命生在六月的特征了，然后根据此特征，以确定其需要。
          火既衰竭，首先取甲木生助，因木能生火。其次，此造生小暑后四天，大暑之前，火土仍炎燥，无水润泽，木气干枯，反焚木，故喜见壬水为佐。这里要注意了，这里喜见壬水为佐，只是讲在命局里的配合，生在大暑前，金水未进气，八个字中喜见有水星来润泽全局，并非一定会以水为用神。
          因为日主丁火已弱，如再喜水为用，岂不是水火相冲，丁火更弱？这里的意思是说，只要八字中有一粒水星，或湿土就够了。使整个命不致太燥。举凡八字，太过燥热，或太过湿寒，都是偏枯之命，不会是富贵命，除非能入特殊格局。
          现看回此命，丁火生六月燥土当令，然见干透壬、癸二水，日支酉金生水，年支丑湿土，足够润土了，且反嫌水多克火，自身过弱。虽见乙木透出年干可生丁火，然乙木只是花草灌木，见壬癸水透干，犹如下雨水湿木性，湿木无炎，且木火间有水相隔，引丁有限。
          至此为止，此命未见好处，只能是常人之命了。火命人见金为财（我克者为财，财为我享用之物），见水为官（克我者为官，官为管我之物），我生者为伤官、食神（即我所发挥的才能），生我者为印（即帮助我之人或时势）
          现见到天干两个官星，地支一个财星，二个才能发挥，天干一个印星帮助，即命中的财官不轻，才能亦有。唯为求名利做得很辛苦，帮助的力很少，如果能增加帮助自己日主的力量，就能将上面的名利、才能承担起来，何愁不富贵呢。反之，如果日主只是得这么一个湿乙（花草灌木）的帮助，并无其它助力，那就只是一个为名为利终日劳碌奔波，而一事无成的辛苦命了。
          所以，现在看最后的临门一脚，就是看时辰（时支）了，如果时支是木、火，就能大大增加了日干丁火的力量，再凭运助，就能将前面的二官一财二食神全拿下来，而名成利就，成为掌管财务的官员。反之，如果时支仍是金、水、土，不助日主，反而更泄日主火气，那么此造今世就只是一事无成的辛苦命了。
          现开彩啦，时支是寅木。寅中藏甲木、丙火、戊土，但以甲木为主。甲木乃参天大树，生起火来源源不断。且乙木得到地支寅木之强根，成为藤萝系甲，指乙木能缭绕甲木大树而长。乙木虽柔弱，但一旦成藤萝系甲，便大大地增强了力量，可春可秋，言四季皆可也。
          换言之，在此造中，日干丁火本弱，原指望乙木来生火，但乙木远离丁火，又被雨水淋成湿木，并被水相隔，正当无望之时，忽然见到有大军来帮助，此大军正是时支寅木，寅中甲木参天大树，乙木正好能缭绕甲木大树而上，寅中丙火亦可将湿木烘干，且助丁火。现丁火日干得甲木参天大树之助，火力源源不断，何愁名利不到手呢。
          可见，正是时支一寅木，在此造中便起到了扭转乾坤的作用，将前面过重的名、利、发挥全都拿下来，而成为一名成利就的好命了。
          大运喜木、火，忌土、金、水，平生大运走东南木火之地，命与运俱佳，能成为公司董事长就不足为奇了。
          `
  }]
}

export default {
  寅时
}