const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '一九九二年七月初四丑时'
  }],
  十神: '食神   正官   日元   正官',
  天干: '壬(水) 丁(火) 庚(金) 丁(火)',
  地支: '申(金) 未(土) 戌(土) 丑(土)',
  遁藏: '比肩   正印   枭神   正印',
  大运: '戊申，己酉，庚戌，辛亥，壬子，癸丑，甲寅，乙卯，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/347.html',
    命主甲: `自己由于爱拖延，缺乏上进心，没有志气，以至于浪费了好多时间，目前还没有一个养活自己的一技之长。靠着运气上了研究生，还不知道能不能毕业，对职业发展也有些迷茫。
          喜欢那种稳定些、压力小的工作，当老师、当公务员、去国企工作或者去公司上班。
          自己比较内向，太老实，不太会说话，所以感情基本上处于空白。
          `,
    珠玑: `八字分析：庚金日主生在未月得令，未月土旺火退气，金进气，对日主有点帮扶作用，而地支丑未戌三刑，刑旺了土，好在年支有申金为日主的禄对日主也帮助，八字土旺不至于埋金。
          而庚金为顽钝之金，喜火来炼制，特别是丁火，而月干的丁火被壬合克，难发挥作用，时干丁火无伤可用，且喜木来生火更佳。
          事业分析：庚金属于尚未成型的金矿石，需要火来炼方成大器，忌讳土旺金旺又无火来炼，而你的八字地支丑未戌三刑土旺，庚金在地支有申金强根，庚金日主左右看起来透出两个丁火，
          但月干的丁火被壬水合克，时干的丁火虽然可用，但丁火坐下丑土泄丁火的力量，同时虽然丁火在未土戌土中有弱根，但是被三刑受伤，八字火力有些不足，组合上不太好，为人容易敏感，想法多，顾虑多，想得多，但行动力不足，有些懒，比较老实憨厚，不太会灵活变通。
          年干的壬水食神，和月干的丁火正官为吉神，两者相绊难发挥作用，不过天干透出两个正官，月干丁火正官被合克，两个正官去一存一，使得正官变清，时上正官一位，对你事业发展还是有吉利一面。
          但是时干丁火正官，在地支无强根，虽然未土有丁火弱根，但是地支三刑土旺，丁火弱根受伤，时干丁火的力量不强，八字原局层次打了折扣，结合大运走势来看，一路走的是土金水运气，八字格局层次不高，属于普通偏好或小康左右的层次。
          八字以丁火正官为用，时干正官没有被冲克，还算有些清贵，只是正官没有财来生助，又没有强旺之根，所以难获得大的发展提升。运势发展来看，可以到国企，事业单位上班做个清闲稳定的工作比较好，公务员也可以考虑。
          而八字食神合官，食神做长生，勉强可以往老师方面发展。方位上宜往出生地以东，以南的区域发展比较好。
          婚姻分析：你的庚戌日柱，为魁罡日，同时八字逢正官，魁罡格又破，且地支丑未戌三刑，婚姻宫被三刑，婚姻宫是较不稳定的，脾气不是很好，容易燥而在相处中争吵矛盾不少。再看财星不显，未土为财的墓，八字财星又弱，同时婚姻宫被三刑为忌，婚姻比较难成，难遇到比较满意的对象，也属于明显的晚婚运。
          八字印旺为忌，与妻子的关系不是太好，对你的帮助也不大，出生条件一般，而自己在感情上也容易顾虑较大，想得多，印星重容易不利于食伤的发挥，不太会交际，也不太懂得表达自己的感情，在感情上比较的被动。
          你现在走的是庚戌大运，与日柱伏吟，且引动三刑，印旺比劫旺，对你的婚姻落实是不利的，婚姻运比较弱，难遇到自己满意的对象，只有把握个别流年比较好，比如2023年伤官生正财，正财刚好又是桃花星合入婚姻宫，有结婚的机会，只是也容易有竞争，自己也要主动把握才可以。下一次就要到2025年正财透出合日主的时候才有机会。
          你们是通过他人介绍或相亲认识的，对方家庭条件方面比较一般，脸型有些微圆，肤色有些微黄，不黑不白，眼睛细长不大，还算有神，五官端正，长相普通，嘴唇微厚。职业与土木工程，房地产及金融财经相关。
          大运分析：23岁-32岁走的是庚戌大运，大运印生比肩力量集中在比肩上，且大运干支为忌神，运势发展是不太顺畅，注意提防不怀好意的人，且用心努力些，不要犯错。庚戌大运伏吟日柱，感情会有些不和谐及反反复复，不利感情婚姻方面的信息。
          33岁-42岁走的是辛亥大运，天干劫财生食神，八字天干食神力量增加，食神合制正官力量强些，而食神为财源，对八字事业发展是有些帮助。虽然有竞争压力，但通过自身努力还算有些发展进，而地支土旺，容易有水土相克的局面，个别干支土金旺的年份，状态不是太好，
          需要注意下。婚姻运走劫财运气，地支有水土相克，感情不是太好，会有些问题矛盾及疑心重而导致感情误会及婚姻危机，2027年，2030年和2033年的时候要注意。
          壬子大运，大运食伤丁壬合，地支申子半合食伤局，八字食伤旺克正官，食伤为财源，较利于求财，会有进一步的发展收获
          癸丑大运天干伤官见官，地支三刑，各方面不太稳定的，且容易有支出破耗及纠纷矛盾问题，宜低调踏实做事比较好。
          你的八字正官透出 ，但是根气有损，正官力量不强被泄，又没有财来生官增强力量，不能更好的炼就庚金，整体格局层次会受到影响。但正官没有严重的冲克，所以事业还算有些发展的，你想做一些稳定的，压力小的工作，是适合你的，也有这个命，可以实现。
          当然，一个人获得的成就，和所承担的责任，两者往往是对等的，稳定的压力小的工作，也意味着收入不会太高，懂得知足常乐的话，幸福感不会差。结合你的大运走势来看，一路走的是印比劫大运，后面财食伤，财的运气，早年中年的运气不是太好，起色一般，到中后期晚年运势相对好些。
          `
  }]
}

export default {
  丑时
}