const 巳时 = {
  公历: [{
    甲: '1977-04-09 09:00:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '偏财   食神   日元   偏财',
  天干: '丁(火) 乙(木) 癸(水) 丁(火)',
  地支: '巳(火) 巳(火) 未(土) 巳(火)',
  遁藏: '正财   正财   七杀   正财',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/313.html',
    命主甲: `我小姨一九七七年阳历四月九日早上九点时辰，老师您给看看我小姨的婚姻如何，财运如何，看她什么时候能结婚，什么时候经济情况能好一些，希望老师看看她以后的人生
          `,
    珠玑: `八字分析：女丁巳年生人沙中土命，巳月癸水失令较弱，此命入偏财格局，日元癸水可谓没有一点根气，此命入从弱，以财官为用神。丁巳年生人，祖上多有富裕之人，祖上风水还是不错的，也算是有福报的人，可读者描述来看却不是这样好呀，事出蹊跷必有妖。
          乙巳月生人，家庭条件也不错，聪明能干又一心想赚钱。可惜天干的偏财与日元相克，越想得到就越难呢。今天还是看下婚姻吧，毕竟对于女人来说婚姻更重要些。癸未日生人，按说能找个条件不错的二婚男，也不一定是二婚人，或许是跟你一样还没结婚过的男子。
          癸未日生人，少不了吵吵闹闹，都是脾气不好，你自己火气也够大的。所以呢感情不顺是难免了，癸未日生人偏官入夫妻宫，一定会是晚婚命。巳中有戊土正官而与夫妻宫不链接，等于自己心里想的白马王子，也只能是在心里了，哪个人年轻时也有些暗恋的情况吧。
          此命入真从，可真从也不一定就好啊，真从最怕走印比之地。小时候生活还是挺好的，24岁开始进入申运西方金地，日元逢印地变格，从格可是最怕来这一套啊，那肯定是诸多不顺，感情迷茫难有良缘啊。
          为什么运势在此命这样重要呢？因为大运和命局的意向背道而驰了，命局的意思是此命富贵能得良缘，且丈夫有权利。而大运的意思想让命主勤奋努力，好好学习进步踏实工作挣钱。命局和大运这两个主子在争夺控制权啊，俩主子打架命主却遭殃呢，东走不是，西走也不行。
          34岁走己酉大运，依然是西方不利之运，上面就说了大运和命局的意向完全不同导致了各种不顺，此十年自然财运婚姻两难啊。就像父母有不同意见，一个往东拉一个往西拽，那遭殃的就是孩子啊，听说的都会得罪人，也没有第三选择啊，所谓的第三选择就是背井离乡独立打拼或许有出路，可有几个人愿意呢。
          44岁走庚戌大运，认为是比较不错的运势，戌未邢婚宫和财宫同时动了，代表两全其美吗，那倒不一定，但此运肯定会慢慢向好的。戌也是官星之地，虽然这年龄了想结婚也不难啊，比如明年丑戌未三邢，只要你想结婚就能的，还好几个男人为你掐架争斗呢，好好把握下明年的机会是可以结婚的。
          这种运势对于命主来说有好处，老天给了一份生活的希望，把握下结婚生育吧，再晚了真就孤独一生呢。可好景总是不长，54岁走辛亥大运，又进入北方旺地，命格再一次被颠覆，且与命局相冲严重，好吧这命也太难了，老天安排的运势整个把一好命颠倒成了差命，辛苦操劳各种不顺又至，婚姻财运也都将再次面临困难。
          64岁后及老来，生活也一般吧，命运相悖原来也那么可怕，一个好命走的运差也是一场空啊。当然这个只是个例，对于多数人来说命好的运气哪怕差些，也比普通人好。从格的人比较特殊，尤其这种真从格局，一旦命运相悖一生大志难成，沦落为普通命人，以上预测仅供参考。
          中国人说话还真得辩证着听，都说坚持就是胜利，可走在一条错误的路线上坚持下去那就是一条道走到黑啊。坚持不但不能胜利，把一生都给毁了。人活着就应该有弹性的适应各种环境，无论向东还是向西，怎么利于自己的生活怎么去做。
          人的一生虽然有命运所把控，老天还是给人些权利和空间，至少我们自己能把握百分之三十的命运。这样就挺好了，人类发展到今天仅仅利用这三成发展空间，可想而知我们人类是多么的伟大和坚强啊。在知命的情况下，
          进一步通过学习读书优化命运，最大程度向上晋升突破，慢慢的就能改变自己的命运，一定程度的逃脱命运的束缚，完全摆脱命运控制那是不可想象的。
          `
  }]
}

export default {
  巳时
}