const 寅时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   劫财   日元   七杀',
  天干: '丙(火) 己(土) 戊(土) 甲(木)',
  地支: '戌(土) 亥(水) 子(水) 寅(木)',
  遁藏: '比肩   偏财   正财   七杀',
  大运: '戊戌 丁酉 丙申 乙未 甲午 癸巳',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/153.html',
    命主甲: `财强杀旺地产致富之女命
          `,
    珠玑: `此造出生日的日干为戊土，所以属戊土命，生黄历十月立冬之后，亥水当旺，水旺土荡，土临绝地，且气肃而寒。
          日主戊土自坐子水，地支亥、子水连成一片，时柱见甲寅木，为财（水）生杀（木）旺克身（戊土日主），因为甲木是戊土日主的七杀星，亥子水是财星，亥子水生甲寅木，甲寅木克日主戊土，这可不是好事呵。因为土生十月，已是衰绝之地，又见旺水生木来克身，岂不是身衰见鬼？比水旺土荡的命造还差。接着唯有寄托于年、月二柱是否有救了？
          现看到年上丙戌，祖上荫德或风水有助力，丙为太阳之火，戌土为日主之固根，这样既可暖土荣身，又可化杀（甲木）而生身（戊土）（甲木生丙火，丙火生戊土），一举两得，将上面二个难题解决了（一是寒土冻土兼身弱，二是官鬼克身，逢凶化吉）。
          可惜是丙火离日主太远了些（一在年干，一在日干），然又见己土透出月干，得丙火之生助，既可为堤防水患，又可将丙火之力拉近戊土日主，因为丙火生己土，己土助戊土，实相当于丙火同时生旺戊己土，既能照暖土气，又能固厚土为荣，使其能承亥子之旺财，富格由此而成矣。
          更妙的是，己土亦可合甲木（甲己合），虽然是隔位之合，合力较轻，亦可使其减轻几分克制日主戊土的凶性。
          书有“甲以乙妹妻庚”之说，意思是甲木日主，遇到庚金，庚金是甲木的七杀，一般而言，七杀是颗凶星，尤其是身弱无制化的时候，此时如果命中同时见到有乙木，甲木日主就将乙木嫁给庚金。因为乙木见到庚金会相合（乙庚合化金），它俩结合为夫妻，庚金七杀就成了妹夫，这样七杀就不会去伤害甲木了。
          甲木和乙木都是木，像兄弟姐妹一样，甲木属阳，乙木属阴，甲木排在前面，乙木排在后面，所以乙木就是甲木之妹，这就是“甲以乙妹妻庚”的意思了。
          同理共推，这里也可以说是“戊以己妹妻甲”，己和甲结为夫妻，甲木就是戊土的妹夫，于是就不会伤害戊土日主了。就像是历史上“昭君出塞”的故事，匈奴同汉朝和亲的意思。
          行运喜火、土，忌金、水，木运行天干有丙火化木生火可行，地支不利。早岁申、酉金运不利，父早亡。乙未、甲午运，从事地产，发财致富。
          `
  }]
}

export default {
  寅时
}