const 午时 = {
  公历: [{
    甲: '1991-12-03 11:30:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '偏财   食神   日元   劫财',
  天干: '辛(金) 己(土) 丁(火) 丙(火)',
  地支: '未(土) 亥(水) 未(土) 午(火)',
  遁藏: '食神   正官   食神   比肩',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/314.html',
    命主甲: ` 小的时候家庭就不富裕，性格上又内向，从小就想着考个好大学；可是也努力过，最终还是与大学无缘。辍学后，就出来打工赚钱，后来又娶妻生子；生活上虽不富裕，但还是感到挺幸福的。
          `,
    珠玑: `八字分析：日干丁火，出生在火绝之地的亥月，自当不禀时令；同时，月干透己，湿土紧贴日干悔丁；有通根在年月时，自然己土也强。故此，虽然丁未一柱，本柱干支通气，时柱再见丙午帮身，依然还是身弱。因此，这个八字用神则为木，喜神则为火，官杀之水，则闲神；命中忌神则为金、仇神则为土。
          这个八字地支年月亥未拱出用神木，日时地支午未合成日月（或者为土，或者为火，看行运扶持哪一方），都是紧贴之合；天干有丙辛合，同时，天干日时丙丁，一路流通顺生到年干；为尊上，为孝顺，故此，命主的家庭，无论是结婚之前，还是结婚之后，家庭还是比较和睦的。
          这个八字最大的问题，就是年月拱印，但命中印星逢空，虽然命主年日皆坐华盖，人也算是聪明，但不大利于学业。尤其是命主少年行运戊戌，命主墓库，伤食混杂，刑冲印库，解除印星拱局，自然学业不佳，主要是考运不利。
          18岁之后大运丁酉，干支搭配为比肩多才，但身弱，大运方向在酉，暗破印局，当不利于学业，也不利于职业发展。想法在财，但是财来财去，赚不了多少钱。28岁之后的丙申，依然还是如此，但申比酉好些，没有暗破印局的关系。同时，申中有壬，相对比上步大运好点。
          命主的事业，家庭兴旺，大体要到38岁开始的乙未大运，以后的甲午，癸巳，事业财运，都会不错，亦有发达的机会。原因就是命中的地支亥未合，午未合，体现出福德，体现出人脉，会得到好心人的帮助。事业方面，职业发展方面，可以有新的机遇。
          同时，这个八字，有食神生财，就说明命主可以靠技术，靠口才，靠聪明机巧获得财富的机会。命中食神与官星合，拱出印来，说明能得到上司，领导的暗助，职业方面可以从事管理、技术、技巧、手艺这些。命中财星本气算弱，也就是说，命中发达的根本。实际上就是身比财旺，担负财的能力并不弱。
          也正因为如此，命主在丁酉，才星忌神运中，还可以结婚，原因就是如此。财弱逢财旺的大运，就有结婚的机会。至于有人说，这个八字克妻，可能并不实在。因为，就命主八字，总体而言，命主还是偏弱，命中有食伤生财，财星受到扶持，是爱妻的表现。
          不过，这个八字偏财虚透年干，日时又是妻星的衰病之地，行运再见妻星的衰病之地，恐怕要注意妻子的健康。因为，命主财星地支无自身的根。这种情况，就是生也不能过旺的生，怕克也怕冲。目前大运，财星得地，相对好些，行运进入乙未、甲午，需要注意妻子健康。
          但丙申运，要注意父亲的健康，因为，丙合克辛，为父亲宫位与父亲星，财星无根，大运见根，又是偏根。与妻子关系不大，因为，妻宫没有动。乙未大运，乙木冲辛，感应到了财星，未又为妻宫复吟的字，主痛苦，所以要注意妻子的健康。不过，乙木在未运，气是墓，力量不大，冲辛只是动摇，没有克性，还是没有大的灾咎。
          甲午大运，妻宫逢合，但甲与己合，虽然要注意妻子健康，主身体多病，但也不至于就怎么样了。至于癸巳、壬辰，依然差不多，但平时精神还是不错；主要是巳与原局组合了巳午未三会火方，但天干透癸，有抑制火的作用，也属于解救；壬辰运本来就是偏财辛的墓库大运。
          上述分析说明，你后面的行运，总体说来利于钱财，其中大体与妻子的奉献有关；但妻子操劳较大，付出较多，需要注意妻子健康。至于是不是就怎么样了，这也要根据妻子自身的八字来决定，她的命不是由你的命来决定。
          同时，就你的八字而言，身弱即使是克妻，也克不住；还不说，你的八字本身有福德与流通，财星虽弱，但有生助，就算解救，大体是妻子健康方面容易体弱多病而已。
          `
  }]
}

export default {
  午时
}