const 酉时 = {
  公历: [{
    甲: '1977-06-12 17:37:00'
  }],
  农历: [{
    甲: '一九七七年四月廿六日酉时'
  }],
  十神: '正官   七杀   日元   正财',
  天干: '丁(火) 丙(火) 庚(金) 乙(木)',
  地支: '巳(火) 午(火) 子(水) 酉(金)',
  遁藏: '七杀   正官   伤官   劫财',
  大运: '乙巳 甲辰 癸卯 壬寅 辛丑 庚子 己亥 戊戌 3岁运',
  批注: [{
    作者: '周易与姓名运用学',
    出处: 'https://www.sohu.com/a/469030234_291543',
    命主甲: ``,
    珠玑: `本命格月柱七杀丙午火干支一气为七杀格，年柱还有丁巳火干支一气的正官组合，此乃官杀混杂的格局；
          日主庚金仅仅是只有一个酉金根基在时支，很明显金弱而承受不起官杀混杂的攻击，尤其是七杀紧贴相克的组合，所以要制杀为主；
          但是看命格天干并没有食伤透出，仅仅是地支有一个子午相冲，子水伤官冲克午火，虽然没有透出而在地支，总好过没有吧，所以无可奈何只能用地支子水阻挡一下，最好的就是食伤透出天干之时，比较最为有利！
          如果从五行气候方面看，本命生于夏天火旺，喜水配置滋润，水弱又喜金来生水为好，本命日柱为金水的组合，说明本命水火既济，说明本命以后就有事业成就，所以，从取用方面看，本命喜金水，而忌木火，逢金水旺之流年事业发展就比较好。
          本命喜金水，而子水在支，则喜透出之年运，说明逢水旺之年，基本上能能得到提升或加薪的好事；而逢木火旺之年，工作压力会大一些，工作运程不顺。
          从格局看，本命月透七杀，是按七杀格来论，七杀为凶神喜印星配置，或食伤来制杀，所谓杀星有制化为权；而本命日支见伤官，就有伤官制杀的信息，逢食伤透出之年就能升官发财，而且本命时支为羊刃，也有羊刃架杀之象，说明本命格局配置是比较好的，工作单位偏于事业单位，会有官职。
          事业方面：本命以伤官来制杀，以羊刃来架杀，杀星有制化能化为权，说明你的事业方面会有比较大的发展的，以后肯定有官职，能撑权。但是毕竟是身弱金弱权力不大也累！而本命火旺以金水为喜用神，水火既济，金水代表金融、财经等方面的行业，说明适合从事这些方面的行业，或投资理财这些方面的行业。
          感情方面看：本命夫妻宫为子水，为喜用，说明妻子还是能旺你的，夫妻宫为喜用，则夫妻感情还是比较好的；只是夫妻宫与父母宫相冲，则婆媳关系不好，最好婆媳不在一起居住为好，
          毕竟父母宫与夫妻宫相冲，不但代表婆媳关系不好，而且代表还容易影响到事业，因为午子相冲，午中已土克子中癸水，克自己的用神是不利于事业的，从这点看，当婆媳关系不如意，同步出现工作压力加大，身体容易有小毛病等象。
          本命妻星为乙木，与日主相合有化金助日主之象，则代表妻子心向于你，又有旺你之意，妻子还是比较重视婚姻家庭生活的。
          流年展示：012壬辰年：食神壬水透出，有制官杀之象，水火既济，说明此年工作顺利，加薪或有提升，而且利婚姻感情；
          2013癸巳年：伤官癸水克官，伤官见官虽为有利，但也多口舌，说明此年财上有提高，不过工作多操劳，与个别领导产生矛盾；
          2014年甲午：甲木生火助忌神，工作压力大，但工作有成绩，夫妻有矛盾或婆媳关系不好等；
          2015年乙未：乙木生火助忌神，，也是不利的年份，工作不顺利，财运不好；
          `
  }]
}

export default {
  酉时
}