const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1993年八月二十九日辰时'
  }],
  十神: '劫财   正官   日元   正官',
  天干: '癸(水) 己(土) 壬(水) 己(土)',
  地支: '酉(金) 未(土) 辰(土) 酉(金)',
  遁藏: '正印   正官   七杀   正印',
  大运: '戊午，丁巳，丙辰，乙卯，甲寅，癸丑，壬子，辛亥，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/319.html',
    命主甲: `我从初中那时候2007年开始就莫名原因地出现口吃，而且情况越来越严重，得不到缓解，自己一直都很苦恼。大学刚开始的时候过得还算快乐，但是自从2014年之后我就因为人际问题出现了精神问题：抑郁症和社交恐惧症，
          后来虽然经过吃药得到一些缓解，但是一旦停药的话症状就会反弹，再加上之前我有口吃的情况，大学期间我过得非常煎熬。
          之后2016年实习我又遇到一个对我很差的上司，那时候我一边实习一边准备考研，考上研究生之后2017年下半年日子我过得算是比较快乐的，但是好景不长，一到了去年2018年之后我受到来自导师的压力，师兄以及同学们的巨大压力，
          去年一整年我都过得很压抑，女朋友也不怎么会体谅我，经常跟我吵架，而且肠胃经常会痛，那段时间我简直痛不欲生。
          2019年前半年我过得也是很压抑，6月份之后情况有了些好转，但是之后我又收到各方面的压力，我感觉我这几年来都没几天开心的……
          `,
    珠玑: `八字分析：壬水日主生在未月失令，未月为夏季最后一个月，火虽然退气但仍火旺而土相，但火土的力量还是比较大的，而月干上和时干上都透出己土贴身克日主力量强，对日主来说是一种克害作用，是不好的。
          年柱金水相生帮扶日主，但是受到月柱旺土的阻隔克制，难直接生助到日干，且生助的力量也会大打折扣。同时辰土本来是为水库，但你的八字组合土重而水弱，所以辰土为墓的作用，
          日支时支辰酉合，虽然金泄土，但酉金也是难以直接生到日主的，所以你的八字属于明显身弱，喜生助的金水五行为用神，以克耗的火土五行为忌神。
          你的八字喜用神金水五行分布在年柱和时支上，八字有金生水，金泄土，用神也不算弱的，但忌神分布在月柱，日支，时干上，忌神力量围绕日主，日主代表你，也可以理解为你周边的环境不好，且忌神五行土为官杀，官杀代表的是一种克制，压力，忌神力量大，对你来说是不利的，也造成你容易感到压力大。
          而五行金水为生助日主的喜用神，生助日主代表对日主带来的一种帮助，付出等，也可以理解让日主的你觉得开心的，平顺的，积极向上的好事物，代表一种贵人的运气和做人的心态，和底气。
          虽然你的年支和时支的酉金为正印，可以泄掉官杀的力量，但忌神力量太强，用神又不能直接生到日主，日主周围全都是忌神，用神在外围，属于外围为喜用神，内围为忌神的八字组合，用神又被忌神所克制，忌神贴身克日主，忌神的位置有绝对优势。
          而与日主最近的五行，代表是日主周围的环境，比如周围的人和遇到的事物，日主被官杀围绕贴身克身，代表身边的环境对你来说是不好的，会给你带来比较到的压力，也容易遇到不顺心的事情，小人比较多。
          用神金水在外围，代表日主在面对忌神克制的时候，用神不能直接有效的支援日主，在远近的优势方面，用神会处于下风，也代表忌神必然会给日主带来损害。
          八字身弱，官杀多且旺贴身克身，说明你承受的压力是会比较大，自己的顾虑，忧虑也很多，也导致你底气不足，缺乏自信，懦弱胆小，消极自卑。
          正印虽然有泄官杀的作用，但是印星不能有效的生助日主，而印星也代表想法，印化官杀但生不到日主，不流通，也代表你内心想法会比较杂乱，胡思乱想，这也就导致你内心活动非常多，想的东西多，但是想的杂乱，偏悲观主义，缺乏自信底气，
          也就使得你在生活中，为人做事处事畏手畏脚，放不开，负面情绪不能得到好的发泄，内心负能量重，也容易导致人际关系出现问题，不利你的社交关系。
          加上你前面几步大运走的刚好又是财官杀的忌神运气，对你来说是非常不利的，久而久之积累下来，精神也容易出问题。整体来说，八字格局层次不高，属于先苦后甜的运气，到42岁后财运会比较稳定些。
          结合你的走的运势来看，去年是丙辰大运，戊戌年，流年当中五行土官杀的力量是很大的，对你的精神，各方面很不利，2019己亥年下半年水旺，但流月当中的五行吉凶参半，2020年虽然相对有好转，但你的八字官杀旺为忌神，且目前走的大运对你不好，
          要当你走上食伤运的时候，食伤代表自我能力的一种体现和心声，食伤得比劫生助而去克土，会让你变得积极上进，且有突破困难阻碍的想法，你的压抑，口吃，精神问题，要到32岁后有比较明显的改善。
          大运分析：2014年-2023年走的是丙辰大运，大运与八字天干财生官，官旺克身为忌。同时地支辰辰自刑，七杀旺也是不吉的，此大运官杀混杂克身，代表自己会承受着的压力非常大，自己做人做事，容易不受人待见，易招惹小人。
          而自刑代表的也是一种内部压力转变为内心内部的自我压力，自我困扰的体现，久而久之得不到宣泄，就容易滋生消极自卑的心理。也代表此大运各方面的压力是非常大的，对你事业财运及人际关系都是不利的，事业也会比较被动，难有好的发展，且破耗会比较多。
          2024年-2033年走的是乙卯大运，伤官代表的是你一个人内心的外在体现，自己会比较渴望打破这种被动，自卑，不受人待见的状态，这个大运对你来说是主动性比较强的大运，也代表你的内心忧虑，精神问题，压抑，口吃的问题会得到缓解和释放。
          但地支卯酉为枭伤相冲，有的时候还是会消极矛盾的心理。同时大运得比劫生助可以去克正官，形成伤官见官，克制忌神，也代表你的事业财运会好转，但伤官见官也代表的是是非口舌，人际关系也是不太好，属于伴随口舌发展事业的大运，有利有弊。
          2034年-2043年走的是甲寅食神大运，食神与八字中的官星相合，食神得比劫生助可以有利的合住官星，对八字整体运势也是有帮助的，财运会有所增加，但是食神属于泄好日主的五行，代表必须付出努力才会有所收获，属于努力付出有发展收获的运气，也要适当的注意理财财运才会更加的平稳。
          而52岁后开始走癸丑，壬子，辛亥大运，这几个大运都属于生助印比的五行大运，对八字来说是喜用神的运气，所以你后面及晚年的运气是比较不错的，晚年生活也会过得比较的舒心，悠闲。
          八字身弱，官杀旺克身太过的人，会有点笨，加上又是五行土旺，土旺也代表是厚道老实不太聪明的表现，也代表你会让人觉得比较老实，甚至不太灵活聪明，比较死板。
          这是你的缺点，但也是你的优点，有的人喜欢找聪明的人办事，有的人喜欢找老实的人办事，如果你能意识到自己的长处所在，找到适合自己的位置，也能够发挥自己相对优势的一面。
          但是你的官杀旺克身，容易过度追求细节，自己给自己压力太多，导致承受不了而工作变换频繁，是不利你积累的，你要克服自己这个毛病，做个长久的规划，好好坚持下去。
          整体来说你的八字整体格局层次是不高的，身弱官杀旺围绕贴身克日主，虽然有正印但化官杀力量不够，且不能很好的生助日主，加上早年大运不理想，会比较压抑辛苦，好的是你后面走的大运不错，你的压抑口吃的问题也会改善，后面钱财来的容易些，属于先苦后甜的运势。
          `
  }]
}

export default {
  酉时
}