const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '偏财   劫财   日元   正财',
  天干: '乙(木) 庚(金) 辛(金) 甲(木)',
  地支: '巳(火) 辰(土) 丑(土) 午(火)',
  遁藏: '正官   正印   枭神   七杀',
  大运: '己卯 戊寅 丁丑 丙子 乙亥 甲戌',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/177.html',
    命主甲: `春月辛金埋没等浪淘，中年创业名利双收
          `,
    珠玑: `此造出生日的日干为辛金，所以属辛金命。生三月辰土当令，湿土可生金，母旺子相，辛金气势不弱。尤其是见到月干透庚金，月柱庚辰。自坐丑土，日柱辛丑，皆为土生金旺，此时辛金日干自当身强。
          年支巳火，时支午火，此二火在地支中见辰、丑土，火去生土，并不去制金，反赚火土杂乱，喜水制伏。天干甲、乙木财星透出，身强喜木疏土为用，唯甲木坐午火，甲木不能破土，反助火旺。乙木见庚金，乙庚合，虽不能化金（地支有两火），亦两失其用。
          接着看到命中两土两金，对二木二火，似乎势均力敌，然两土两金占据了要害位置，一是月令，为提纲；二是日柱，自坐丑土，直接生金。对立方两火，虽说火能克金，然具体体现在此命造时，两火在两土之外围，不能进入辛庚金的范围，只能生土，土旺再去生金，反帮倒忙。两木地支无强根，且甲木被午火烧，乙木被庚金合，制土无力，可知此造仍属身旺。
          最喜见有水泄金秀气，并能制火。木运天干可行，地支生火不利。火运亦天干制金可行，地支火生土，土再生金，反助旺神不利，故忌土、金运。此造最喜见水为用神，然明水不见，仅藏辰、丑中为水之厍墓、余气，故须待遇水运引出才能成事。
          初运己卯、戊寅，上土下木，土为忌神，地支行木运生旺命中巳午火，未见有利。到丁火运，丙子年，丙丁火天干制旺金，子水运泄旺金之秀气，且能制火，才能得发挥，此年创业成功。其后北方水运有利，中年事业见成，名利双收。
          此命如果用一个故事来比喻的话，就是：辛金日主出在两座大矿山之中（庚辰、辛丑土生金旺，土中藏金，犹如矿山），自是身旺。而要开采它，本想用火炼金矿，谁知两火（已、午火）在矿山两旁之底下，见土不见金，只是火烧山土，徒然火炎土燥，反见不利。又想以木（甲、乙木）疏土，以挖到矿材，唯甲木又被山下之午火焚烧，乙木被另一座矿山（庚金）所纠结（乙庚合），无力挖土。
          最后只是寄望藏于两座矿山内的癸水（辰丑湿土内藏癸水），待行到水运时，将它从矿山中提炼出金属来（金生水）。所以要等到中年大运北方水地，才求谋成功，金矿采成。
          `
  }]
}

export default {
  午时
}