const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   伤官   日元   正财',
  天干: '己(土) 甲(木) 癸(水) 丙(火)',
  地支: '丑(土) 戌(土) 未(土) 辰(土)',
  遁藏: '七杀   正官   七杀   正官',
  大运: '癸酉 壬申 辛未 庚午 己巳 戊辰',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/165.html',
    命主甲: `癸水假从官杀名利双收，兼论从杀格的成立条件
          `,
    珠玑: `此造出生日的日干为癸水，所以属癸水命，生于九月戌土当旺之时，其身甚弱。又见自坐未土，年支丑土，时支辰土，地支辰、戌、丑、未四土齐全，旺土叠逢。
          再看天干，甲已合化土，丙火可生土。日主无强根（亥、子水），也不见有印（金）劫（水）生扶，满盘都是官杀星（土星），只好逆来顺受，顺从土之旺势而去，这样就可保全生机。所以此命入“特别格局”中的“从官杀格”（因为土是癸水日主的官杀星）。
          由于辰是水库，丑是水之余气，癸水日主尚有微根，所以当“假从官杀格”，从之不真，较之真从格，祸福略有不同。
          真从格局纯粹，大多生于富贵之家，行运得其喜用，大多可以继承父辈、祖辈的事业。就是逢逆运，只要不是犯旺，亦多履险如夷。但真从格这种格局，世不多见。
          假从格局虽不纯粹，而且多生于普通家庭，但如行喜用之运，也可发富发贵或富贵双全，只是时过境迁，就可能一落千丈，或遇凶祸，回复到原来的地位。
          平常所遇到的从格，大多属于假从，虽较普通格局易于发富发贵，但所遇的困难、所冒的风险，亦比普通格局大。
          “从官杀格”的构成和其取用的方法：日主无根，满盘都是官杀，四柱又完全不见食伤星，丝毫不见一点印星、比劫、禄刃的帮助。行运喜逢财、官杀；最忌食、伤克制官杀。原局有财星，行伤食运有财星来转化，则亦不忌。行印运泄官杀助日干，以及行比劫、禄刃运，帮日干克制财星，中途变志，均主危亡。
          所以此造喜火、土为用神，最忌逆其土之旺势，即忌木运克旺土，也忌日主逢根破格，即忌水还原和克火，也忌金运泄土气生水。即本命造喜火、土，忌木、水、金。
          早运癸酉、壬申，金水齐来，早年不利，家道中落，中途辍学。午火运创业，经己巳、戊辰，二十几年火土运助，事业成功，名利双收，寿八十一岁。
          `
  }]
}

export default {
  辰时
}