const 辰时 = {
  公历: [{
    甲: '1992-11-16 09:45:00'
  }],
  农历: [{
    甲: '1992年十月二十二日巳时'
  }],
  十神: '七杀   正财   日元   正官',
  天干: '壬(水) 辛(金) 丙(火) 癸(水)',
  地支: '申(金) 亥(水) 申(金) 巳(火)',
  遁藏: '偏财   七杀   偏财   比肩',
  大运: '己酉 戊申 丁未 丙午 乙巳 甲辰',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/228.html',
    命主甲: ``,
    珠玑: `此造出生日的日干为丁火，所以属丁火命。生九月土旺秉令，丁火之气尽泄于土，戌中一点火库，微乎其微。
          也就是说日干丁火一生来就遇到戊土（戌中以戊土为本气，最强。内藏丁火只不过为火之墓库，火之弱根），还未站稳脚根，就忙着去生土，泄弱丁火之气，所以说先天生下来就属身弱。然后用这个身弱的丁火，去配合其余六个字（除日干和月支外的六个字）。
          看看有没有能帮助丁火的五行（例如木和火），有多少？会不会扶助太过，又使得日干丁火转弱为强？或者是虽有木火扶助，但力量仍不够，行运仍喜木火。或者是与日干丁火对立的土、金、水继续增多，使得丁火更弱？或者是弱到完全没有一点儿木火的生助，就考虑是否能入特别格局中的从弱格来处理了。
          上述就是此造如何判断出日干的强弱，继而取出喜、忌神的推断路径。现根据这条路径走下去。很快发现日干丁火自坐酉金，火金相克，火气更弱了。时柱地支辰土，为湿土，更加泄弱火气；且辰酉合金，土化成金，这个合局对丁火没有一点帮助。
          再看年支又是辰湿土，且辰戌相冲，辰中癸水冲戌中丁火，唯有土加重了力量，这个冲对丁火可不是好事，使得原来已经微弱的火根更衰退弱了。如此一来，地支三土一金，都是火的对立面，使得本来就弱的丁火更弱了。
          再看天干，年干壬水，月干庚金，金、水也是丁火的敌人（水克火，火金相克）。此时发现日干丁火已经很孤立无援了，很快就要向它的对立方（土、金、水）举手投降，即不要自已，投向对方怀抱，成为特别格局中的从土金水旺势的从势格。
          但此时忽然见到最后的时干是甲木，它领着一队救兵姗姗来迟，并大叫：“丁妹（丁火属阴，排在丙火之后，属妹）不要走，我甲木来救你也。”原来甲木可以生丁火，尤其是在九月土旺之地，兼能克制戊土，一举两得。日干丁火见有甲木救兵来救援，自然不能投入包围着它的土金水阵营，便跟“从势格”说声拜拜！回归正常格局中来推算了。
          也许有人说，以甲木为用，而月干庚金克甲木，岂不是用神受伤？但在这里，由于配合的关系，刚好需要“庚金劈甲引丁”，因为甲木是松柏参天大树，太粗不能直接生丁火，必须砍下来后，用斧头（庚金）将它劈成柴，才能引燃丁火，所以才有“庚金劈甲引丁”之说。
          经过这场惊心动魄的日干强弱对决大战，虽然甲木能及时支持丁火，暂时不败，但双方强弱衰旺的差距还是很大，日后要想行好运，心想事成，求谋有得，当然仍是喜得木、火的帮助，忌见到对方的土、金、水，所以，此命取出的喜用神是木、火，忌神是土、金、水。
          现将取出来的喜、忌神放进大运中去验证，看有没有取错。早年行己酉、戊申土金运，都是忌神，应在早年家境不好，靠父、兄市场卖鱼，兄弟姐妹众多，母亲在家做家务。丁未运开始入南方火运，丁火帮身，时来运转。此仍为文化大革命期间，因为家庭出身是城市贫民，属无产阶段，成分好，直接由学校分配到大学做杂工，
          比起当年百分之九十九的学生被赶到农村或农场做“耕狗”简直如中六合彩，令同辈人羡慕不已。（“耕狗”是由知识分子沦为耕田佬的自我卑称。也有自称“揸七”。揸是广州话“拿”的意思，“七”字像锄头，即去农村拿锄头）。
          其后三十年巳午未南方火运、生助日干丁火，自是“春风得意马蹄疾，一日看尽长安花”。
          然而“人无千日好，花无百日红”，转眼来到甲辰运，此为冲提纲之运，一般出现在六十岁左右，指此时的大运与月柱相冲，在这里是指庚甲相克，辰戌相冲。
          盲人算命往往把冲提纲的运当作生死大关，这个关每个人都会遇到，因为出于十天干、十二地支的排列组合：大运是以月令提纲为准，顺行或逆数，到了第六对大运，即六十岁左右，必定会与月令提纲相冲，而月令提纲又是一个八字中最重要之地，此地受冲，的确带有一定危险性。所以说“冲提者五防三四”，就是这个意思。
          当然不是每个人都会出事过不去，否则就没有七老八十的人了，具体要看配合。现看到此命中里已经有一对甲辰（时柱甲辰），现行甲辰大运，甲辰运遇命中的甲辰，叫“伏吟”；甲辰运又冲命中提纲月柱庚戌，叫“反吟”。命书中常说：反吟伏吟，泣哭淋淋；不损自己，也损他人。
          所以在此运中，前五年甲木运，木生火有利，依然可过。但后五年辰运冲戌提纲，就危险难过了。因为前面说过，在此命中，年地支与月地支已有一对辰戌相冲，使得戌中丁火之微根受损了。到了此时再加上大运辰来冲戌，戌中丁火受损之微根恐怕就此被冲灭了。
          也就是说炉灶中唯一的火种灭掉，纵使有甲木加进去，也没法烧得起来。加上前面三十五年好运已享受过，犹如鲜花已经盛开过，再遇风吹雨打，必然会凋谢而亡，其后果真在此运中因病身亡。
          此命的缺点是日干丁火在地支中只有藏在戌土中的微根，且受到年支辰土之冲（辰中癸水克戌土中的丁火），微根受伤；且用神甲木只透天干，地支无寅、卯木强根，只有辰土余气，即用神无力。所以到了六十岁左右的冲提纲之辰运时，再次受冲，丁火微根危矣。
          假如地支有寅木或巳、午火根，当不至于此，此关可过。其二是命中时柱与月柱天克地冲（反吟），到了冲提纲之甲辰运时，又与时柱伏吟，与提纲月柱反吟，多重振动，终于破裂。
          `
  }]
}

export default {
  辰时
}