const 未时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1988年六月十四日未时'
  }],
  十神: '正官   七杀   日元   七杀',
  天干: '戊(土) 己(土) 癸(水) 己(土)',
  地支: '辰(土) 未(土) 未(土) 未(土)',
  遁藏: '正官   七杀   七杀   七杀',
  大运: '庚申，辛酉，壬戌，癸亥，甲子，乙丑，丙寅，丁卯，5岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/381.html',
    命主甲: `出生于河北省唐山市迁安市。男32岁，目前在待业。
          自身的情况相对复杂，14年退伍后，我在16年17年做生意赔了很多钱，于18年初离婚了，所以这几年我经济水平一直很差，很缺钱，
          但是有一个比较好的情况是，我感觉我的主见，抗压能力，和一些综合能力得到了一定提升，所以目前也想通过自己创造财富。
          `,
    珠玑: `八字分析：癸水日主生在未月失令，未月本气为土，土旺，火退气但余气还在，月干透出己土增加土的力量克日主大，日支也是未土，年柱是戊辰土干支一气，时柱己未土也是干支一气的组合，癸水日主弱而无强根，
          八字都是土，五行土旺，癸水日主势单力薄，从了土的力量，所以八字总体而言喜火土为用神，金水木为忌神。
          事业分析：你的八字年柱，月柱，时柱，以及日支都是官杀，八字从七杀，七杀为喜，说明你为人是有侠义之心，为人有志气，进取心强，有开创精神，但争斗心也比较强，有些喜欢冒险，讨厌虚伪客套，有时候在人际关系上处理不太好，也会有些自我，急于求成，冲动，个性太过刚强，偏激。
          你八字属于从杀格，八字原局中的官杀力量强旺，没有其他明显的五行扰乱，从杀的趋势是非常明显的，八字原局五行比较清纯，八字原局层次是不错的，一般从杀格，很适合往公检法，军警，医生等方向发展。
          当然从格的要求很高，并不是说八字成了格局，就一定都好，也要结合大运组合来看，你的大运早年一路走的是印星，比劫，食伤的大运，属于明显的忌神运气，破格了，到45岁运后运势对你才稍好些，可以说大运对你发展不利，影响了格局层次，整体小康好些。
          八字从杀，适合往公检法，军警，医生发展，当然八字成了格局，大运配合也好的话，也可以做生意取得成就，因为从杀的人，开创精神比较强，又有魄力，八字原局好，同时有大运的辅助是很容易成功的，
          但你的大运一路走的不太好，创业生意会亏本破财，大运破格了，导致整体格局不高，不适合做生意吗，最好是求稳，在职场发展比较好。
          婚姻分析：未土为婚姻宫，八字婚姻宫为七杀，年月柱，时柱都是官杀，虽然为喜用神，但婚姻宫伏吟三现，感情是不稳定的，同时八字以丙火为正财，财星本身不显也不旺，而官杀旺很容易泄耗财星，导致妻星不旺，不利婚姻。
          加上官杀混杂，又从七杀星，在感情中容易忽视对方感受，真正相处久了脾气不太好，容易多疑，忽视对方感受，大男人主义，导致不合的争吵矛盾，造成分离危机。
          你下段婚姻要到八字中财星力量增强，且合住婚姻宫的时候，2026年婚姻宫逢合且八字正财坐强根透出的时候，有结婚的运气。
          子女分析：男命一般以官杀为子女，你八字官杀旺且从官杀之势，子女运还是较旺的，子女宫临喜神又是子女星，子女运不会差，也有子女的福分，晚年运气过得还算平稳。
          大运分析：25岁-34岁走的是壬戌大运，此大运劫财生助日主增加八字水的力量，大运天干坐戌土戳脚，对你的发展还是有帮助的，
          只是大运地支与年柱辰戌冲，而辰为土之库被冲，容易导致官杀不稳定，此大运整体运势不太平稳，特别是遇到金水流年，及水火相克的流年要多注意下，火土旺的年份相对好些。婚姻宫为七杀且伏吟，大运地支冲辰土，与未土相刑，导致婚姻宫及官杀不稳定，容易因为感情事情烦恼，也有感情危机的发生。
          35岁-44岁走的是癸亥大运，此大运属于旺水的大运，大运使得癸水日主得到比较大的帮扶，且水见强根，此大运属于从杀破格，格局被破，对你的事业是不利的，压力大，小人多，开支花销多，低调求稳发展比较好。比劫帮身，官杀克日主和比劫，婚姻也不太好。
          甲子大运，甲木与己土合化，地支子水逢旺土难以破局，所以此大运事业求财还不错，会有所提升。
          乙丑大运，天干乙木无合，大运上克下，地支与八字丑未冲，土官杀星被冲动，运势不稳定，属宜求稳发展比较好，火土旺的年份还可以。
          后面的丙寅，丁卯大运，地支生天干，力量集中在天干为喜，晚年运势还算平稳，可安享晚年。
          你的八字属于从杀格，八字官杀力量强，五行全是土，力量气势都比较纯，八字原局还是不错的，但不是说从格就一定都好，要结合大运组合，综合下定论。
          你从工作开始走的是比劫，食伤等运势，同时地支官杀被冲而引动，属于破格的大运，对你发展是不利的，运势容易起伏不定。好比一腔热血抱负，但做事总是处处受阻，不得志，也容易心情压抑，烦闷。
          人的一生，到底是命好，还是运好呢？命好比是八字原局，可以代表一个人来到世上的层次高低，而运可以代表你做事顺利程度。
          一个人八字原局高，但走的运势不好，身边的人和事总是不顺利，郁闷寡欢。一个人八字原局低，但走的运势好，虽然没有大富贵，但做事顺利，小康小富，知足常乐，幸福指数也很高。
          另外你要注意，尤其是金水旺的年份，以及水火冲克的年份，对你运势不好，最好是求稳发展，不要去做投资生意之类，容易破财亏本。好在晚年走的运气还可以，晚年生活稳定，可以享受晚年。
          `
  }]
}

export default {
  未时
}