const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1994年十一月初四亥时'
  }],
  十神: '枭神   正印   日元   伤官',
  天干: '甲(木) 乙(土) 丙(火) 己(土)',
  地支: '戌(土) 亥(水) 寅(木) 亥(水)',
  遁藏: '食神   七杀   枭神   七杀',
  大运: '甲戌，癸酉，壬申，辛未，庚午，己巳，戊辰，丁卯，11岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/375.html',
    命主甲: `我对于玄学这方面很感兴趣，有时间也会翻看老师写的文章，觉得老师写的很好，很发人深省。我自小学时期父母就离婚了，一直以来安全感不是很。
          目前很有一种中年危机的感觉，对以后的发展也有些迷茫。感情方面现在很稳定，前几年被一段感情伤的很深，现在好了很多，但还是不愿想起之前的感情经历。
          `,
    珠玑: `八字分析：丙火为太阳之光，有光芒万丈之势，能够照亮大地，温暖身边的每一个人。丙火坐下寅木为偏印，丙寅日主大都具有一定的文采，一般文科好于理科。丙火生于亥月，为七杀格，寅亥合为七杀偏印的组合，一般不利事业。但天干透出正印乙木，引化了亥中偏印的力量，杀印相生是不错的组合。
          时上透出己土伤官，为伤官配印，也是很不错的组合。伤官己土和偏印甲木一合，两个不好的十神皆得到制约。此命唯一的缺点是坐下寅木被左右亥水合克，寅中丙火受伤严重，寅木为日主的长生，受伤就会显得没有生机。
          事业分析：月柱乙亥杀印相生的组合，八字五行上还算流通，杀印相生有开创精神，有上进心，为人也比较正直传统，没有太多歪肠子，但印星旺生日主，所以有时候也会有些想得多，疑虑和顾虑多，有危机意识，印星旺容易克食伤，导致想得多而做得少，有想法而没有实际行动力。
          你的八字中财星不太旺，如果大运又无财运的话，财富收入不会太高。但逢七杀，杀逢印流通，代表事业还算平稳，体面，没有太明显的大起大落，算是比较安稳的工作状态。
          只是八字印旺，有时会比较忙碌，加班加点，结合大运走势看，一路走的是财生官杀到后面的财，食伤大运，对你的事业发展是有帮助的，虽然没有什么大财，但小财还是有的。
          现在走的是癸酉大运，天干官印相生流通，地支逢财星，大运财生官，整体财运还算平稳，只是财星的力量不太大，财星被泄，所以也开支花销也不少，虽然没有大财，但运势总体算平稳。
          你要到壬申大运，2028年食神生财的时候运势会好些，且到41岁开始走伤官生财，财合身大运，也有更好的发展。
          八字喜食伤，财，比劫，所以是可以做些小生意的，但要等待时机，行业可以选择五行火土的行业，适合的方位是西北，西南，东北及正西的正南的方位。
          婚姻分析：寅木为婚姻宫，婚姻宫与月令和时支亥水相合，而亥水是七杀八字正官不显，七杀代表是偏官，不那么正的缘分，会经历些烂桃花才能遇到相对好的对象，婚姻宫寅木为偏印，能够化七杀，代表还是能够遇到些桃花对你的感情还算可以，注意避免感情纠葛。
          但婚姻宫寅木为印星，寅亥合，寅木中丙火被灭不太好，代表对象出身条件不是很好，对你的帮助不大，但婚后可以通过自身努力提升经济水平。
          八字印旺贴身，七杀与婚姻宫争合，容易招惹烂桃花，同时有的时候敏感，疑心重，多虑，而容易引起感情矛盾，加上七杀旺，印重，顾虑多，计较多，相处久了不满情绪也会慢慢滋生，而影响到感情发展。
          月令为七杀，地支杀印相生，当正官星力量强，得财生时有结婚的运气；目前刚好走癸酉大运，财生官，官星力量增加，故而此大运里有结婚运气。
          明年2021辛丑年日柱与大运财生官，地支半合财局生官星，明年你是有结婚运的。
          子女运方面，食伤星不旺，而八字印旺，且透出力量不强，有不利子女怀孕的信息，要孩子前注意先调理。但晚年走食伤运还算可以，也能够享到子女福分。
          要孩子的话最好走财旺的流年大运，财克印或食伤旺，要孩子比较好，比如2021年，2026年，2027年比劫旺泄印也还可以。
          大运分析：21岁-30岁走的是癸酉大运，此大运财生官，官印相生，对你的事业是有帮助的， 而财化官，利事业，但钱财收入就不是很大，开支花销比较多些，但工作相对平稳，而八字大运有伤官见官的组合，要注意下人际关系，避免口舌是非矛盾。
          31岁-40岁走的是壬申大运，此大运财生七杀，天干官印相生，但印旺流通，事业有发展机会，但压力也不小，需要多付出努力才有进步，地支寅申驿马相冲，财冲印，要注意人际关系，预防钱财方面纠纷问题。容易有异性桃花运，容易被纠缠，且地支婚姻宫逢冲，婚姻不稳定，容易有婚姻危机。
          辛未大运伤官生财，财星力量增加，且财合日主，钱财收入增长，个人能力也能够得以发挥，属于收获的运气，财运可以更上一楼层。
          庚午大运，地支比劫旺，天干乙庚和，事业有利有弊，自己会有些投资计划，但竞争太大，往往别人比你做的好，要注意预防小人，被干扰上当，不要借钱给别人，运势不算太好。
          后面的己巳大运，戊辰大运，八字日主泄秀，整体运势还算可以，晚年运势比较平稳安逸。
          八字月令七杀，月干正印，日支偏印，杀印相生，日主木旺且在水旺的月份，容易木多火塞，难流通。而八字干支印旺，可以化七杀，对你事业运是有帮助的，只是财不显，财运不太旺，收入虽然不是非常大，但工作还算平稳，大运走势也还算可以，大财没有，小财还是有的。
          `
  }]
}

export default {
  亥时
}