const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '食神   比肩   日元   七杀',
  天干: '辛(金) 己(土) 己(土) 乙(木)',
  地支: '巳(火) 亥(水) 卯(木) 亥(水)',
  遁藏: '正印   正财   七杀   正财',
  大运: '戊戌 丁酉 丙申 乙未 甲午 癸巳',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/53.html',
    命主甲: ``,
    珠玑: `此造出生日的日干为己土，所以属己土命，己土为田园之土，生在十月亥水当令，己土临绝地；犹如家中的后园，入冬后田园卑湿，湿泥寒冻，毫无生意。此时最需要什么？
          最需要的是丙火太阳照暖，调候为急。现看到八字中年支为巳火，内藏丙戊庚，暖土、生土可用。月干透己土助身，喜用皆具，似乎不错。
          但细看之下，巳火见亥月，巳亥相冲，冬令水旺（最旺）、火死（最衰），此一冲，亥水胜巳火败。天干时干乙木透出克己土，冬令木相（次旺）、土囚（次衰），亦木赢土输，此己土被制，帮忙乏力。
          再看日干自坐卯木，时干又坐亥水，且亥卯半合木局，加强了乙木克日干己土之力。
          此时见辛金年干透出，以为可用辛金制乙木以护日主己土，唯辛乙远隔，地支无金之强根，冬月金休（衰）、木相（次旺），无力克倒木。
          且在辛金克乙之前，已见己土生金泄气，反令日干己土成克、泄交集之象，更其不利。故不能用金，唯见火、土为利，但火、土用神皆受伤，非佳造也。
          以前文章写到，格局配合有情，用神有力，行运不背，可成富贵好命。现此造刚好相反，喜用巳火被亥水冲灭，己土被乙木克制，忌神亥卯半合木，忌神得力，用神无力，配合无情，不佳之造。
          格局配合有情、用神有力、行运不背有好命。
          具体表现在财（水）生杀（木）旺，财杀（水木）过重，克身（日主己土）太过，印（巳火）、劫（己土）生扶无力，日干太弱受伤，故自幼残疾。
          其实命书中有云：丙临申位遇阳水，难获延年。己入亥宫见阴木，终为损寿。便是此命的写照。
          己入亥宫，有人说是己亥日，也有人指是己生亥月，不管怎样，都是说己土日主见到亥月或亥日，自然身弱。如果其它干支不见有强力火土相助，反而见有阴木（乙木）来克的话，己土便会崩折，非残即夭了。
          此造己土日干生亥月、亥时，明显见弱，阴木乙透出，且值强根卯木来克己土，巳火遥远且受亥水之冲，无力为救，自幼即为残疾之命。
          `
  }]
}

export default {
  亥时
}