const 卯时 = {
  公历: [{
    甲: '1985-03-20 5:00:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正官   劫财   日元   正官',
  天干: '乙(木) 己(土) 戊(土) 乙(木)',
  地支: '丑(土) 卯(木) 午(火) 卯(木)',
  遁藏: '劫财   正官   正印   正官',
  大运: '庚辰，辛巳，壬午，癸未，甲申，乙酉，丙戌，丁亥，戊子，6岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/510.html',
    命主甲: `家庭：父亲秉持着总有刁民想害朕并强迫家人接受这种思维，能对襁褓中的我不止一次头朝地摔，导致我得过癫痫、脸上受伤挖掉块肉没打麻药生缝后歪了、甩沙发角上脸上有伤坑。母亲性格暴躁心高气傲，在丧偶式婚姻里越来越跋扈。说我爸几次摔我头都没死命硬克弟弟，我受欺的时候就说是我命如此。
          只要跟我弟有争执，无条件是我的错，成天主持公道说我欺负弟弟。对子女希望最少的投资得到超常的回报，觉得自己是为了子女才受的苦，接受不了平庸的子女。
          弟弟因为家庭的偏爱养成了自私的性格，仇视我为多余，不要的东西扔掉都不会给我，要我给东西必须得是新的好的，得的多仍觉委屈，帮他还反咬一口，颠倒黑白胡搅蛮缠。
          母亲喜欢一夜暴富，次次投资失败，小时候过得很惨，对我随意打骂发泄，双职工家庭吃带虫的馊饭，穿男孩子的旧衣服，成天吃不饱穿不暖，身体几乎处于低电量待机状态越来越弱也从不关心。没想到花甲之年依然不改贪心本质，吃住不愁的条件还想好高骛远扩建房子来满足虚荣心，恨不得能管到儿子死。
          现在他们三人在家成天相互打骂，父母嘴上抱怨儿子气死人，却用实际行动鼓励着他的恶劣：儿子30好几称病不工作，父母还要伺候他吃喝，忽悠女儿当扶弟魔。曾经给女儿的付出说给得不情愿，因为给了你就亏待了弟弟，要算回来给儿子。
          我的心态从平和、争斗、愤怒到远离。不想像过去一样，得一小部分就要负责全部养老，同时还要受他们的精神折磨和谩骂，想接受风俗放弃财产但怕放弃以后仍道德绑架加用法律压我，感觉在这份关系中快要变态了，身体已经气坏了。
          原本还心痛母亲想解救她，但我发现她不但看不到我的付出，伸手拉她都会被捅，心凉了现在只想自救。
          事业：每天沉浸在负面情绪中，不明白读书的意义，只考了专科。跨行几次工作无起色，只是远离家乡活着。工作生活情感不顺，总结下来是没有正常思维。这些年最大的收获就是强行扭转了很多错误思维，在此之前思维混乱到快要发疯。
          未来是迷茫，但心里清楚绝不能回家。深知现在能力不足以扎根上海，想通过考研或考个金融国际证书，等入行稳定后再利用周末做化妆品直销。
          感情：自己谈的不顺利，相亲的不愿意接触，因为知道家里在算计对方的家庭条件，希望通过我的婚姻给我弟做房子娶老婆。年近30，母亲进去了(想修炼改命)，因此被甩，一直拖到现在，出来后发现她的性格和言行并没有什么改变。
          `,
    珠玑: `八字分析：戊土日主为人中正，往往能够坚持自己的立场。戊土坐午火为阳刃，本身性格也是不容易屈服，有一股子倔劲。戊土生于卯月，天干透出乙木为正官格，正官格为贵格需要好好保护。但卯午破，午火阳刃为半个禄，禄和正官两败俱伤，格局破掉了。同时，婚姻宫逢破也不利于婚姻。
          六亲分析：八字印旺劫财较多，日坐午火阳刃之上，自己也脾气比较暴躁，性格固执倔犟，容易钻牛角尖，处事不圆融，八字不见食伤来泄秀，不善于表达，有时候容易压抑自我，心情郁闷难以发泄，容易想不开，难以处理好家庭关系。
          八字以印星代表母亲，戊土日主坐午火印星之上，印星为忌神，母亲对自己不够疼爱。以正财代表父亲，癸水正财星暗藏于丑土之中，不显不透，父亲和自己缘分较浅，父母均对自己帮助不大，地支丑午相害，代表原生家庭环境不太好。
          结合你走的大运来看，6-15岁走的是庚辰大运，庚金食神为喜用神透出，但乙庚相合被合拌，地支卯辰相害，卯木官星受损，食神被合拌则心情不好，抑郁难以排解，童年过得不幸福。
          16-25虽走的是辛巳大运，天干辛金伤官星被地支巳火截脚，为印星截脚伤官的大运，人比较抑郁，心情烦闷，烦恼较多。
          事业分析：印星贴身较旺，劫财帮身，正官为用神，事业心较重，性格好强，不会轻易服输，具有管理天赋，很适合从事管理工作，有成为女强人潜质。
          原局不见食伤泄秀，日支午火正印得到卯木正官生扶，原局不见金水来制官印，则人比较愚钝，不是很灵活，学习能力较差。你早年走的庚辰，辛巳大运，虽为食伤大运，被合拌或被印星所制，难以取得高学历和文凭。
          正官得令贴身，为人是比较正直的，自我约束力较强，做事比较讲规矩，但思想有时候比较正统古板，创新力较差，这种性格适合在职场打拼，不太适合去搞一些需要灵活性很高的工作，销售不太适合，尤其你的口才不好，缺少了做销售的必备条件化妆品直销不适合你。原局正星多于动星，也适合坐办公室的工作，不适合跑动奔波求财。
          你的八字以金水为用，金融属金水，从事金融相关工作是适合你的，可以尽力去考取金融方面的证书，能进入银行等金融机构上班比较理想。
          年支丑土和日支午火相害，为外出求财之象，印星为忌有家乡的意象，适合外出安家置业，离开原生家庭是没问题的，也利于你的发展。要不要在上海发展，你慎重考虑，没有太过硬的实力不太建议留在一线城市打拼。去出生地的东方，西方，北方，东南方，西北方适合你。
          八字虽有官星，但没有财来生官，从大运来看，现在走的正财大运，身旺可以担财，财运还是有的，接下来走的是官杀运，但地支又是比劫食伤，大运稍好但有不足，财富等级不愁吃穿，福禄双全，中产以下。
          婚姻分析：日支午火为婚姻宫，地支丑午相害，则火婚姻宫受损不吉，午火正印星为忌神，婚后婚姻环境不理想，夫妻矛盾较多。但你的八字正官星为用，则婚后对你的运势会有所帮助。
          另外你的八字劫财较多，正官也较多，有比劫夺官之象，要注意婚后其他女性插足问题。月支卯木和时支卯木为桃花，也要注意婚后自己心生二心问题。
          2023年为癸卯年，天干戊癸相合，癸水正财星被合入，地支卯木正官星一并被合入，则有结婚的运气。
          未来对象长的英俊潇洒，肤色红润不黑不是很白，眉毛如剑，眼睛有神，嘴唇微薄，声音比较的宏亮，身高177左右，低调朴实，不善言辞，年龄比你大，经济条件较为一般，对你帮助不大。
          八字不见食伤星，只有年支丑土中暗藏辛金伤官，伤官不显不透，地支丑午相害，丑土连同辛金一同受损，丑土空亡，子女缘分较弱，子女迟，生育困难，不容易获得。时柱乙卯正官星为用神，未来子女有出息，晚年有靠。
          大运分析：36岁-45岁走的是癸未大运，此大运天干癸水被地支未土戳脚，天干戊癸相合，正财合身，身旺可以担财，此大运考虑考一份正式工作，依靠工资财谋生，劫财夺财的大运，破财事情较多，不要去做什么投资外借，有去无回。
          46岁-55岁走的是甲申大运，此大运天干甲木被地支申金戳脚，甲木七杀星透出，但甲己相合，甲木被己土合拌，去杀留官为吉。但地支申金食神去克了卯木正官星，容易对工作，领导同事不满，注意是非口舌之事，要多注意。
          56岁-65岁走的是乙酉大运，此大运天干乙木被地支酉金戳脚，地支卯酉相冲，构成伤官克官，要注意婚姻关系，很容易发生口角，家庭不和谐，事业上也要注意官非口舌之事。
          丙戌大运为印比大运，旺了忌神不吉，且卯戌相合，卯木用神被合拌，要注意健康问题。
          丁亥大运，天干丁火被地支亥水戳脚，亥水在地支去制午火，运势较为理想。
          你平时可以佩戴黑曜石材质的饰品或黑檀木手串，家里可以养点花草盆景，摆放一个鱼缸养金鱼，睡觉床头可以挂一个木葫芦，对你的运势会有所帮助。
          `
  }]
}

export default {
  卯时
}