const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   正官   日元   食神',
  天干: '辛(金) 庚(金) 乙(木) 丁(火)',
  地支: '未(土) 子(水) 丑(土) 亥(水)',
  遁藏: '偏财   枭神   偏财   正印',
  大运: '辛丑 壬寅 癸卯 甲辰 乙巳 丙午',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/126.html',
    命主甲: `寒木向阳有病有药成贵征
          `,
    珠玑: `上一命例：辛未 庚子 乙丑 丁亥，
          如果读者看过上一篇文章的话，便会发现，此篇命例和上一篇文章中的命例有些相似，都是乙木命，也是生在冬令寒冷之时，地支也是水多，时干也是透出丁火来取暖。
          而此命中地支亥子丑三合水局，上一篇文章中的命例只是地支两亥水。此命天干透出庚辛二金去克乙木和生水，上一篇文章中的命例只是透出一庚金。于是似乎认为，此命的配合比上例更差。上例之命已是“金玉其外，败絮其中”了，此例岂不是会更倒霉了吗？
          非也，此命乃是一富贵女命。
          那为何相差这么大呢？全靠年支一未土也。未为燥土，内藏己、丁、乙，亦是木之墓库，火之余气。有此未土，时干丁火有根，便可用了。上造中地支全是湿土、水，无火根，时干丁火无能为力。
          且未为燥土能止水，亥子丑水局经过未燥热之土的温培，便能生木，化忌为喜。天干丁火有未土为根，便能调候和制杀存官（用丁火食神克制辛金七杀，保存庚金正官），转浊为清，这些就是有病有药，反成贵征。
          什么是病？什么是药？在此例中，地支亥子丑三合水局，水旺木浮，且冬令湿木见水，反生为克，这就是病。然一见未燥土，犹如一温床，既能止住水局，又能暖水生木，反克为生，这未土就是药。
          再看天干，女命透出庚、辛二官星，为官煞混杂，见之不贵，这是病。但时干丁火有未土为根，可用丁火制杀（辛金）存官（庚金），转浊为清，这丁火就是药。
          上一篇文章中的命例就是有病无药，区别在于此也。如命书中说：“干支之中，暗藏一字，有旋转乾坤之力量，全局精神，由此振起，则此神即是真神。真神得用，自可为富为贵。”此命富贵的原因就是在于这里。
          如果有读者不理解上面的论述的话，可以打个比喻：有二个乙木命，乙木是芝兰、卉草、灌木等，二个都是生长在冬天，天寒地冻，滴水成冰之期。前一个命造的芝兰、卉草生长在室外，直接浸在冰冻的池塘中，在室外，即使上方有一盏灯在照明，但丝毫不觉得温暖，生机索然。
          但后一个命造中的芝兰、卉草犹如生长在温室之中，地上铺了一层温床，即使冰冻的水经过了温暖的土壤，也能让水变暖，让芝兰卉草生机勃勃，温室内的灯火也能照暖光明，有如：“兰若生春阳，涉冬犹盛滋。”（兰若两种香草虽长在阳春温暖的时季，现经历寒冬仍然滋盛。）这还不是一个好命吗！
          `
  }]
}

export default {
  丑时
}