const 申时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   劫财   日元   劫财',
  天干: '戊(土) 甲(木) 乙(木) 甲(木)',
  地支: '寅(木) 子(水) 亥(水) 申(金)',
  遁藏: '劫财   枭神   正印   正官',
  大运: '乙丑 丙寅 丁卯 戊辰 己巳 庚午',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/67.html',
    命主甲: ``,
    珠玑: `日干为乙木，所以属乙木命，可将自己想象为藤蔓，芝兰，蒿草等，生于冬令十一月，子水当旺之时，且仲冬严寒凛冽，寒水结冰，犹如一棵芝兰浸在冰水里，会有什么感受呢？当然首喜见火来解冻除寒。
          现再见日支亥水，时支申金，寒金生冻水，更其难受。幸好不见有壬、癸水透出，反见两甲木相助，年支寅木为根，乙木日主本身算强，所以不算水旺木浮。而是旺水浸淫，寒木见水，反生为克，需见厚土以止水，喜重火以暄之。
          现见戊土透出年干，正想制水之时，然见天干两甲木相克，且戊土仅虚浮天干，地支无厚根。戊土自顾不暇，制水无力。
          八字明火不见，寒木喜向阳，唯取寅中丙火为用，然地支申子亥金水强于寅中丙火，可见格局配合无情，喜用神火、土受伤无力，天干群劫争财（两甲木争克戊土），平生何能致富？
          换句易懂的话来说，这个八字中唯一的一点财星（戊土）虚浮天干，地支无深厚的财根（土根），且天干已见有两个小人（两甲木，指朋友、兄弟姐妹或客户、或合资人等）等来劫你的财（两甲木争克戊土），地支二水一金浸侵木根。
          水为印，为忌神时指上当受骗；金为官非，事非。指起码有二次上当，一次官非。寅中丙火（伤官）生财（土）无力，指其人赚钱能力有限。
          综合起来说，这个八字的人生来带来的财力很薄，赚钱的本事也有限，而且早已被小人瞄上，破财的机会很多，也容易上当受骗和犯官非，你说这种人会发财吗？乃一世不会发财的命也。
          取用神为喜火、土，忌水、木。金运天干制木可行；地支生水、冲克寅中丙火不吉。戊、己两土运，财星主事，然受命中两甲木回克。
          `
  }]
}

export default {
  申时
}