const 丑时 = {
  公历: [{
    甲: '2001-02-12 01:45:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   偏财   日元   伤官',
  天干: '辛(金) 庚(金) 丙(火) 己(土)',
  地支: '巳(火) 寅(木) 午(火) 丑(土)',
  遁藏: '比肩   枭神   劫财   伤官',
  大运: '己丑，戊子，丁亥，丙戌，乙酉，甲申，癸未，壬午，辛巳，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/506.html',
    命主甲: `目前是大学生本科在读，学的计算机专业。家庭条件后期一般而已，自己虽不富有但一直不会穷不怎么缺钱花，在己亥年高考发挥超常同年也靠自己网上做点小生意赚了人生第一小桶金，一直以来我个人是比较独立比较有自己的思想，也有规划自己存款和未来收入。
          目前是学生没有收入，在学习等待出来实习工作。对于实践学习比较灵敏，喜欢钻研有兴趣的技术。本人长相相对可以，身边一直不缺异性的喜欢。
          `,
    珠玑: `八字分析：丙午日自坐阳刃，心气强，又生于寅月长生，大多数时候是精力充沛，意气风发之人。寅已相刑虽然刑到了禄，但远在年支，影响减轻。不过，长生和禄相刑，自己内心容易产生矛盾，寅木被一已一午相泄，对应的身体部位也应该注意。
          丑时不好，晦了禄，但伤官不错，能让你展现才华。
          事业分析：八字身旺而不见官杀，官杀可以代表自律自制等，而天干财星和伤官星透出，代表一个人的享受等，则人是比较散漫爱自由的，自我约束能力较差，丙火日主坐午火阳刃之上，人比较固执，脾气不太好，地支伤官泄比劫，性格上比较浮躁，容易急于求成，缺乏做事的沉稳和坚韧，这是需要克服的地方。
          月干庚金偏财透出贴身，时干己土伤官透出贴身，代表人求财的欲望比较大，贪心较重，不太容易满足，庚金偏财为用神，人是比较慷慨的，愿意为亲戚朋友同学花钱，人不吝啬，也容易受身边人欢迎，交际能力较好还可以，人缘不差。
          月干庚金偏财和时干己土伤官星透出，口才不错，表达能力很好，人比较有才华，适合从事咨询，语言，教育，经营策划等相关工作比较适合。
          八字伤官贴身为用，伤官来生财，很适合学习掌握一项过硬的技术求财。年干月干正偏财双透为喜用，从事金融财经相关专业和行业也是很适合你的。
          天干丙辛相合，身旺则辛金正财星被自己合入，代表可以得到这个财，正财代表工资财，也代表稳定的收入，找一份稳定的工作上班为吉。年支巳火为丙火日主的禄神，禄神和正财在年，代表远方之禄，异地之财，则很适合外出求财，不适合在家乡发展。去出生地的西方，西北方，东北方，西南方发展为吉。
          原局不见官杀，而伤官泄秀，有学历但也不是非常高。地支寅午拱火增加了劫财的力量，原局比劫较旺为忌，事业上很容易遭遇小人，竞争比较大，所以在交友以及和未来同事相处方面要特别注意。
          你的八字伤官和财星为用，很适合走技术路线，从事程序员是适合的，也建议你在大一点的平台去踏踏实实工作。
          年干辛金为正财星，月干庚金为偏财，财透天干，辛金坐巳火之上，庚金坐寅木之上为虚透之财，为外漏之财，代表很难存钱，理财能力较弱，财来财去不聚财。
          年干辛金正财坐巳火比肩之上，巳火中暗藏丙火，丙辛相合，辛金与巳火暗合，天干丙火日主也来合辛金正财，构成比肩夺财，为争夺之象，不适合与人合作求财，也不适合投资做生意，容易破财。
          时支丑土为金库，年干辛金和月干庚金见丑则入库，有财入门户之象。但地支丑午穿害，午火为阳刃力量较强，丑土受损，财星一起受损，代表容易财来得快，也容易去得快，注意理财。
          婚姻分析：丙火日主被庚金偏财和己土伤官贴身，容易对恋爱充满幻想，比较向往自由恋爱，也代表对另一半要求较高，眼光不低，比较挑剔，对女生相貌、外表、才华、经济条件等都比较看重，一般的异性难入法眼。
          八字正财和偏财在天干透出，丙火日主坐午火桃花，异性缘分很好，容易得到女性的青睐。
          但丙火日主坐午火阳刃劫财之上，真正感情相处久久了，和另一半相处中脾气是比较大的，人也比较任性，对另一半缺乏安全感和信任感，久而久之不利感情和谐，导致婚姻不稳定。
          你是阴差阳错日出生，日支午火为孤鸾煞，暗示内心较为孤独，婚姻生活容易产生矛盾纠纷。地支丑午穿害，日支婚姻宫受损，容易离婚。
          年干辛金正财可以代表妻子，辛金和丙火日主遥合，但中间隔了庚金偏财，偏财对对男人来说为偏缘，为妒合，从中阻碍了辛金合入，表示自己容易对感情三心二意，会因为其他女性破坏已有的感情，产生三角恋，自己是要注意的。
          八字财星混杂，先见正财后见偏财，且日支午火为桃花，代表婚后异性缘分不错。近偏财而远正财，爱妾不爱妻，喜新厌旧，婚姻中容易容易有婚后情人，这是要注意和克服的。
          丙火日主坐午火劫财为忌神，比肩代表其他男性，其他男性冲入妻宫，代表感情上很容易出现第三者，有其他男性来破坏你正常的婚姻家庭，影响婚姻的稳定。年干辛金正财星和巳火暗合，又和丙火日主相合，比肩夺财也有感情争夺之象。
          正财在年，年为大，未来妻子年龄比自己大一些。日支午火为桃花星，妻子容貌秀美，身材还可以，人比较漂亮，精明敏锐，乐观开朗，164左右。但比较任性自我，脾气不好，能力一般，家庭条件不好，对自己帮助不大，婚后容易发生争吵和矛盾。
          大运分析：13岁-22岁走的是戊子大运，此大运地支子水被天干戊土盖头，地支子午相冲，为阳刃逢冲，要注意身体健康以及意外之事。地支子丑相合，构成伤官克官，要注意口舌，官非之事。
          23岁-32岁走的是丁亥大运，此大运天干丁火被地支亥水戳脚，地支巳亥相冲冲了年支巳火禄神，要注意破财之事，也要注意身体健康问题。寅亥相合，旺了印星不吉。天干丁火透出，构成劫财夺财，此大运并非好运，财运较为一般，要注意和亲戚朋友同事同学的金钱往来。
          33岁-42岁走的是丙戌大运，此大运天干丙火比肩伏吟，两个丙火去争合年干辛金，一方面要注意其他男性影响婚姻的稳定，另一方面要注意事业上有小人。地支寅午戌合火局，也旺了比劫星不吉，事业上竞争会比较大。
          43岁-52岁走的是乙酉大运，此大运天干乙木被地支酉金戳脚，没什么力量，天干乙庚相合，日主直接可以合辛金，有得有失，地支地支巳酉丑合金局，财星旺，此大运整体的事业财运有好的发展提升收获。
          癸未大运，甲申大运，天干甲己相合，己土用神被合拌，地支寅巳申三刑，要注意身体健康问题以及官非，口舌，破财之事。癸未大运，地支巳午未三会火局旺了比劫，也要注意钱财之事，运势一般，在土金旺的年份还是有好的发展收获的。
          你的八字原局为花销大，不聚财，有禄神受损，比劫夺财之象，物质财富欲望大，但一路走的大运来看，天干不是太好，地支还算可以，大运走的一般，会因为欲望所累，整体而言一生吃穿不愁，但很难有大的富贵，平时也要提高理财观念为好。
          婚姻要注意正确的恋爱观和婚姻观，人与人相处或恋爱都是相互的，你对待另一半感情专一，能够互相信任，给予对方安全感和照顾，另一半也会这样对待你，对待感情三心二意，则婚后只会带来一些不好的事，造成婚姻失败。
          `
  }]
}

export default {
  丑时
}