const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   比肩   日元   伤官',
  天干: '丙(火) 戊(土) 戊(土) 辛(金)',
  地支: '寅(木) 戌(土) 戌(土) 酉(金)',
  遁藏: '七杀   比肩   比肩   伤官',
  大运: '己亥6，庚子16，辛丑26，壬寅36，癸卯46，甲辰56，乙巳66，丙午76',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/344.html',
    命主甲: ``,
    珠玑: `婚姻分析：
          戊戌日生在九月当旺，月坐比肩，地支两戌火库烧土，年丙寅偏印，日主高强，乃为燥土，万物不长，土必须要有滋润，才能生万物，土才能发挥作用，否则就是一座烫山芋，或者一座火山，无人想靠近。
          所以就是此八字的女人缘非常淡薄。命中带华盖星，不善于言辞，喜欢琢磨，月坐比肩，有进取心，拼搏，节俭，自我严格要求自己，但八字没有财星，也没有食神，此人比较不懂得创造浪漫的气氛，不懂得花言巧语，土干燥，不懂得幽默，风趣，实在，老实巴交的人，所以讨不了女人的芳心。
          唯有流年或者大运遇到水，才能有结婚运，但此八字哪怕结婚了，婚后也是麻烦不断。
          大运：辛丑大运，丑戌三刑，与婚姻宫三刑，就像马被锁住了，跟女朋友交往，一直很难有进展。
          2020年虽然是庚子年，子里面有水，会出现个女人，但由于子丑六合土，财星变成比劫，所以女朋友会变成别人的。今年有失恋的迹象。
          2021年是辛丑年，没有水，容易出现情绪化重。
          2022年是壬寅年，行偏财运，女朋友出现
          2023年是癸卯年，行正财运，有望结婚。
          2024年是甲辰年，婚姻宫相冲，很容易出现离婚。
          `
  }]
}

export default {
  酉时
}