const 辰时 = {
  公历: [{
    甲: '1982-01-07 08:30:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   劫财   日元   比肩',
  天干: '辛(金) 辛(金) 庚(金) 庚(金)',
  地支: '酉(金) 丑(土) 寅(木) 辰(土)',
  遁藏: '劫财   正印   偏财   枭神',
  大运: '庚子，己亥，戊戌，丁酉，丙申，乙未，甲午，癸巳，壬辰，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3314.html',
    命主甲: `出生地皖蚌埠，男，独子，父母很早离异，父亲再婚，与父亲继母长大，生母一直未有联系，继母对我很好视同己出。后来大学毕业后参加工作，做教育行业，期间一直努力学习并拿下硕士学位，但是人生婚姻不太顺利，与前妻6年前离异，没有孩子。父亲大病一场生活不能自理后与我一起生活。
          工作一直算平稳。今年与一姑娘再婚，爱人怀孕中，准备买房养家，突感压力很大。
          `,
    珠玑: `八字分析：庚金日主生在丑月，为正印格，年柱辛酉为劫财，月干辛金也是劫财，天干比劫较旺，寅木受克严重。
          事业分析：八字庚金日主在天干得势，年支又见酉金羊刃，丑土当令，土旺金相，比劫较旺，八字不见官杀来制比劫，也不见食伤来泄身，时柱庚辰为金魁罡，性格体现为野心较大，固执执拗，倔强好胜，个性要强，容易急躁冲动，有时候比较鲁莽，缺乏深思熟虑，也容易走极端，这些都是要克服的。
          八字丑土正印当令较旺，时支又见辰土枭神，也体现为主观意识较强，容易钻牛角尖，自尊心强，很要面子，也容易有嫉妒心，做事情缺乏一些踏实，容易浮而不实，印星较重，也体现为性格略为保守传统，做事缺乏灵活，容易死板，适合保守稳定的工作。
          但好在日坐寅木为用神，木来疏土为吉，寅木临天乙贵人、天德贵人和月德贵人，八字土厚，也体现为仁慈仁义，为人厚道的一面。加上月令丑土临华盖，也有一定悟性，时支辰土为枭神，日支寅木临太极贵人，对神秘文化感兴趣，后天加强修心养性，也可克服性格脾气上的短板。
          八字日坐寅木偏财，比劫较旺，在求财上会有投机走捷径的心理，会有经商创业的想法，但八字不见食伤，暗藏于丑土和辰土之中，缺乏一些经商头脑，同时理财能力较为缺乏，不太适合去投资创业。比劫较旺，也不适合合作求财，久了会因为脾气的问题，反目成仇，导致经济方面的纠纷发生。
          在求财上，容易竞争很大，要注意因为脾气有时候过于强势直接，无形中得罪人，犯小人，给自己带来阻碍，这是要注意的。
          庚寅日出生，日坐寅木偏财，地支虽见酉金，但酉辰贪合，酉金不去制寅木，故也没有构成劫财夺财，财运尚可，可衣食无忧，但八字不见食伤来生财，故这个财不大，难见大财，小财不断，寅木偏财临元辰，钱财上花销还是比较大的。
          日支寅木为八字唯一用神，临天乙贵人，为真贵人，表示贵人运较为不错，可以得到他人相助，但八字比劫旺为忌，对在事业上打交道的人要加强甄别，预防被人坑骗。
          八字比劫较旺，又不见食伤来泄身，不见官杀来克身，日坐寅木偏财，多喜欢偏自由一些的行业，不喜欢被约束，比劫旺也适合偏体力方面的工作，可以依靠辛苦付出来求财。
          你现在从事教育行业，八字有财星来制印，也可以坚持做下去，但要多吃苦多付出多跑动，才有更多机会和更好的财运。八字丑土正印和辰土偏印同见，可以考虑在主业之外发展副业，自己辛苦一些，有更多求财的机会。
          结合大运来看，早年走的是庚子，己亥大运，为北方水运，尤其是己亥大运，地支寅亥相合，食神生财，旺了寅木财星，财来制印，故运势不差，可以获得学历文凭。但后面转戊戌，丁酉，丙申，乙未大运，运势均较为低迷，事业和求财能稳定保守是上选。
          今年壬寅年，太岁和大运天克地冲，申金驿马逢冲，有工作变动之象，走动奔波较多，但能往保守稳定方面走是最好的选择，今年也要注意钱财破耗花销，注意和身边人的金钱往来。
          婚姻分析：八字庚金日主在天干得势，比劫较旺，年支又见酉金羊刃，不见食伤来生财，在婚姻感情方面比较直来直去，不太懂得关心体贴另一半，有时候性格脾气不太好，易急躁冲动，容易发生矛盾冲突，且犯错不喜低头。
          一般来说，庚金日主的人，如果又八字金旺，虽然生活中比较直接，但感情中遇到矛盾分歧，就喜欢冷战，久而久之让对象心寒，不利婚姻感情关系，是要注意的。
          《穷通宝鉴》中讲：四柱之中，庚辛过多，若无丁火之制神时，为一孤寒之命。这个论断比较符合你八字特征，庚辛金比劫较旺，又不见丁火制之，故婚姻不顺。加上丑土当令为华盖，时支见辰土枭神，在感情上会比较孤独，也代表能晚婚是最好的，有利婚姻的稳定。
          不过，好在日支婚姻宫为寅木偏财，寅木偏财为用，临天乙贵人、天德贵人和月德贵人，代表妻子善良仁慈，较为贤惠，为吉的一面。八字不见食伤来生财，寅木偏财少了元神，所以妻子易身体不好，尤其八字不见官杀，寅木暗藏丙火七杀，代表子女缘分较弱，也易身体不好，这是要注意的。
          可以说你的妻子感情上为人还是不错的，平常感情相处上，要多懂得多关心体贴对方，多换位思考，遇到问题多主动沟通，退让，不要意气用事，后天多努力改善自己感情上的性格缺陷。
          你从今年起走的是丙申大运，地支寅申相冲，日支婚姻宫寅木受损，比肩夺财，故此大运要注意妻子和子女身体健康，婚姻宫逢冲，也要防夫妻不和，争吵矛盾，婚姻波动，也要防其他男性介入婚姻，影响婚姻家庭的稳定。
          为化解不利，平时多积德行善，布施为子女祈福，平时适当放生祈福放等，对子女运有帮助，你平时可以佩戴一个黑曜石材质的生肖猪饰品，在住处北面放一个生肖猪摆件，对事业财运、家庭和谐、妻子健康、子女运势有一定帮助。
          大运分析：41岁-50岁走的是丙申大运，此大运地支申金被天干丙火盖头，和八字日柱天克地冲，运势总体低谷，天干丙火七杀透出，但丙辛相合，两个辛金争合丙火七杀，表示事业上竞争非常大，自己凸显自己的优势，事业上易有变动，奔波较多，求财辛苦，
          寅申相冲，比肩夺财，钱财花销很大，不易聚财，财运不好，贵人运低迷，也要注意和身边人的金钱往来，切莫投资创业赌博，去搞一些高风险投机的事情。同时要注意妻子健康，家庭矛盾，异性介入之事。
          51岁-60岁走的是乙未大运，此大运地支未土被天干乙木盖头，为财星制印的大运，天干乙庚相合，两个庚金比肩争合乙木财星，构成比肩夺财，故财运不济，花销较大，很容易与同辈之间有金钱纠纷，这是要注意的。地支丑未相冲，把土冲旺，要注意脾胃方面健康，提纲逢冲，也要注意家庭和谐。
          `
  }]
}

export default {
  辰时
}