const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   偏财   日元   偏财',
  天干: '丙(火) 辛(金) 丁(火) 辛(金)',
  地支: '寅(木) 卯(木) 丑(土) 丑(土)',
  遁藏: '正印   枭神   食神   食神',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/331.html',
    命主甲: `小时候我是一个比较幸运的女孩子，父母非常疼爱我。成绩也很好，虽然只上了一个大专，但是毕业之后找工作非常的顺利，非常幸运地进入到了一家国有企业，还是很稳定的。
          婚姻方面，我和老公的感情还是可以的，虽然偶尔会有小争吵，但是总的来说还是挺好的。在心理上也应了老师的话，我现在时常觉得非常的孤独，而我的丈夫工作方面总是不踏实，总是想去远方工作，
          可是我却不想分居，害怕他不能忍受孤独，也受不了外界的诱惑，做出背叛我的事情，到时候自己会孤独终老，所以在心态的调节上，我觉得有些困难，因为身边的朋友和亲人很多都离了婚，看到他们的状况，我也很害怕自己会有那么一天。
          我于2015年的时候的确患过乳腺方面的疾病，虽然经过治疗，现在恢复的还可以，但是由于药物的作用有一些后遗症，现在真的是小病不断。
          `,
    珠玑: `八字分析：日干丁火，生于卯月而得令，春季阳气旺盛，原局中木火偏旺，故喜金来制木为吉，土能生金，则两者皆为用神，忌神则为水木火，整个八字财星很旺，所以你的财运还是可以的。八字中木旺有金，也有土可生金，所以整个命格还是很不错的。
          婚姻方面，由于命局中只有七杀，则比较的纯净，所以感情方面还是比较稳定的，自己也是一个很专一的人，对待家庭有很大的责任心，思想并不复杂，也不会轻易受到外界的干扰。
          日支虽然坐丑土，看似克了癸水，但是有辛金通关，故也不会损害丈夫。由于日支坐寡宿，时支也为寡宿，所以在中晚年的时候，自己内心会觉得比较的孤独，夫妻会聚少离多，经常性的分开，也说明在中年的时候你们夫妻如果能够分开，对婚姻感情都是很有利的，如果每天在一起，则会产生很多的矛盾，对你们的婚姻不利。
          总体来说，你的八字组合并没有很明显的婚姻不利的信息，虽然夫星不显，但是七杀有财来生扶，日支也没有受损，所以婚姻没有什么大的问题。不过由于时支为华盖星，所以你在感情上必然会很孤独的，也说明夫妻心理上会有距离，缺乏沟通，互相不理解彼此，自己要稍微注意这方面的问题，那么婚姻是完全可以稳定的。
          事业方面，八字财星混杂，所以求财方面会用心不专，往往这样到最后会一事无成。如果你可以担财，那么混杂说明你能够多方面的得到钱财，如果不能担财，则会因为钱而累身，这种命格，如果你不上班，那么也会想去创业。不过这要看大运是怎样的，由于你身旺财旺，所以是可以有不错收入的，自己也有做投资的机遇和财运，一生即便不会大富大贵，也不会因为钱财担心发愁。
          由于命中丁坐财库。又有财星包局，所以非常适合做和金有关的行业，比如说会计，财务等等。你的八字偏星比较多，说明你有野心，思维也比较的活跃，所以在企业的话，会有升职的机会，能够做到管理层，要尽量做一些有挑战性的工作，而不是一成不变的那种工作。因为偏星很旺，你在求财方面的欲望是很大的，任何一个赚钱的机会都不会放过。
          大运分析：你在19-29岁走的为己丑大运，这十年是面临选择工作以及找对象的关键时期，大运有食神生财，各方面都很顺利，完美的避开了不利自己的因素，可以有好的工作以及丈夫，所以对于女人来说真的是很幸运的一件事，就算后面的运势变弱了，由于选择的正确，只要一直去珍惜，那么是不会有什么问题的。
          你在29-39岁走的为戊子大运，从2015年就进入此大运，由于戊克七杀，运势不如之前的好，故而你在29岁后，不要再去折腾了，一切以稳定为上策。
          1、由于为伤官大运，容易冲动，做出后悔的决定，所以要学会控制自己的脾气。
          2、由于七杀和日支相合，并且有两个丑来争合子水，所以丈夫会有桃花，自已要多注意，找到办法规避。
          事业上面，由于目前大运很是一般，所以最好上班，偏财运也是有的，所以要选择一个好项目，懂得知足为好。
          你之后的大运也是很普通的，所以要珍惜如今所拥有的，这样就可以顺利很多。
          由于你八字缺水，所以你一定要注意妇科和脾胃方面的问题，同时要注意自己的心态，多加锻炼，是不会有什么大的问题的。
          你的八字是很不错的，只是大运有一些不理想，所以拥有一份稳定的工作是最好的了，在上班之余也可以做点投资，总之稳定为上策，至于婚姻方面，只要能够减少一些欲望和妄想，那么自然就会生活的轻松自在，夫妻关系要去多关心对方，体贴对方，只要你做好了，丈夫也会改变自己的态度。
          从你八字来看，你是不会离婚的，所以不要整天的胡思乱想，这样不会帮助自己，反而会让自己内心更加的烦恼，少看少听，对你是有好处的。
          `
  }]
}

export default {
  午时
}