const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1982年十二月二十七日辰时'
  }],
  天干: '癸(水) 甲(木) 戊(土) 丙(火)',
  地支: '亥(水) 寅(木) 辰(土) 辰(土)',
  大运: '癸丑，壬子，辛亥，庚戌，己酉，戊申，丁未，丙午，乙巳，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3203.html',
    命主甲: `江西赣州人
          上面有三个姐姐，因为上一代人的重男轻女，我父母也不例外，第三个姐姐从小就送人了，后来也就断绝了关系。
          虽然小时候家里很穷，但我从小到大一直到大学毕业之前我都是人生一帆风顺的，没有吃过任何苦。高考复读过一年，第二次高考考上了我们省内唯一一所211南昌大学，读的生物技术专业。颠沛流离的命运也是从大学毕业后开始的。
          大学毕业后才发现这个专业压根就不好找工作，找不到工作也肯定有自知之明没脸皮问父母要钱吧，那几年为了挣钱养活自己我还进过厂里的流水线，一干就是两年，身体也是那时候搞垮的。因为读了大学却找不到一份体面的工作，我到现在去找工作也不敢说自己是大学毕业，只说自己是高中毕业，真的丢人。
          后来从娃哈哈出来后我又开始四处游荡，我跟我爸说想去学修车，我爸就说我尽想着别人的车子坏……反正我跟他说什么我要做什么他都要挖苦我……后来我终于觉悟了，靠我爸给我指路是不行的，我用自己过去挣得那一点钱报了培训班，学了数控机床加工，后来就在私人小老板那里当学徒，领一点点微薄的工资。
          直到2013年10月，经一个曾经跟我一起学数控的朋友介绍进了江苏无锡一家比较正规大型的企业，现在这家企业也是上市公司。从那时候一直到2017年底，我就在那家公司过着朝九晚五的生活，那几年也是我目前为止人生最舒服的日子。
          2015年跟我老婆相亲结婚，我老婆学历没我高，但人还算知书达理。也有可能跟她从小的经历有关吧，听说我岳父会酗酒，酗酒以后会打我岳母，也会打我老婆和她弟弟，所以我老婆是那种极度缺乏安全感的人。结婚后因为她身体原因一直没怀孕，后来2017年怀孕了，她就开始各种担心，担心没人陪她坐月子，没人帮她带孩子，总说她是没有家的人，经常哭哭啼啼伤春悲秋。她除了我不相信任何一个人，包括她的父母。
          我有时候也觉得她确实挺可怜的，我也很无奈，所以2018年初我就辞了无锡的工作，回老家陪老婆待产，一直伺候到她坐完月子。
          后来老婆坐完月子我就去南昌找了份工作，也是大型企业，也是朝九晚五，但奇妙的厄运也随之而来，好好的大型企业班上的好好的工资发不下来，后来居然倒闭了。然后2019年又回到无锡，再次回到无锡也找不到好工作，只能给私人小厂打工，私人小厂要上夜班，12小时，虽然工资高，但我真的心力交瘁，后来顶头上司又给我穿小鞋，说我的工资比他还高，工作中各种刁难我，然后老婆看我要死的感觉就劝我辞职回老家算了。
          她也看得开，她说她去给我suan命要2022年才能重见光明，所以2020年和2021年这两年我都一直在老家带娃啃老，顺便修养身体，老婆上班养活自己。（因为老婆是学医的，自从结婚后她就不让我随便吃药，督促我要加强锻炼，怕我英年早逝）
          `,
    珠玑: `八字分析：戊土生于寅月，甲寅干支一气，为七杀格。戊辰日丙辰时，日主有根不算弱，但辰为水库，又是癸亥年，亥是甲的长生之地，寅亥合财生七杀，七杀非常旺。八字没有食伤制杀，只有丙火偏印化杀，但寅亥合丙火的根气受伤。
          事业分析：命局有七杀旺而缺乏制化，有七杀攻身之象，体现为压力较大，烦恼较多，性格会有些胆子小，比较自卑，缺乏自信，遇到事情扛不住压力，意志力薄弱，也容易被欺骗利用，且命局不见食伤，也为偏固执的一个人。从你的组合也可以看出，从小家里对你寄予了厚望，对你有很大的期待，背负了家庭的包袱。
          命局七杀强旺有力为忌神，七杀为忌可以代表是阻碍，小人，是非灾祸等，没有食伤来制杀，虽然有印星，但力量太弱，难以化杀，属于“病”重“药”轻，“病”重难治，容易遭遇不良人，被人算计坑害，做事也会遇到阻碍坎坷比较多，加上自己也不扛压力，遇到困难容易退缩放弃。
          八字财杀相生，七杀攻身，事业上压力较大，容易因为钱财和工作遭遇是非，甚至会损害健康，身弱七杀攻身，也表示体质不太好，精神不佳，睡眠不好，要注意意外受伤、手术等，凡事要谨慎小心，出门多注意安全，能长期坚持锻炼身体是好的。
          你在22岁-31岁对你来说是事业黄金发展时期，但走的是辛亥大运，行运不济，此大运天干丙辛相合，丙火枭神被合拌，七杀来攻身，没有任何解救，且地支寅亥相合，旺了寅木七杀，此大运比较困厄，压力大，是非多，求财辛苦，机遇较少。
          八字为七杀格，七杀较为强旺，时干丙火枭神贴身为用，但印轻杀重，日坐太极贵人，这种组合在古代被称为江湖手艺人，在现代社会也很适合从事一些较为偏门冷门的行业。
          年柱癸亥干支一气为财星，命局不见食伤来生财，财运不稳，波动较大，时好时坏，天干戊癸相合，正财合身，寅亥相合，亥水偏财难入主位，正财易得，偏财难求，同时也代表能得到的财较为有限，日支和时支辰土为财库，财库重重，财库多而不富，且财库自刑，命里财富不大，知足常乐。
          你现在走的是庚戌大运，天干庚金来制甲木七杀，为食神制杀的组合，接下来也转西方金运，食伤来制七杀，很适合技术立身，才有更好的发展机会，正财合身，能进一些大的企业上班为好。
          2022壬寅年，2023癸卯年，你走的是财星旺了官杀的运气，总体运势较为低迷，官杀强旺为忌神，较难找到较为理想的工作，财运也较为一般，求财会很辛苦，这两年适合沉淀自己，多学多练，把立身之本进一步夯实。2025乙巳年，2026丙午年，天干地支印星来通关，你的机遇就来了。
          年柱代表祖上，干支一气为财星，为命局忌神，一般出生不好，父母对自己帮助不大，年干癸水正财也可代表妻子，也代表妻子能力不强，条件一般，原生家庭较为一般，对你帮助有限。财来生杀，杀来攻身，地支辰辰自刑，婚姻宫自刑，婚姻会给你造成很大压力和烦恼，更需要依靠自己，依靠妻子来生活并非长久之计，作为一家之主，要更多扛起养家重任。
          一般来说，年柱代表早年，月柱代表青年，日柱代表中年，时柱代表晚年，可以代表人生的四个时期，你的命局年月均为忌神，代表早年和青年时期多为不顺，阻碍较多，但日时均为用神，中晚年运势会好一些，也为先苦后甜之命，从大运来看，也是如此，只要人生有盼头，就要鼓起勇气和信心。
          大运分析：32岁-41岁走的是庚戌大运，此大运天干庚金食神高透，庚金食神来制甲木七杀星，为食神制杀的组合，可以依靠过硬的技术来立身求财，地支辰戌相冲，婚姻宫逢冲，婚姻中有一定压力，辰土财库自刑，又被戌土所冲，在钱财上花销较大，存不住钱，财运不好。
          42岁-51岁走的是己酉大运，此大运天干己土劫财透出，甲己相合，甲木七杀星被合拌为吉，身边小人变少，是非减少，压力减轻。地支酉金伤官可以起到制杀的作用，事业运变好，可以找到较为理想的工作，也适合依靠过硬的技术来立身。但酉辰相合，酉金桃花合动婚姻宫，要防婚外异性插足婚姻。
          52岁-61岁走的是戊申大运，此大运天干戊土比肩高透来帮身，地支寅申相冲，为食神制杀的组合，申金得戊土和辰土生扶不弱，事业上有进一步的发展，也比较顺心，压力减轻，做事比较得心应手，财运有一定改善，较为顺遂。
          人做事啊，最怕的就是还没有做，或刚开始做，就否定自己，认为不可能，做不到，一旦心里有这种想法的时候，就会做事信心不够，畏手畏脚，在做事过程中，只要遇到一点点挫折，就好像验证了当时心里的想法一样，会马上否定自己，然后放弃，最后碌碌无为，一事无成。
          你的命局身弱，七杀攻身，没有好的制化，在做很多事情的时候都会有这样的心理，害怕做不好，害怕付出没有回报，害怕别人的眼光等等，导致你做事前怕狼后怕虎，也是导致你现状的很大的一个心理原因。
          人生不如意之事十有八九，遇到不顺之事很正常，咬咬牙，努力把，也就挺过去了，等你回头再看，原本以为高山一样的困难，不过是小山包而已，人生就是攀登一座座的高峰。
          `
  }]
}

export default {
  辰时
}