const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   枭神   日元   食神',
  天干: '丙(火) 乙(木) 丁(火) 己(土)',
  地支: '寅(木) 未(土) 巳(火) 酉(金)',
  遁藏: '正印   食神   劫财   偏财',
  大运: '丙申8岁，丁酉18，戊戌28，己亥38，庚子48，辛丑58，壬寅68，癸卯78',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/346.html',
    命主甲: `2020这几年赚的不错，但不聚财，去年因夫妻感情不合，已离婚。
          `,
    珠玑: `丁巳日生在未月，夏火当炎，日主高强，不甘于人后的人，属于比较有进取心，事业心很强，不可认输的个性，年劫财助旺，花销也大，财来财去。
          月坐偏印，此人很善于抓住市场变化和需求，但同时也伴随着小人很多。偏印的人脑筋懂得急转弯，反应敏捷。
          时坐食神，食神生财，富贵自天来。所以此人爱做偏门生意，偏财运比较好。但丁火坐劫财，且妻宫逢合，此人比较容易出现婚外情。
          2019年己亥年行食神运，是会赚钱，但食神会生出个小老婆出来的，巳亥相冲，冲动婚姻宫离婚之运程。
          此八字日主高强胜过于财，所以此人比较有能力当得起富翁。
          2020年庚子年，行正财运，比较有利于事业。
          2021年辛丑年，行偏财运，地支巳酉丑三合金局，财运更旺。
          大运己运行食神，食神与偏印发生相克，亥为半三合，特别是癸卯和乙巳年，如果野心太大，不懂得知进退，将会出现大的意外之灾。
          `
  }]
}

export default {
  酉时
}