const 申时 = {
  公历: [{
    甲: '1999-09-09 15:15:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   正印   日元   枭神',
  天干: '己(土) 癸(水) 甲(木) 壬(水)',
  地支: '卯(木) 酉(金) 子(水) 申(金)',
  遁藏: '劫财   正官   正印   七杀',
  大运: '甲戌，乙亥，丙子，丁丑，戊寅，己卯，庚辰，辛巳，11岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/352.html',
    命主甲: `2020在特殊时期之前，我父亲跟他一直以来的叔伯兄弟闹翻了，在1月底的时候辞职回家，到现在一直是待业状态。而我是应届毕业生，专业是动漫制作，选专业的时候顺序排错了，导致我选上了这个我其实不很喜欢的专业。
          加之这种专业要找工作需要一定的能力，于是我前进的目标又迷茫了。小学的时候我是非常骄傲的一个人，学习成绩好，正经的奖状也没少拿。但到了中学之后一切都变了，我的理科成绩直线下滑，班主任也经常当着全班的面点名批评，从此造成了我的自卑。
          然后我的学习就一直不好了，家里人也看得开，觉得家里亲戚和自己都没有高学历的人，我也没有那个命去考好学校。直到现在临近毕业，我找不到我要工作的方向，妈妈想让我去她的夕阳单位按月领工资，但我想法不大，我虽然知道自己没什么能力，但还是有一点野心，我想要有晋升空间的工作。
          父亲的失业，还有我的就业问题，家里现在还有房贷负担，这些是现在家里人最头疼的所在。我的姥姥甚至开始帮我张罗相亲，这是令我有点反感的。从小到大我都没有恋爱过，中学时期或许还有对恋爱的憧憬，但20岁的我对谈恋爱已经没有任何兴趣了。
          `,
    珠玑: `八字分析：甲木日主生在酉月，为正官格，时支申金七杀无制为官杀混杂。壬申一体，壬水印星可以化杀，印星强旺又有官杀生印，印多成枭，遇到大运流年食神进来会有夺食的麻烦，好在年干己土可以制约一下偏印，让偏印发挥出正印的作用，是官印相生的正常格局。
          但是，己土很弱虚浮无力，癸水又在旺处制约的力量很有限。而且，甲木阳刃卯木和酉官相冲，卯酉相互不服，影响了格局层次，对事业、身体、感情都有不利的影响。
          事业分析：甲木日主的人一般比较上进努力，而官印相生，也比较正直踏实传统，但八字印星旺，且透出在日主左右，也代表容易多愁善感，想得多，顾虑多，有些自我烦恼，但行动力不够，容易理想很美好，却没有什么实际的行动，
          陷入迷茫空想当中，导致自己比较烦闷，纠结，个人的能力不是太突出，交际表达也不是太强，对你事业发展有不利的影响。
          己土财星在年干，而坐下是卯木劫财，己土在地支无根，同时也没有食伤来生助财星，说明命里的财星是不旺的。同时八字干支金水相生，透出癸水和壬水印星，本身己土财星就不旺，还被印星消耗，八字原局的财富有些贫乏。
          不过你的八字财星虽然不旺，但八字月柱官印相生，时柱杀印相生，是稳定工作收入之象，适合一些相对稳定的工作，结合你的大运走势看，一路走的是比劫，食伤，到正偏财的大运，大运走势属于有利大于有弊的组合，能够有发展进步，但难获得大幅起色，整体属于普通偏好到小康左右。
          婚姻分析：子水为婚姻宫，婚姻宫子申半合水局，申金为七杀流入日支，月令正官也被日支泄气，代表八字正官和七杀的力量都流向婚姻宫，八字官杀混杂，容易遇到些烂桃花，同时婚姻宫为忌神，对象出身条件较一般，且对你的帮助不大。
          同时八字印星旺，泄官杀，印星在月干，时干，日支包围住日主，说明你对待感情会顾虑比较多，有时候遇到感情也不知道怎么选择，顾虑会比较多，同时对感情会有些淡漠，被动。
          日主周围逢印，同时印入婚姻宫，也说明你的感情容易被父母长辈干涉，正官在月令且与劫财相冲，也说明你的对象容易被其他异性影响或干扰。
          你目前走的是乙亥大运，劫财得生助，大运而言没有太好的感情机会，到2021年辛丑年，天干辛克乙，劫财被克制，同时太岁地支，子丑合入婚姻宫，而丑又是官杀库，丑中藏辛金正官，这一年对你的感情有利，婚姻有落实的机会。
          大运分析：21岁-30岁走的是乙亥大运，此大运印生劫财属于忌神大运，劫财克财，地支亥卯半合比劫局，一方面说明你的工作竞争大，你竞争不过过别人，同时收入不是很理想，花的却比较多，没有什么积蓄。感情同样也是竞争大，本身来说桃花运少，还要注意烂桃花，以及第三者干扰，比如2023年-2025年。
          31岁-40岁走的是丙子大运，此大运天干食神生财，对你事业有一定帮助，收入会有些增加，但大运地支子申半合，增加了印星的力量，求财会比较辛苦，且地支子卯刑，要注意下人际关系。感情要注意枭神克食，地支婚姻宫伏吟，感情烦恼和顾虑会比较多，导致感情交流不好，感情运不太和谐稳定。
          丁丑大运与八字丁壬合，伤官贪合不生财，而地支子丑合，财星合入日支。而大运丁丑力量在丑土上，事业求财上能有收获但起色不大。
          戊寅大运与时柱天克地冲，驿马逢冲，财克印，属于有利有弊的运气组合，外出奔波走动，忙碌比较多，踏实做事发展比较好。
          婚姻方面丁丑大运也不太理想，相处不太和睦，同样要注意其他女人干扰，比如2041年，2045年。后面及晚年走财，官杀的运气，也属于较为普通的运气组合。
          你的八字印旺身旺，八字财星被戳脚，没有食伤来生财，财星比较弱，命里财富是不大的。八字有官印，杀印的组合，找份稳定的工作会更安稳些。结合八字大运走势来看，虽然对八字也有些帮助，但组合方面不算太好，格局层次难提升，难有大的发展进步和收获。
          `
  }]
}

export default {
  申时
}