const 巳时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1993年六月十三日巳时'
  }],
  十神: '比肩   七杀   日元   偏财',
  天干: '癸(水) 己(土) 癸(水) 丁(火)',
  地支: '酉(金) 未(土) 丑(土) 巳(火)',
  遁藏: '枭神   七杀   七杀   正财',
  大运: '庚申，辛酉，壬戌，癸亥，甲子，乙丑，丙寅，丁卯，戊辰，4岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/503.html',
    命主甲: `在广东出生，2016年毕业后工作一开始是挺顺利的，也比同年朋友好，但是工作会特别不稳定，经常跳槽，兜兜转转的，现在还一事无成。
          年纪也蹭蹭蹭的增长，但是婚姻之事还没落实。感情也是一波三折的。其实父母对我期望还是挺高的，但是随着年纪越大，就会比较焦虑。
          `,
    珠玑: `八字分析：癸水生于未月，月透己土，典型的七杀格。丑未相冲，时上丁已偏财生杀，七杀愈旺。酉金偏印可化杀生身，但远在年上，助力有限。
          事业分析：癸水日主被七杀包身，构成七杀攻身，性格缺点比较多，体现为比较胆小怕事，平时压力比较大，烦恼比较多，做事比较急于求成，有时候会冲动，走极端。但八字以酉金偏印为用，人比较精明能干，如果能好好规划，坚持一个行业，一份事业做下去，那样成功的概率才会大。
          八字七杀较旺，虽有年支酉金偏印来化，但化杀的力量有限，酉金偏印能发挥作用，只是杀重而印轻，人比较焦虑。八字不见食神，无法制杀，杀旺无制，不利事业，事业运较差。癸水日主被财杀包身，财杀为忌神，贵人运较差。七杀也代表小人，事业上小人较多，会有很多不顺心之事。
          时柱丁巳干支一气为财星，未月土旺金相，财星不弱，为身弱财旺之命。原局七杀太重，则体现为事业上比较操心忙碌，求财非常辛苦，要付出很多才能把工作做好。
          原局地支财杀印相生，生入年干癸水比肩，没有生入日主癸水，工作上竞争较大，容易被别人窃取你的劳动果实，也代表这个财杀印自己不易得到，追求的话困难障碍会很多。
          八字不见食伤星，为七杀攻身的格局，比较沉不住气，有什么想法和情绪都容易表现出来，做事情比较偏激，人际关系处理能力不太好，不会拐弯抹角，容易得罪人，在口才方面较差，不适合从事咨询服务行业。
          七杀代表事业压力，有食伤去制七杀，事业上才能有一番作为，七杀有制也代表名气，要学习一项过硬的技术才可以在事业上得到发展，获得名气，七杀多也代表你适合从事偏门行业，身弱财旺代表要在一些大的平台发展借助他人帮助和自己努力为吉，同时七杀旺自己也要提高人际沟通能力才行。
          婚姻分析：癸水日主坐丑土华盖星，八字原局临宿寡，代表内心比较孤独，人性格比较内向，喜欢独处，不喜欢与人打交道，感情多败难成。
          癸丑日出生，癸水日主坐丑土七杀星之上，七杀为忌神，未来丈夫性格好强，不轻易服输，脾气比较暴躁，条件较为一般，对你帮助不大，夫妻之间磕磕绊绊不少，婚姻会给你带来很大的压力。
          原局七杀旺而无制，身弱不能担杀，一旦大运来助杀，很容易烂桃花，遇人不淑，在感情上被欺骗和伤害，这是要非常注意的，尤其现在走的壬戌大运就有此象，好在原局有酉金通关，稍微好点。
          月日均为七杀，时支巳火中暗藏戊土正官，也为官杀混杂的格局，代表婚前容易遇到一些不好的缘分。地支丑未相冲，婚姻宫逢冲，则也代表婚姻中会有一些矛盾和争吵，婚姻容易发生变动。
          七杀太旺，婚姻难免有一些不顺，要看淡点，不能要求过高。杀旺无制则夫不成器，未来丈夫能力一般，性格会有些固执，内向沉闷，缺乏浪漫，容易钻牛角尖，身材健壮，175左右。
          大运分析：24岁-33岁走的是壬戌大运，此大运壬水劫财透出，天干丁壬相合为劫财夺财，且地支酉戌穿害，印星受损，此大运不要与人合作求财，不要轻易借钱给别人，防破财之事。
          地支丑戌未三刑，印星受损，印星为寿元星，要注意身体健康问题，尤其是肺部和呼吸道方面疾病。三刑大运也是不利婚姻的，容易犯口舌，事业上容易犯官非，这也是要注意的。
          2026年为丙午年，日支午火为原局的红鸾星和桃花星，动了丑土夫宫，2028年为戊申年，天干戊癸相合，戊土正官星被合入，这两年婚姻缘分不错，有结婚的运气，好好把握。
          34岁-43岁走的是癸亥大运，此大运干支一气为水运，水来帮身则运势回稍微好点，但亥水为驿马星，走驿马大运比较奔波动荡，难以稳定，地支巳亥相冲，冲了财星，代表工作会有所变动，也有奔波求财，运势有回升，但是也花销大，不注意理财的话，容易不聚财，自己安心做事稳定发展才有收获，整体运势比之前的要好些。
          44岁-53岁走的是甲子大运，此大运天干甲己相合，甲木伤官去制了己土七杀为吉，七杀为忌神被制则事业运会稍微好点，此大运好好把握，争取事业上有一定作为。
          乙丑大运乙木食神去制杀为吉，运势还可以。丙寅大运寅巳行，财星受损则花销较大。丁卯大运卯酉相冲，印星逢冲，要注意健康问题和破财之事。
          你的八字有做好一件事或一个行业的潜质，但是八字七杀旺身弱，容易急于求成，遇到困难的时候不能迎难而上去克服，顶不住压力，这是你需要克服的，现在走的大运不好，更要去沉下身心把自己做强，一旦大运助身，那么这个机遇才可以把握住，机遇只给有准备的人，你现在就需要时刻准备着。
          `
  }]
}

export default {
  巳时
}