const 寅时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1991年九月初七寅时'
  }],
  十神: '偏财   伤官   日元   正官',
  天干: '辛(金) 戊(土) 丁(火) 壬(水)',
  地支: '未(土) 戌(土) 巳(火) 寅(木)',
  遁藏: '食神   伤官   劫财   正印',
  大运: '丁酉，丙申，乙未，甲午，癸巳，壬辰，辛卯，庚寅，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/383.html',
    命主甲: `我这几年过的非常不好，相恋三年的女友分手，母亲心脏手术，心脏手术出院后，精神不好，又在精神病医院住院一段时间，有所好转，父亲在一次体检中，查出肝不好，住院治疗一段时间，现在在家中休养。
          `,
    珠玑: `八字分析：丁火生在戌月，透出戊土，为典型的伤官格。壬水透出为官，与戊土形成伤官见官的组合，年上辛金偏财虚弱，且远水解不了近渴，所以这种组合的影响会一直存在。
          你的八字原局伤官食神非常旺，本来壬水一位，可以构成伤官去官的机会，但壬水自坐寅木有保护，天干又有辛金财星，只能按伤官旺官弱处理。此命劫财无制，需要官星制约，伤官强旺，也需要印星得力。
          六亲分析：寅木印星在你的八字原局当中不旺，年支未土是印星的墓库，地支未戌刑，地支寅巳刑，印库和印星都带刑，且印星弱，印星可以代表母亲，也代表命局当中母亲信息不太好，母亲健康不利。
          辛金为偏财，偏财在八字中没有强根，戌月金退气，地支未土，戌土为燥土，地支带刑，戌土中辛金藏干容易受伤，天干火土相生土重，辛金受生力量比较小，也代表命中父亲有不利信息。
          事业分析：日主坐劫财，月干透出戊土伤官生辛金财星，同时正官与伤官相见，会比较有自己的想法主见，但有些自我，对于别人的管束约束会反感，不耐烦。伤官生财，日主合官，代表自己有事业心，
          但地支未戌刑，伤官带刑，日支寅巳刑，说明自己内心想法和实际行动，会有些矛盾，事情没有按照自己的想法预期发展，事与愿违，同时也会有些急躁，烦躁，情绪不稳定。
          八字月令，年支伤官旺且透出，去生财星，也代表自己会有些急躁，在事业求财上，有时候不够理智，考虑不够周全，缺乏计划，准备不足，急于求成而导致事情的结果和自己计划相悖。
          身弱食伤旺，同时天干有伤官见官的组合，有时候说话不得体，让人反感，不利人际关系，伤官忌神力量明显强与用神，且食伤盗泄日主，代表在事业求财过程中会付出比较多的精力，才能获得进步和收获，但个人能力有限，收获方面不太大，八字原局层次较一般。
          好在大运一路走的是比劫，正偏印大运，地支又是火地，虽然大的财富没有，但能有些小成绩，可以有小康到小康偏上些。
          八字喜印（五行为木），适合一些辅助性质的，助理相关的工作，也可以往广告互联网，文化传播，医药及餐饮相关行业发展。
          23岁-42岁走的是木和木火的组合运气，形成伤官配印，可以学习一些技术技能，有一技傍身，对你求财会比较有帮助。
          婚姻分析：婚姻宫为巳火劫财，八字正财不显，年干为偏财，婚姻宫暗藏正财星，婚姻宫为喜，妻子对你是有帮助的，家庭条件不会太差，只是婚姻宫被刑，两个人相处不是太和谐。
          同时婚姻宫被伤官泄力，对你的帮扶力量有限，年干透出辛金偏财，天干有伤官生财，代表自己求财求女人若渴，但感情不稳定，给人感觉会有些不够踏实，漂浮，影响到别人对你的印象，也影响到你的感情，不容易遇到自己各方面满意的对象。
          从你未来的感情结婚运看，八字正财不太旺，且日主有些偏弱，到八字日主得生助，且婚姻宫被引动时有结婚的运气如2023年太岁与大运天干地支木火相生，太岁与月柱干支相合，日主力量明显增强，且伤官与正官相克接触，丁壬合得更稳，感情婚姻更容易把握住，也有感情结婚方面的运气。
          对象五官脸型微方，面色微白有点红润，眉目清秀，品相不差，眼睛不大，双眼皮，但有神神，嘴唇不厚，声音有些清脆，语调有些响亮。
          大运分析：23岁-32岁走的是乙未大运，此大运印星力量大，生助日主，对你发展有帮助，但地支戌未刑，伤官被刑旺，自己付出的努力和经历也是比较多的，会比较辛苦忙碌付出多。八字偏印旺，地支食伤泄秀，日主有生有泄，且流年运势走的不太好，感情容易时好时坏。
          33岁-42岁走的是甲午大运，大运禄印相逢，日主得生助，地支逢强根，地支合火帮扶日主，木火土流通性更强，伤官配印是比较流通的，事业可以有更好的发展收获。同时五行流通，日主得印星和强根帮扶，感情也比上一个大运好。
          癸巳大运，天干七杀，地支劫财帮身，地支木火相生，天干管杀混杂，属于吉凶参半的运气，而命局水稍弱火稍微，整体利大于弊，感情容易有些分歧争执矛盾，有些反复。
          壬辰大运，与月柱天克地冲伤官见官，地支伤官旺，事业运不稳定，容易有口舌纠纷矛盾，加上大运食伤旺，情绪也不稳定，容易急躁烦躁，开支破耗比较多，适合保守发展比较好些，感情容易冷战，矛盾加深的信息。
          辛卯大运，财盖头印，地支卯戌合，各有利弊，运势方面较一般，故而你晚年运气方面不是太好，也不太差。
          你的日柱丁巳干支一气，同时月柱伤官旺而透出，地支有食神帮身，对八字泄耗力量是比较大的，八字火土流通，虽然盗泄日主力量强，但付出努力还是能够有收获的，属于辛苦求财忙碌的组合，
          八字原局一般，好在大运走势还可以，开始走比劫到正偏印及南方火的大运，对原八字的不足有弥补作用，虽然没有大的富贵，但通过努力能够有发展进步，可以获得些小成绩，整体格局比上不足，比下有余。
          `
  }]
}

export default {
  寅时
}