const 卯时 = {
  公历: [{
    甲: '1991-10-12 05:50:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   正财   日元   偏财',
  天干: '辛(金) 戊(土) 乙(木) 己(土)',
  地支: '未(土) 戌(土) 卯(木) 卯(木)',
  遁藏: '偏财   正财   比肩   比肩',
  大运: '丁酉，丙申，乙未，甲午，癸巳，壬辰，辛卯，庚寅，己丑，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3235.html',
    命主甲: `不知道出路在哪。在我两三岁时父亲高部位瘫痪，随后母亲改嫁，带走了姐姐，我跟父亲一起生活。后来我离开了家乡。
          读了大专，在美资企业工作了几年，从事铸造技术。后来换了工作，在工地从事安全管理工作了几年，现在又改行！
          近两年备考安全工程师，可迟迟考不上，内心很无助。感觉身边的人都比我过得好，事业家庭都有了，而我未立业，未成家。
          `,
    珠玑: `八字分析：乙木日主生在戌月，干透戊土，为正财格。天干偏财七杀，没有明透丁火制杀。地支两个禄，禄多合财，劳碌之命，但卯戌合食伤库又为财，可以有一定的财富积累。
          事业分心：命局为正财格，见戊土，戌土，未土，己土四层土，土厚为病，命局又不见食伤，会有些固执死板，缺乏些灵活灵动，有时候比较一根筋，不太会变通。命局土旺成势，也会比较计较，而做事缺乏些魄力，容易被一些利益蒙蔽，缺乏大局观。
          命局土旺为病，地支卯戌相合，比肩帮身制财，也相对比较稳重的一个人，命局不见食伤，地支见两个卯木比肩，多靠体力谋生，也不是喜欢标新立异和创新突破的人，总体上比较守本分，踏实肯干，但由于见两个比肩，有时候也容易有走捷径的想法，要远离一些高风险，投机的事情。
          地支卯戌相合，两个卯木来合戌土财星，卯木为乙木日主之禄神，禄神可代表自己，也可代表身体，禄神来合财，但命局身弱，事业上操心操劳较多，身体比较劳累辛苦，很难轻松闲适，也代表求财不易。
          地支卯木伏吟，卯木为禄神也可为财，所谓禄多而不富，地支禄神伏吟，也代表财富等级不高，难见大财。能到大一点的企业平台，从事比较保守稳定的工作和岗位较为适合，依靠勤劳来致富，能去出生地东方，北方和东南方发展较为适合。
          地支两个卯木比肩来帮身合财，依靠勤奋努力还是有一定财运的，也代表可以得到身边人相助，贵人运不差，适合跟着别人做，平时要主动去结交贵人和朋友或有能力的人，有望人生可以多条路，多一些机会。适合偏体力方面工作，协警，消防员等都比较适合，可以考虑。
          考试方面，2022壬寅年，2023癸卯年，走水木印比，天干印星高透，地支比劫帮身来制财，一方面考学运不差，有望取得证书，另一方面也有贵人相助，可以有不错的财运，要好好把握。
          婚姻分析：命局为正财格，戌土正财当令较旺，正财可代表妻子，代表未来妻子性格较为强势，日支婚姻宫为卯木，临将星，妻子在家庭中多居于主导地位，会给你带来一定压力。
          但卯木为禄神，在婚姻宫为用神，卯木来助身，妻子还是有一定能力和条件的，卯戌相合，妻子财运和家庭不差，对你事业有一定帮助，遇到一些大的事情可以多听听她的意见。妻子多为身边人，年龄比你大点，她职业和医生医药，或文化教育相关。
          不过，你命局正财星和偏财星同见，杂而不纯，婚后要注意和婚外异性保持一定距离，严防心有不专，三心二意，见异思迁等事。地支两个卯木比肩争合戌土正财，也要注意妻子身边异性情缘。
          2022壬寅年，天喜星入命，2023癸卯年，卯木引动卯戌相合，这两年都有遇到并结婚的运气，好好把握。
          大运分析：32岁-41岁走的是甲午大运，此大运天干甲木劫财高透，乙木见甲木有藤萝系甲之象，甲己相合，甲木劫财被合入门户，贵人运较好，可以得到他人相助，对你的事业财运帮助大，地支午火食神生财，能有一门过硬的技术来求财为好，虽然求财依然辛苦，但有所依靠，也能有不错的财运。
          42岁-51岁走的是癸巳大运，此大运地支巳火被天干癸巳盖头，天干癸水印星高透，但戊癸相合，戊土和癸水合拌，癸水难以助身，地支巳火伤官生财，求财的欲望较大，但大运难以助身，得不到什么大财，求稳比较好，财运较为一般，求财压力大，求财辛苦。
          52岁-61岁走的是壬辰大运，此大运天干壬水被地支辰土截脚，为财星制印的大运，地支辰戌相冲，把土冲旺，壬水不旺，助身力量不强，地支冲来解合，卯木难以合财，财运较为一般，且卯辰相害，卯木受损，禄神受损，钱财上易破耗，婚姻宫受损，夫妻之间不和。此大运也要注意身体健康，尤其是脾胃，肝胆方面，以及四肢受伤。
          《三国志》言：能用众力，则无敌于天下矣。能用众智，则无畏于圣人矣。
          一个人只有一个人的时间，一个人的精力是有限的，若能众人拾柴火焰高，也就其利断金了，对于你而言，尤其需要借势发展，借力打力，人人都争当第一，对你来说，也要学会甘当配角，当好“第二”。
          `
  }]
}

export default {
  卯时
}