const 辰时 = {
  公历: [{
    甲: '1998-04-08 08:16:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正官   偏财   日元   比肩',
  天干: '丁(火) 甲(木) 庚(金) 庚(金)',
  地支: '丑(土) 辰(土) 辰(土) 辰(土)',
  遁藏: '正印   枭神   枭神   枭神',
  大运: '乙巳，丙午，丁未，戊申，己酉，庚戌，辛亥，壬子，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/371.html',
    命主甲: `我的事业有点迷茫，目前在一家国企改制后的上市公司从事人力资源专员工作，
          工作以及工作中的人际关系让我对我的事业以及自己的能力产生了怀疑，不知道未来的事业就要一直这样了吗？也对企业未来的发展，自己会不会被企业辞退产生了担忧。
          出生地吉林省吉林市舒兰市。
          `,
    珠玑: `八字分析：这是一个魁罡八字，庚辰日庚辰时都是魁罡，八字带魁罡的人一般正气十足，性格刚烈，对于女命来说会显得温柔不足。
          庚金生在辰月辰日辰时，辰土伏吟偏印很旺，月上偏印靠偏财克制，时上偏印靠比肩化解，但天干两庚争财，用神之间发生争斗，全靠年上丁火官星保护偏财，所以丁火对你来说很重要。全局土旺克水，水在辰墓中不出来还好，在大运或流年出来就容易受到伤害。
          事业分析：庚金是阳金，有杀伐肃杀之性，为人会比较的刚强急进，也有些好胜，刚烈的特点，特别是你的庚金日主旺，这方面会更明显。
          庚金又是顽金，说的直白点就是顽固固执，做事直来直去不太喜欢拐弯抹角，但也容易缺乏灵活变通，在遇到事情处理的时候考虑不够周全，容易得罪人。
          庚金好比是刚挖出来的铁矿石，矿石需要经过加工锻造，才能成为有使用价值的器皿，凸显价值，年干透出丁火，虽然得月干甲木生助，但丁火无强根，力量不强，所以庚金难以被炼化而成大器，这里的庚金算是个半成品，加上八字土旺泄火，也是较难炼成功的。
          地支土旺为印星，印星重也代表你会容易想得多，敏感，多疑，有时候容易纠结，自我困扰，也缺乏些积极进取的心态，会有些懒，缺乏行动。
          年干月干为财生官的组合，对偏印和比肩有克制作用，所以年干月干为喜用神，甲木生助丁火正官在年，年上正官得生，代表可以在公务员或国企事业单位发展，因为用神官星在年，财在月代表的是国家单位，国企事业单位。
          不过丁火正官虽然得甲木财星来生，但丁火正官被丑土泄气，正官在八字中又没有强根，正官力量不强，也代表虽然有体面稳定的工作，但职位不会太高。
          你40岁前一路走七杀，正官大运，40岁后走印比劫大运，40以前算是好运，可以多努力发展，但40后运走下坡路，发展空间不大了。不过虽然40岁前走好运，但因为地支土太旺了，泄掉用神的力量，所以事业虽然有发展，但是突飞猛进的大进步是没有。
          婚姻分析：庚辰日柱，古人把庚辰日称为“绝夫罡”，因为庚金女以丙丁火为夫星，而戌为火墓库，丙丁见戌，即为夫星入墓，克夫之象重。
          女命魁罡一般对婚姻都不好，会比较刚强，要强，直来直去，遇到问题会硬刚，硬碰硬，不懂得以曲为直的道理，加上时柱又见魁罡，为双重魁罡，也会因此导致感情上不和谐，矛盾多。
          八字印重也代表会比较敏感，多疑，顾虑想法多，在谈感情时候容易放不开，被动，在把握感情上也会出现偏差而错过。
          年干为正官夫星，但夫星做丑土被泄气，虽然得月干财星生助，但财星也无强根，又被双庚金克制，财星力量很有限，所以夫星力量弱，桃花不旺，且遇到的异性也不容易满意。
          婚姻宫为辰土三现，辰辰自刑，感情会比较反复波动，比肩旺而透出，容易有感情竞争，较难遇到自己各方面称心如意的对象，遇到也容易把握不住。
          结合大运走势来看，现在走的是丙午大运，此大运七杀加正官，正官得强根，虽然和八字组合下造成官杀混杂，不过八字日主旺所以不惧官杀混杂，只是感情上容易不稳定，在感情选择上会有些犹豫，不太稳定。
          八字地支印旺，火也不会克金太过，所以此大运可以克制比肩，而地支官星有根，专旺，有望遇到相对心仪的对象，在2022年与大运天干食神制杀，地支半半合生合生助官星，官星力量强旺时容易遇到，且在当年就有结婚的运气。
          对象大概有174厘米左右，国字脸，五官端正，额头宽阔，肤色有些微黄，眼睛略大，比较有神，鼻子肉不是很多，眉毛浓密，眉间距不宽，下巴有少许肉，嘴唇微厚，人中不是太长。
          大运分析：2016年-2025年走丙午大运，此大运为七杀加正官大运，大运官杀混杂，而日主偏旺，且地支印重是不惧官杀混杂的。大运增强了年干丁火的力量，使得丁火可以炼制庚金，且比肩也被相应的克制，对你的整体事业求财有帮助。
          只是地支火旺生印，印旺代表事业会有些忙碌，辛苦付出多。同时印旺也代表顾虑多，想得多，瞻前顾后，而缺乏些努力奋进的精神，此大运整体来说是会有所发展收获的，也会有所提升，但幅度不是很大。
          2026年-2035年走丁未大运，此大运官印相生，正官星力量增强，同时地支印星力量也增加，且大运地支与年支丑未冲，印被冲动。所以此大运开始的时候，你的整体事业财运还算可以，但后面印星旺逢冲，容易不稳定，
          或自己对事业有些不满抵制，容易烦躁不安，要注意调整个人状态，踏实发展，多专注用心努力才会更好。总之此大运还会有些小的进步，但也会比较的辛苦忙碌，总体比上个大运稍有回落。
          40岁后分别走的是戊申，己酉，庚戌大运，后面的这几个大运多属于偏印、阳刃、比劫星的运气，属于忌神力量增加的组，代表事业会更忙碌劳碌，竞争也会加大，注意防范些小人干扰破坏，
          要注意避免树敌，平时注意下人际关系，要更尽心积极努力，不要犯错给人抓住把柄，不然很容易有被辞退而不利你的事业发展，踏实谨慎低调比较好。
          你的八字财官星在年月为喜用神，属于比较不错的位置，只是八字财星官星不旺，而地支印旺，比劫旺，影响了格局层次。其次大运走势上好运走得太早，前40年为好运，后40年为忌运，运势上有些起伏不稳定的信息。所以在中年时更要积极努力，用心做事，学习知识提高个人的竞争力才好。
          八字庚金日主身旺，带双魁罡，为人会比较刚强，直接直爽，为人直爽是好的，但要分时候分场合，当你做管理的时候直爽直接是好的，下达指令简单直接，也容易贯彻执行。
          但作为基层员工，如果你和同事，和领导沟通的时候，说话太直接，久了会让别人觉得不舒服，容易影响人际关系，不受欢迎，在工作中要多总结下自己的沟通方式，去改进下才更好。
          一个人的性格其实是没有绝对好坏的，只不过你在不同位置会有不同的结果，但自己要意识到，并去调整，要去适应环境，而不是让环境适应你。
          在做事的时候你容易带主观意识，以自己为中心角度去说话，缺乏大局观，在工作中要多培养自己的大局观，当遇到事情的时候，换位思考下，如果站在领导的角度，会怎样处理这个事情，你想想法心态又不一样，做事格局也会不同。
          有的人工作上遇到问题，对人不对事，最后导致自己精疲力尽不是工作本身，而是工作中的人，工作本身是累不死你的，累死你的是平衡自己的情绪。
          在工作中遇到问题要学会对事不对人，针对事情本身去处理，而不是因为人而带有偏见和情绪，那样不管遇到大的小的问题，都会因为人而带情绪，影响到你的人际关系和工作状态。
          `
  }]
}

export default {
  辰时
}