const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1997年九月初三11时10分'
  }],
  十神: '正印   比肩   日元   比肩',
  天干: '丁(火) 戊(土) 戊(土) 戊(土)',
  地支: '丑(土) 申(金) 申(金) 午(火)',
  遁藏: '劫财   食神   食神   正印',
  大运: '己酉，庚戌，辛亥，壬子，癸丑，甲寅，乙卯，丙辰，丁巳，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3344.html',
    命主甲: `现在的我而言，生活似乎止步不前，个人呈现无欲无求的状态，我自己本身对钱权名誉没有太大的欲望，也算是一个比较容易满足的人。
          唯一想拥有的是一比较高的学历，然而在考研第三次失败后则放下了执念，经过反思，是决策出现重大失误，每次选择专业我都选了我的最短板，自己比较愣 想挑战不可能。还有便是我个人比较懒惰，总比周围人更容易困倦，可能是身弱的原因吧。
          工作方面，在自己毕业那年，疫情之下自己学的专业也在疫情期间顷刻覆灭，毕业即失业，让我彻底转行。去年入职国内大型辅导机构，结果入职不到半年就遇到了双减，行业摇摇欲坠，比较幸运的是我所在的部门还勉强维持，感觉自己走到哪里哪里就要倒闭（笑）。
          虽然行业走向不好，但我发现了我在教育这方面还是比较有天赋的，我也喜欢并珍惜自己现在的工作，但在机构毕竟不是长久之计，还是比较想去高校当老师，但我的专业与所授学科不符，还是需要通过考研来提升学历。
          从小就比较多的烂桃花，男生接近我目的非常不单纯，以致我到目前为止几乎没怎么谈过恋爱，而且我对另一半要求比较高（无奈）
          `,
    珠玑: `八字分析：戊土日主生在申月，为食神格，天干两个比肩一个正印，地支两个食神一个劫财一个印星，食神生财为用。地支申金伏吟，本身不弱，且午火来制申金，虽见水可通关，但子水和亥水均有不利，不喜多见。
          事业分析：地支申金食神伏吟泄身为用，性格较为温和和蔼的一个人，申金食神临文昌贵人和天赦，人也比较仁慈善良，有一定奉献精神，懂得付出。但申金食神当令且伏吟地支，得戊土和丑土生扶，本身不弱，食神也代表享受享乐等，食神旺也容易有些懒，行动力缺乏，这是要克服的。
          地支申金食神伏吟，但被时支午火所制，午火正印在年干透出，印星为忌神，这种组合代表人比较懂得知足，这是好的，但不足之处也在于容易满足，对物质财富没有太大追求，也容易奋斗的动力不足，容易躺平，进取心不够。
          八字地支申金食神伏吟不弱，申金食神临文昌贵人，人比较注重精神享受，对哲学、文化、知识等比较渴求，也喜欢思考，但申金被午火所制，为印克食神，说明思维不太灵活，容易僵化，比较一根筋，学习能力较为一般，考学运不是很好，
          加上八字印星影响食神，同时比劫透出，说明竞争和阻碍大，天干三个戊土伏吟，地支两个申金伏吟，伏吟在奇门遁甲中主慢，这个意思就更明显了。
          八字申金食神当令为用，故围绕食神来发展会较为有利，适合朝服务方面、技术方面、接待、窗口、设计策划、医药、教育、国学宗教、传统文化这些方面发展是适合的，考研的话要选对方向，避免脱离实际，天马行空的幻想，而错失一些机会。
          年支丑土暗藏食伤，地支申金食神为用，食神代表晚辈、学生，又印星不弱，能从事教育行业非常适合你，可以从事该行业。
          八字四柱无财，只有丑土暗藏癸水正财，申金暗藏壬水偏财，可以把申金食神当做财来看，因为食神生财，食神为财源，日坐申金食神为用，财源是可以的，能够衣食无忧之命。
          把申金食神当做财星来看，而食神代表是技术才华，也代表是付出，也说明求财需要付出多，亲力亲为才能得到财，同时也代表要多去提升自己的专业知识，专业技能，才有更好的财运。
          一般来说食神为用，且没有破话的话，有一个食神抵财官的说法，但由于申金食神被午火所制，同时两个食神伏吟，就打了折扣，难见较大的财，能上班求财求稳最好。
          你现在走的是辛亥大运，为伤官生财的大运，总体运势是不差的，但由于天干辛金伤官透出，和丁火印星相战，地支又申亥相害，申金有损，故考学运不会很顺利。2022壬寅年，天干丁壬相合，丁火印星被合克，为财星制印，太岁和大运寅亥相合，故考学运较为不错，今年要把握机会，有望上岸。丁火印星被合动，寅木七杀临驿马逢合，也可以考虑换工作，有不错的机会。
          婚姻分析：八字日坐申金食神，容易对婚姻幻想，对另一半要求不低，日坐申金，天干生地支，也会按照自己的意愿和喜好来找对象，喜欢追寻自己所爱，而非被爱，八字不见财星，在感情上也稍显木讷，不善于察人识人，故在异性追求上要理性一些才好。
          八字不见夫星，就连暗藏的也没有，又戊申日出生临阴差阳错日，临女孤鸾煞，容易错过一些缘分，姻缘来的会晚一些，时支午火为桃花，挨着婚姻宫，也容易遭遇烂桃花，为不利之处。天干地支伏吟较多，且伏吟到婚姻宫，也代表不会落实婚姻太早。
          不过，日支婚姻宫为申金食神，临文昌贵人，代表未来丈夫比较聪明伶俐，学历一般也不低，人比较能干，年龄多比自己小一些，临天喜，未来婚姻较为和谐稳定，有一定幸福感。
          2022壬寅年，红鸾星入命，2023癸卯年，地支卯木官星出现，天干戊癸相合，卯木官星跟着癸水被合入，这两年要好好把握，有遇到的运气。
          对象脸型方正，肤色清白，中等身高，大概在175左右，看起来比较的有精神，眼睛大，双眼皮，也比较的有神，耳朵不大不小，贴脑不显，眉毛密而长，鼻子有肉，嘴唇不厚，短发，生音敞亮。业为物资采购、金融贸易，后勤管理统筹有关。
          你的命局申金食神为用且不弱，子女缘分是不会差的，但要注意的是时柱子女宫为午火羊刃，且午火来制申金，又八字缺水，在生育上容易遇到不顺利，比如胎儿不稳的，难产，小产，剖腹产等，婚后要孩子的话，要先调理好身体再要孩子。这也是养宠物不利的原因所在。
          大运分析：23岁—32岁走的是辛亥大运，此大运为伤官生财的大运，天干辛金伤官高透，但和丁火印星相战，考学不会太顺利，有一些波折。辛金坐亥水临驿马，地支申亥相害，也容易想法较多，心性不定，烦恼较多，上进心比较缺乏，容易行动力不足，懒惰，或在想法判断上发生差错，不过，地支食神生财，财运不差，有求动财的机会，要好好把握。
          33岁—42岁走的是壬子大运，此大运干支一气为财星，天干丁壬相合，丁火印星被合克，壬水偏财被合拌，地支子丑相合，劫财合财，财星和年柱相合，能外出求财较为有利，出生地北方较为有利。劫财合财，也要注意和同辈人之间金钱往来，钱财花销较大。
          43岁—52岁走的是癸丑大运，此大运天干癸水被地支丑土戳脚，为劫财制财的大运，天干三个戊土争合癸水正财，为比肩夺财，此大运财运不太好，要注意和身边人的钱财来往，不要去搞一些高风险投机的事情，比如炒股，网贷等，以及大的钱财外借，容易破财，赚来的钱不易守住。
          53岁—62岁走的是甲寅大运，此大运干支一气为七杀，和日柱天克地冲，容易经历较大的变动，一方面是事业上很容易发生变动，此大运往往是退休的运气，寅木临驿马，事业上也比较辛苦，另一方面，婚姻宫逢冲，要注意和丈夫之间矛盾是非，凡事多忍让包容。
          `
  }]
}

export default {
  午时
}