const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   正官   日元   食神',
  天干: '癸(水) 壬(水) 乙(木) 丁(火)',
  地支: '酉(金) 戌(土) 酉(金) 亥(水)',
  遁藏: '七杀   正财   七杀   正印',
  大运: '癸亥，甲子，乙丑，丙寅，丁卯，戊辰，己巳，庚午，辛未，4岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/482.html',
    命主甲: `我刚出生时父母就离婚了，后来小学时家里闹翻，初中爷爷就不幸过世了，那时候一直过的很不安，现在长大了这种感觉淡了，但总感觉和家里隔了一层，不是特别亲近
          `,
    珠玑: `八字分析：乙木生于戌月，为正财格。时干透丁，日支坐酉，戌穿酉，为食神制杀。但两个酉金七杀很旺，丁火透出被壬水合住，癸水直接克制。天干最怕一合一克，现在七杀旺，食神又遭到破坏。食神代表财源，也代表福气，自然会有所不如意了。另外，食神制杀和正印化杀同时出现，且互相牵绊，也降低了命局的层次。
          乙木日出生的人安静温和，比较灵活多变，容易适应环境，则是利于事业发展的。丁火食神贴身，是一个比较认真，细腻的人，人也非常善良，谦卑，受人欢迎。
          食神贴身主口才好，丁火也代表文化，同时八字戌亥全，戌土为万物之终而收藏，亥水为万物之始而登明，所以戌亥主重生，为天门。戌+亥也代表超强的第六感和宗教缘分，另外也代表对传统文化悟性较高，适合从事传统文化相关职业。但有时候性格容易没有主见，三心二意，在事业上难以驾驭大局，这是不利的。
          聪明不过伤官，伶俐不过七杀。乙木日主坐酉金七杀之上，同时时干透出丁火贴身，原局水较多，水主智，人比较聪明机灵。
          八字印星为用，正印贴身，食神丁火去合了壬水正印，代表这个印可以得到，早年走的印比大运来助身，可以取得一定的学历和文凭，八字有正印和偏印，代表可以取得多个学历，多个文凭，多个证书。
          八字喜印，是一个比较爱学习的人，努力学习，尽力提升文凭和学历，对你的事业和未来发展至关重要
          月令戌土为正财，流通入日主，代表这个财可以得到。财官印相生三宝流入自身，女命逢之较吉。也代表贵人运非常好。这种组合喜在正式单位上班为吉，年柱杀印相生利武职，去考公检法，纪委监委等部门，或考军队文职，则非常利于自己发展。
          年干癸水为印，月干壬水为正印，正印和偏印双透，以后有从事多份职业之象。以后条件允许可以去发展副业。
          但月令戌土正财星被左右两个酉金穿害，也代表容易破财，不聚财之象。时干丁火食神高透，但由于戌土生酉金，酉金生亥水，亥水来克丁火，且丁壬相合，则食伤星难以生财，财运较为一般，适合在正式单位上班为宜。
          婚姻分析：乙木日出生的人在感情上容易为对方考虑，并且能够忍耐，比较善解人意，婚后会另一半会感到温暖贴心，利于婚姻稳定。但是也容易对爱人产生依赖，不够独立，如果遇到好男人依赖还好，遇到渣男也容易深陷感情中难以自拔，这种性格很容易受到伤害，而且不容易从失败的感情中走出来。
          年支酉金，日支酉金为七杀，月支戌土中也暗藏了一个辛金七杀，原局只见七杀不见正官，则以七杀为夫，也代表自己是一个感情比较专一的人。印星较多，正印贴身，对待感情比较保守，不会轻易接纳异性，确立关系。
          七杀偏星多，代表自己遇到的偏缘较多，要注意烂桃花。地支酉金夫星伏吟两次，代表感情反复，也代表以后夫妻感情较为冷淡。酉酉自刑，且酉戌穿害，日支夫宫受损，代表会遇到一段失败的感情，早婚的话也很容易离婚。婚后生活也比较不稳定，易发生口角之事。七杀为忌神，则婚后压力较大，婚姻也会给你带来很多烦恼。
          未来的丈夫比较帅气，气质出众，身材偏瘦，皮肤白皙，性格比较热情急躁，自尊心较强，但懂得浪漫，富有情调。
          2024年甲辰年，地支酉辰相合，一合解一冲，流年太岁动了婚姻宫，会遇到缘分，结婚可以落实，要好好把握。
          六亲分析：你的八字年支酉金和月支戌土酉戌穿害，早年家庭不和，出生不好，难以得到长辈关爱。月干壬水正印星代表母亲，月支戌土正财代表父亲，月柱为财星破印的格局，则为父母不和，离婚之象。
          戌土被两个酉金穿害，则戌土受损，代表父亲不吉，运势不佳，所以你的命局是克父的。
          女命八字以食神代表奶奶，原局丁火为食神，丁壬相合，癸丁相冲，则丁火受损，也是不利奶奶的，表示奶奶身体不好，大运流年若再见癸水来冲丁火则奶奶会有灾，2023癸卯年，2033癸丑年要非常注意，当然具体还要看你奶奶的八字原局。
          丁火食神出现在时柱也代表子女，丁火坐亥水之上虚透，丁壬相合，丁火食神受损，则子女缘分较差，求子不易，丁火食神临驿马星，则以后备孕在外地备孕生产为吉。
          大运分析：24岁-33岁走的是乙丑大运，此大运天干乙木坐丑土之上虚透，丑土被乙木盖头，乙木无强根帮身力量不强。丑土在地支去生了酉金七杀来攻身，故而这十年在工作上压力很大，身边会有一些小人让你心烦意乱，工作上较为不顺心。走财星大运一般不太爱学习，玩心较重，这是要改变的。丑土为华盖，走华盖大运内心也容易孤独。
          34岁-43岁走的是丙寅大运，此大运地支寅木出现，为乙木日主的根，但在地支被酉金所克，要注意身体健康，以及意外伤害。但寅木去合了亥水，也为合了驿马，代表这个大运会比较稳定。天干丙火透出，和原局丁火构成日月相随，从调侯的角度来看，乙木见丙火为吉，可以帮助乙木生长，工作上可以得到升职加薪的机会。但丙火作为乙木的伤官，泄掉了日元之气，这个大运付出也比较多，会非常辛苦。
          44岁-53岁走的是丁卯大运，此大运地支卯木为乙木的禄神，卯酉相冲则禄神逢冲，一方面代表身体健康受损，另一方面禄神逢冲则容易发生破财之事，这是要多注意的。
          54岁-63岁走的是戊辰大运，此大运干支一气为财星大运，天干戊癸相合，地支酉辰相合，则阻断了流通，月令戌土得到解救，直接来克印，财星破印则会破财，这个大运较为不顺。
          后面的己巳，庚午，辛未大运，均为忌神大运，且庚午大运和辛未大运为空亡大运，要注意破财之事以及身体健康。
          你的八字还比较不错的，从大运来看也没有很明显不利婚姻的信息，但婚姻中发生点磕磕绊绊在所难免，晚婚，注意后天的感情相处经营，有一段稳定的婚姻是没问题的，没必要担心太多。
          工作方面转行肯定是比现在好的，趁年轻抓紧机会，到北方，东方，东南方发展较好。
          六亲方面是有一些不利的信息，但八字中的克六亲，指的是你八字中记录了这些不利六亲，关系不和睦不亲密的信息，而父母离婚，长辈健康等这些问题，他们命中本身也是带的，要客观理解看待，不要给自己添加不必要的烦恼忧虑。
          你的八字印星较多，且丁壬相合，则依赖性比较强，也非常注重长辈家人。
          `
  }]
}

export default {
  亥时
}