const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   偏财   日元   偏财',
  天干: '癸(水) 壬(水) 戊(土) 壬(水)',
  地支: '酉(金) 戌(土) 寅(木) 戌(土)',
  遁藏: '伤官   比肩   七杀   比肩',
  大运: '癸亥5，甲子15，乙丑25，丙寅35，丁卯45，戊辰55，己巳65，庚午75',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/358.html',
    命主甲: `一心想要找有钱人，最后落得伤痕累累的女命
          `,
    珠玑: `八字分析：戊寅日生在戌月为泰山之土，土乃是万物之灵，可是此八字的水很旺，就变成烂泥土，有句俗语：烂泥扶不上墙，所以此八字的土由于周边都是水，变成这条路很难走，如履薄冰，
          日支寅木为七杀星夫君，但由于寅木需要阳光木才能长得葱郁茂盛，否则木就长不大，很难成为栋梁，所以此八字很难找到一个依靠的男人。此八字的财星很旺，又天生幻想嫁给高富帅的男人，可日主又衰弱，自己的力量不够，很难驾驭得住财星，所以只能沦为幻想。
          土又有水，道路就会变成很滑，所以此人做事经常矛盾重重。
          由于土弱，土被水流走，人就会变得自卑，缺乏勇气，经不起风吹雨打。
          寅木为夫星，因为农历七月为申月，申酉戌三合金局，金克木，寅申相冲，所以每年7月都会造成感情不顺。
          此八字只有进入丙火大运，有阳光的照耀，婚姻才能走得顺利。
          此八字没有正官星，只有偏官星，适合找离异的男人。
          属相：找属马，寅午戌三合火局，有助自己。
          方位：适合找南方。
          配偶大概特征：寅为驿马星，此人活跃开朗，外向型，好动，日坐七杀星，配偶脾气大。两个人不是很相爱。属于为了结婚而结婚。
          此八字缺火：缺乏自信，做事情不够阳光。
          由于以前择偶观出现错误，一心想要找有钱人，最后落得伤痕累累。
          `
  }]
}

export default {
  亥时
}