const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1990年十二月二十一日辰时'
  }],
  十神: '正财   偏财   日元   七杀',
  天干: '辛(金) 庚(金) 丙(火) 壬(水)',
  地支: '未(土) 寅(木) 午(火) 辰(土)',
  遁藏: '伤官   枭神   劫财   食神',
  大运: '辛卯，壬辰，癸巳，甲午，乙未，丙申，丁酉，戊戌，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/414.html',
    命主甲: `从小家庭算比较幸福，和父母感情比较好，一路成长也算无惊无险，只是在感情婚姻这条路上走的异常艰难，之前谈过好几段感情都没有好的结果。
          所以我对待感情婚姻也特别慎重，和现在老公也是谈了4年，自认为两个人的感情和磨合都算可以了，19年结婚，但是结婚不到半年的时间，也就是今年，我发现他犯了原则性问题，虽然他一再表示自己是一时糊涂，求我原谅，
          但是我真的觉得特别受伤，我自认为对感情对婚姻都抱着很谨慎的态度，为何还是这样的结果，难道这一切都是命吗。
          `,
    珠玑: `八字分析：丙午日柱的八字因为坐刃的缘故，往往是个性比较刚强的八字，这也是日支对八字影响的强力表现。丙火生寅月，为偏印格，干透正偏财和七杀，时干七杀有贵征，但原局七杀不强。
          事业分析：你的八字年干透辛金正财，月干透庚金偏财，同时年支未伤官生财，只是八字生在寅月，财和伤官的力量不太旺，但财星得到一定生助，命里还是些钱财和财富。八字壬水七杀在时干，时支辰土食神，为食神驾杀的组合，对你整体事业财运发展有帮助。
          而八字月令寅木和和日支午火半合增加了劫财的力量，对你事业有不利的影响，事业上容易面临竞争和小人。
          好在八字比劫不透，地支又有未土和辰土食伤泄劫财，形成食伤生财的流通组合。八字财星为喜得到生助，起到好的作用，七杀坐食神可以驾驭七杀。
          整体而言你的八字原局组合还可以，只是结合八字大运来看，大运走势不太好，总体在小康偏上的层次。
          你的八字财星虚透，同时日主坐下阳刃，地支又有食伤来生财，说明你的欲望比较大，不容易知足满足，而地支食伤泄比劫生财，有时容易浮躁，躁动，有些坐不住，急于求成。
          但八字食伤生财，财星虚透两位，且为喜用神，所以金融财会是适合你的，同时食伤主技术技能，也代表口才，所以一些经营策划，教育培训方面的也是适合你的，而时柱食神驾杀，也可以往些管理，人力资源方面发展。
          婚姻分析：你的婚姻宫午火劫财无制为忌，同时又有寅木来生，劫财的力量得到增强，劫财入婚姻宫，劫财为其他女人占据婚姻宫，也代表丈夫有出轨的潜在信息。
          壬水七杀在时干，而癸水正官不显，力量微弱伏藏在辰土，也说明你的感情不太稳定，容易遇到些烂桃花，且婚姻宫为忌，与丈夫的缘分不太深。
          同时地支又有未土伤官和辰土食神，食伤旺，而且日支为阳刃劫财，说明你在婚姻中脾气是比较大的，有时候任性，挑剔，会有些缺乏安全感和信任，久而久之不利感情和谐，导致感情不稳定。
          日柱属于阴差阳错日，同时命带寡宿，容易感情关系不和谐，也有些内心孤独的信息，婚姻组合是不太理想，容易有闹离婚的危机。
          大运分析：30岁-39岁走的是癸巳大运，此大运财生官对你的事业求财有些帮助，也有发展提升机会，但竞争也不小，注意把握。地支刚好巳午未三会比劫局，大运八字官杀混杂对抑制比劫还算有些帮，只是地支比劫较旺，所以会有所竞争，属于有利有弊大运组合，要注意理财。
          40岁-49岁走的是甲午大运，此大运杀印相生，还算流通，虽然忙碌付出多些，但对八字还是有帮助的，会有些发展。只是地支午火劫财增强的八字比劫的力量，同样会遇到竞争阻碍和小人干扰，开销破耗也比较多，整体比上个大运要差些，特别是木火旺的年份要注意。
          乙未大运与八字乙庚合，印合财是不太好的，自己有些发展的计划，但不要有太过冒险，凡事三思而后行，谨慎求稳发展比较好。而地支伤官与日支午火相合，对八字有些小的帮助。
          丙申大运与八字天干丙辛合比肩合克财，地支食伤生财，且驿马相冲，财冲印，所以有明显的为财辛苦，奔波走动而有收获的信息。晚年运气比较一般。
          你的八字原局还算可以，虽然地支月令与日支半合比劫局，但是地支有食伤泄劫财，同时年柱伤官生财，对你八字整体有一定帮助，加上八字天干虚透两财星，财得生，虽然不是非常的旺，但整体不会太差，命里有一定财富。
          加上时柱食神驾杀，财生七杀对你事业也是有利。只是八字大运组合走的不算太好，限制了发展，格局层次难以得到提高，大概在小康偏上的层次。
          `
  }]
}

export default {
  辰时
}