const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1971年五月(闰月第一个五月)初六卯时'
  }],
  十神: '正官   正印   日元   伤官',
  天干: '辛(金) 癸(水) 甲(木) 丁(火)',
  地支: '亥(水) 巳(火) 寅(木) 卯(木)',
  遁藏: '枭神   食神   比肩   劫财',
  大运: '壬辰，辛卯，庚寅，己丑，戊子，丁亥，丙戌，乙酉，8岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/393.html',
    命主甲: `在2016年通过自己的名义在银行办了一笔几十万的贷款，并全部借给朋友做生意。因对朋友的信任，借款只是口头约定，没有签订任何具体的纸质借据。
          现贷款到期，银行让我还贷，我向朋友要钱。结果，朋友以生意破产没钱还我为借口，拖着不还，其暗地里转移自己财产，故意不给我。
          因银行到期我没钱还银行贷款，也致使自己被拉入黑名单，给生活造成很大不变。自己的一片好心，被别人利用，毁了自己。
          `,
    珠玑: `八字分析：甲木生在已月，为食神格，一般来说，食神格除了枭神，配其他任何十神基本都没有太大的问题。你的八字日柱甲寅上下一体，为人比较耿直，表里如一，对朋友来说是个比较可靠的人。
          亥水在年支为偏印，亥水有辛金生助，有夺食的嫌疑。再看寅已相刑，寅木和已火都受伤，禄神和食神都是吉神，受伤则会不利财运，甚至健康也会受到影响。时上伤官阳刃，也是不好惹的家伙，阳刃无制，往往在钱财上会有一定程度的损耗。
          事业分析：天干金水木火流通相生是个比较不错的组合，同时属于官印相生，伤官配印，最终五行力量落在伤官上，说明你是比较积极努力，做事能力也比较的突出，做事情喜欢亲自上阵，亲力亲为的人。
          比劫得印星来生，容易相信别人，特别是所谓的哥们容易给你出馊主意，连累你，把你带到坑里，也是容易因为朋友而破财倒霉的信息。
          八字地支寅巳刑，比肩刑的是食神财源，同时地支巳亥，所以很容易因为钱财的事情而与兄弟朋友闹的不愉快，也是有是非及经济纠纷的潜在信息。同时也代表你在做某些决定的时候，很容易有大意错漏，过失失误导致破财使得自己比较被动。
          正官在年干，八字官印相生流通对八字日主有帮助，说明自己还算比较正派，正直，为人是善良的。正官也代表是事业，职位，名声等，但正官无根，所以这个正官的作用打了折扣，对你的事业的发展力量有限。
          月令巳火为食神，巳火为财源暗藏财星，巳火可以泄地支比劫的力量，原本是好的，但月干是癸水，地支又有巳亥相冲的组合，食神的力量被削弱，但毕竟有比劫生食神，所以尽管有时遇到些困难阻碍，但通过自己的努力，还是可以有发展收获和进步，加上八字时干伤官透出，也可以泄比劫的力量，对八字事业求财是是有帮助的。
          结合你走的大运来看，一路走官杀，财，食伤的组合大运，所以你还是可以有发展，只是八字忌神力量也不小，加上后面大运地支又是印运，所以发展空间有限。
          目前走的是戊子大运，58岁后走的是丁亥大运，大运天干伤生财，且伤官旺为吉，但是地支见亥子水，水为印忌神且生比劫的力量，比劫力量增加，对方是不情愿，不想还钱的，想要让他还钱阻碍重重，建议你先想办法处理好这笔债务，同时想办法找他还钱。
          但结合你走的大运来看，还是会有发展的，只是时间会比较久，要到2026年，2027年债务才可以得到解决，要有心理准备。
          大运分析：48岁-57岁走的是戊子大运，此大运为偏财加正印大运，八字天干伤官生财对事业财运还是有些帮助的，但八字财星没有明显的强根，同时大运与八字戊癸合，财星太合印星，很容易有些借贷关系不利信息。
          再加上地支子水增加印星力量，也代表你会比较忙碌辛苦付出，破耗财比较对，同时地支子卯刑，人际关系方面也不太好，属于有利有弊的运气组合，但整体利大于弊。
          58岁-67岁走的是丁亥大运，大运增加了八字伤官的力量，伤官为财源，利于财运发展，个人努力会有所收获。只是地支亥水增加偏印的力量，巳亥冲有偏印夺食的组合，所以会有些憋闷，心情不太好，要注意做事的时候过失失误，耗子啊地支有比劫流通缓解了枭神夺食的力量。
          而地支比劫旺，所以同样要注意理财，且稍微辛苦忙碌才有进步，提升幅度不会太大，属于一分耕耘一分收获的运气。
          68岁后走丙戌大运，为食神生财的运气组合，但地支卯戌合，财星被劫财合克，所以整体的运势也是有利有弊，晚年生活也较为一般。
          你的八字有财官印相生，伤官配印的组合，代表自己还是有能力，有事业心，但八字地支印星两现，且比劫旺，容易因为自己考虑不周，决策失误而导致破财。
          好在八字大运走势方面，一路走的是官杀，正偏财及食伤的大运组合，对你的财运发展还是有些帮助，还有发展进步的机会，只是不具备大的发展成就，整体格局层次不太高，属于普通偏好的格局层次。
          `
  }]
}

export default {
  卯时
}