const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1990年七月二十一日丑时'
  }],
  十神: '正财   枭神   日元   偏财',
  天干: '庚(金) 乙(木) 丁(火) 辛(金)',
  地支: '午(火) 酉(金) 丑(土) 丑(土)',
  遁藏: '比肩   偏财   食神   食神',
  大运: '甲申，癸未，壬午，辛巳，庚辰，己卯，戊寅，丁丑，丙子，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3340.html',
    命主甲: `出生于广东省湛江市，是个农村的孩子，从小家境不好，爸爸是个农民工，妈妈一直居家务农，上面有3个姐姐和1个哥哥，他们初中都没读完便早早辍学出去打工，工作收入待遇也不好。
          我是2009年高中毕业后，没考上好的学校后，加上家里经济也不好，父母就让我出来工作了，我工作期间，哥哥经常在外面惹事，需要赔钱给别人，父母和我工作的钱，很多时候都再帮他善后，没有任何的积蓄。
          这十几年来，我做过导购员，也做过淘宝客服，期间换了很多份工作，每份工作时间都不长，都是一年左右。直到2014年遇到我现在的老公（他是重点本科，农历1990年9月29日未时出生的），在他的影响下，
          我的工作慢慢往公司跟单文员的岗位转型，但工作也只是比之前好一点，期间也换过两份工作，到2017年下半年，我怀孕了，跟我老公结婚后，由于怀孕期间先兆流产导致没办法工作。
          生完儿子后，从2018年11月出来工作进入到现在的公司做跟单文员，一直做到现在，我们公司是化妆品代加工生产的，收入等各方面渐渐好一些，我现在的收入还算不错，今年也花钱报考大专学历的成人大学。
          我老公2021年初从他之前工作了9年多的公司辞职，出来跟别人合伙做外贸生意，主要是做女士背包类目的，合伙人投入的钱多些，我们少一些，创业初期，生意不怎么好，家里的经济压力主要是我在承担，
          从去年月底开始，生意慢慢好些，今年比去年好很多了，每月开始有点钱赚了，也租了办公室，准备招一两个员工，现在主要是我老公一个人在负责运营，合伙人负责产品生产，他有自己生产皮具的加工厂。
          `,
    珠玑: `八字分析：丁火日主生在酉月，时干透辛金，为偏财格，丑日丑时食神旺而生财，丁火的根午火在年支受伤严重，偏印乙木被庚合克无力生助丁火。
          事业分析：八字为偏财格，酉金偏财当令较旺，地支丑土食神生财，求财的欲望不小，但八字身弱不能担财，求财会非常辛苦，会因为求不得而滋生不少烦恼，也容易贪图享乐，偏于懒惰，尤其物质条件好的时候，就容易放纵，安于享乐，这是要注意的。
          丁丑日出生，日坐丑土为食神，伏吟时支，也表示在家庭和事业中付出较多，操心操劳不少，年支午火禄神来制酉金偏财，也代表只有踏踏实实吃苦耐劳，事业运和财运才会好一些，八字身弱，食神生财，做事较难坚持到底，很难披荆斩棘，突破困境，多会被困难而打败，这也是要克服的。
          八字身弱喜印，月干虽见乙木枭神，但乙庚合化为金，乙木名存实亡，印星难以助身，故学业受阻，很难顺利完成学业，甚至很容易辍学，所以文凭学历不会高，也很难靠学历来吃饭。印星为独印被合化，加上月令酉金空亡，也代表祖上不富，难以帮到自己，为白手起家之命。
          八字喜印，你能想到去报考大专提升学历是非常好的，可以加强印星的力量，对你运势和事业有一些帮助。今年壬寅年，官印相生，天干丁壬相合，考学运尚可，故要把握住今年的机会，争取一次考上。
          日坐食神，食神生财，能掌握一门过硬的技术为好，偏财高透，一般口才不错，你能从事文员多年，进入化妆品行业是可以坚持做下去的，化妆品行业五行属火，比较旺你，但由于八字印星被合化，故业务能力较为一般，很难把事业做的非常好，依靠勤来补“拙”较为有利。
          天干财星透出，但好在地支有丑土财库，财星可以被收入，可以得到这个财，不过，地支丑土伏吟，见两个财库，财库多而难富，又丑午相害，财库受损，命中难见大财，能满足于上班求财，
          赚一些辛苦钱就可以，单靠你的财力想在广州买房有点困难，不过，午火为八字禄神在年，也适合在外地扎根。至于创业之事，也不太建议，做好当下就好。
          婚姻分析：八字为偏财格，财星较旺，日坐丑土为食神，故在感情上有自己的喜好，也喜欢按照自己意愿去择偶，对方也多为自己所爱，偏财较旺，容易被长相帅气，才华横溢，条件优渥的男性所吸引，也表示会因为家庭付出较多，相对对方自己付出更多。
          八字官杀藏而不显，只有日支丑土暗藏癸水七杀，伏吟时支，又丑午相害，癸水七杀跟着丑土受损，又日支婚姻宫为丑土忌神，故代表丈夫能力较为一般，日支婚姻宫受损，又丁丑日出生阴差阳错日，婚姻有一些磕磕绊绊。
          大运分析：31岁—40岁走的是辛巳大运，此大运天干辛金被地支巳火截脚，为劫财制财的大运，地支巳酉丑三合金局，旺了财星，身弱难以担财，故求财非常辛苦，财运较为一般，能赚到的钱较为有限，能安安稳稳上班为好，不宜去创业，在求财上可以多依靠丈夫。
          41岁—50岁走的是庚辰大运，此大运为伤官生财的大运，旺了财星，依然求财压力很大，求财较为辛苦，能得到的财较为有限，财运较为一般，此大运依然不建议去创业，上班求财为上选，此大运伤官强旺，宜克制求财的欲望，顺其自然为好，不宜强求。
          51岁—60岁走的是己卯大运，此大运天干己土被地支卯木截脚，地支卯木印星助身，但卯酉相冲，大运来冲提纲，也较为不利，财运依然不佳，钱财不聚，花销较大，整体运势也较为低迷，能退则退为好。
          `
  }]
}

export default {
  丑时
}