const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '伤官   正印   日元   偏财',
  天干: '乙(木) 辛(金) 壬(水) 丙(火)',
  地支: '未(土) 巳(火) 午(火) 午(火)',
  遁藏: '正官   偏财   正财   正财',
  大运: '庚辰 己卯 戊寅 丁丑 丙子 乙亥',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/190.html',
    命主甲: `壬水从财格青年得志，得妻助成材而发富
          `,
    珠玑: `此造出生日的日干为壬水，所以属壬水命。壬水是江河湖海，是长江与黄河那类波涛汹涌，澎湃激荡的大水。唯生于夏天四月，巳火当旺之时，巳中火旺土相，壬水临绝地，生出来就身弱。
          再看自坐午火，时柱又是丙午大火，火旺已极。此时想要身主中和，非得壬水、庚金透干，而且支坐申金、子水不可。但是现在只看到一点辛金透出天干，地支全无金、水之根，反见一未燥土，成巳午未三合南方火局。年干乙木助火泄水，此点辛金虚浮无根，丙辛隔位之合，辛金有等于无，不能作生水之用矣。
          综合上述八个字的分析：壬水日主无根，亦无金水（印劫）之助力，地支成火局，天干透木、火，辛金虚浮无根，被火所克不能用，全局一片火海，壬水日主被火包围。想要保存生机，唯有不要自已，跟随周围的旺火之势而去，这就构成了特别格局中之“从火格”，而火又是水命人的财星，所以就是“从财格”。
          从财格：八字构成，日干不通根地支，并且不见一点印、比劫、禄刃帮助，而地支会合财局。天干竞透，四柱多见财星，旺气偏于财星一行，日干弱不堪扶，则应以“从财格”论，并以强旺的财星为用神。
          此造由于一点辛金透出天干，所以属于“假从财格”。假从较之真从格，祸福略有不同。真从格局纯粹，大多生于富贵之家，行运得其喜用，大多可以继承父辈、祖辈的事业。就是逢逆运，只要不是犯旺，亦多履险如夷。但真从格这种格局，世不多见。
          假从，格局虽不纯粹，而且多生于普通家庭，但如行喜用之运，也可发富、发贵或富贵双全，只是时过境迁，可能一落千丈，或遇凶祸，回复到原来的地位。平常所遇到的从格，大多属于假从从财格，行运喜见财、食伤，见官杀制比劫亦不妨。忌行印星、及比劫、禄刃运，帮助日干，中途变志，则为凶祸。
          早年行东方木运（食伤运），木助火势，顺其旺气，自是心想事成，求谋顺畅。唯中年运入北方水地，比劫帮助日干，中途变志，反复之事，烦滞病有之。此造应在伤病上，寻遍名医无法根治，因其气已逆旺火之故。
          又，从财格之男命，有易得妻财、或妻助，皆因以财为妻星，财为喜用。又日干地支为妻位，妻位是财星为喜用，妻星和妻位皆为喜用神，而此喜用神又是财星，故易得妻财、或妻助，此造是得妻助而成事业而发富。
          `
  }]
}

export default {
  午时
}