const 未时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1996年六月二十九日未时'
  }],
  十神: '偏财   偏财   日元   正财',
  天干: '丙(火) 丙(火) 壬(水) 丁(火)',
  地支: '子(水) 申(金) 午(火) 未(土)',
  遁藏: '劫财   枭神   正财   正官',
  大运: '乙未，甲午，癸巳，壬辰，辛卯，庚寅，己丑，戊子，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/449.html',
    命主甲: `这几年我一直被学业上的问题所困扰。我本科就读于一间还算不错的985大学，大四那年考取了本校的研究生也顺利通过，但是自己在本科的时候挂了一科没能及时拿到证书，于是错过的当年的研究生入学时间。
          顺利拿证之后，自认有了第一次考试成功的经验，还想继续考取研究生，后面陆续考了两年，考到今年却依旧没有考上。
          这几年还一直待业没有经济收入。如今我有些迷茫，虽然对于学历心有不甘，但这几年一直啃老待业也让我感到羞愧，不知道是否应该继续坚持考研，还是放弃考研的执念投入工作事业中。
          `,
    珠玑: `八字分析：壬水生于申月，申中戊、庚、壬皆不透干，取本气庚金立为偏印格。年支子水为日主的阳刃，坐下正财和阳刃犯子午冲，午未合也会穿阳刃，虽然阳刃要制，但这里子水也为壬水的半个禄，冲害过狠肯定会伤了福禄和财运。
          事业分析：日主当令得生助，自己是个较为有想法主见的人，同时八字中带阳刃月令长生，也有些刚毅固执，有时脾气也不小，不轻易放弃。
          日支午火为正财，天干两个丙火一个丁火，天干正偏财齐全，日干和正财，也代表自己对钱财物质追求的欲望大，也代表自己事业心比较强。
          八字财星多现，月干丙火盖头申金印星，地支午未合，也代表自己的要求高，偶尔容易因为收入物质方面对事业有不满情绪，也会有些计较的心里。
          地支也有子午水火相冲，地支半合比劫冲财，有的时候也容易轻信他人或一些损友而吃亏，上当。
          年支的子水和月令申金半合比劫局帮扶日主，日主中和偏旺能任财官，而偏财在年月干，正财在日支，时干，且正财合日主，同时财星在地支有根，且透出，也代表命里是有一定财富，也有偏财运的，整体的物质经济生活水平不会差。
          地支半合比劫局冲地支财，要注意提防损友及不怀好意的人，注意理财，在大的金额来往，投资方面，不要轻信他人，借钱给他人，防止支出破耗，上当受骗。
          从八字的贵人运来看，贵人运一般，但八字天有丁壬合，地支午未合，八字日主合财，且财官合，用神相合代表周围关系不错，也代表自己维护好人际关系对你事业有好的帮助。
          结合大运走势来看，一路走天干食神，比劫正偏印大运，而地支走南方火地到东方木地支大运，八字整体大运还算可以，格局层次整体不会低。
          八字以印星比劫为忌神，地支半合比劫局，印星被化为比劫，而八字大运前面两部大运分别走乙未，甲午食神泄秀生财流通的运气，对你的学业运有帮助。后面的癸巳大运天干见劫财，对学业考试运不太好，加上近几年流年对学业也不太好。
          比如如2020年庚子金水相生，2021年土金相生及后面的2022年，2023年走的也是比劫运气，所以你后面几年学业运一般，继续考研的话，比较浪费时间，付出了时间精力也是难考上，还是早参加工作比较好些。
          从你八字组合来看，日主正偏财透出，合财星，又喜食伤，财，可以往金融财经，设计策划，互联网相关，文化教育培训方面去发展。而学术方面研究的话需要食伤透出才更适合，所以学术研究比较勉强了，不太适合的。
          婚姻分析：午火为婚姻宫，午火中暗藏正官为喜神，地支午未生合时干正官为星，天干又是丁壬合，八字日柱任务和时柱丁未天合地合，把财官合到日支，且又是喜用神为吉利，命里丈夫出身条件还不错的，对你也有帮助。
          只是年支子水，和月令申金半合比劫冲午火婚姻宫，婚姻宫容易不稳定，也代表会有不合及分歧争吵矛盾的潜在信息，防第三者女人干扰插足。
          同时八字婚姻宫先冲后合，正官在时柱逢合，所以代表你的刚开始的感情不太好，到后面会慢慢平稳和谐，但还是要注意婚姻问题矛盾滋生，及其他女人干扰，感情有时容易时好时坏。
          从你的婚姻运来看，当八字天干流通婚姻宫不逢冲或冲的压力减弱的时候有结婚的运气，如2025年天干伤官生财，地支巳申合水的力量被减弱些，且增强八字夫星力量，有结婚的运气。
          大运分析：2018年-2027年走的是癸巳大运，大运天干劫财，但力量不是太大，同时地支巳申合，水的力量被减弱，所以地支巳午未增强八字财官力量，此大运虽然事业有竞争压力，但整体来是好的，事业财运收入能够提升。
          而婚姻宫被旺的比劫冲，有些不稳定的信息，且劫财透出，感情容易被干扰，而地支婚姻宫逢冲力量减弱，地支午未六合加强，故而此大运结婚的运气，整体而言感情运还算可以。
          2028年-2037年走的是壬辰大运，天干比肩透出，地支申子辰三合比劫局不太好，丁壬合，财星被合不吉，事业阻碍竞争大，容易招惹小人，开支破耗读哦，地支半合比劫局冲财星，
          也是不太稳定的，要注意理财，而比劫旺冲婚姻宫也是不太好，感情不稳定的，容易有吵架及第三者插足，有婚姻危机发生，特别是在金水旺的年份更要注意。
          2038年-2047年走的是辛卯大运，天干丙辛合，地支卯木伤官可以流通八字水的五行力量，此大运会有比较大的开销和投资花销，而地支水木火流通，财运是向好的方向发展，能够发展提升，收入也会有所增加，整体运势还算可以，属于好的运气组合。八字财生合正官星，婚姻问题不大。
          庚寅大运，天干印星容易被财克 ，且生助日干，地支贪合财星，事业会有些忙碌，疲劳，但总体还算平稳。
          己丑大运，财生官，而地支子丑合解冲，后面的整体事业财运，婚姻运也不会差，晚年生活运势平稳，安享晚年。
          你八字日主当令，且八字地支半合比劫局帮扶日主力量大，日主偏旺能任财官，八字中财星可为用神，八字中日柱与时柱天合地合，把财官合到位，代表自己有驾驭财官得到财官的能力和际遇，加上八字偏财星透出在年月干，
          所以命里也会有一定的偏财运气，整体八字事业财运还不错，生活及经济水平富足。
          `
  }]
}

export default {
  未时
}