const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1996年七月十九日亥时'
  }],
  十神: '正官   正官   日元   枭神',
  天干: '丙(火) 丙(火) 辛(金) 己(土)',
  地支: '子(水) 申(金) 丑(土) 亥(水)',
  遁藏: '食神   劫财   枭神   伤官',
  大运: '乙未，甲午，癸巳，壬辰，辛卯，庚寅，己丑，戊子，9岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/341.html',
    命主甲: `从出生一直命运坎坷，年幼3岁父亲因病去世，母亲一人抚养长大，身边的亲戚都说从母亲怀上我开始父亲就开始生病，长大后母亲也给我算过命，好多家都说我天生克父母，以后结婚会很困难克丈夫，身上有很重的缘分会出马。
          我有时候总会做同一种梦，偶尔控制不住会发疯。本以为事业会好但是自己做过生意赔了钱，现在就是在打工。现在谈了个男朋友我们在一起6年之久中间坎坎坷坷又在一起了，
          然后问过算命先生会不会结婚，都是说走不到最后，如果我早结婚会离婚，中间有人阻碍我们两个。
          `,
    珠玑: `八字分析：辛金日主生在申月得令，申金为劫财帮身有力，同时日主坐下丑土为偏印帮身，八字金为月令所以丑土为金库，对日主的生助力也是不小的，加上日支偏印透出在时干贴身生日主，所以还有一层生助力量。
          而八字年干，月干两丙火相邻克合日主，但八字丙火官星无根克性不是非常大，年支子水与月令子申生合泄月令力量，减弱帮扶力度。但综合而论，八字日主生助较多，克泄耗较小，故日主仍偏旺些克泄耗的五行为用神，生助的五行为忌神。
          而八字申月为深秋之月，萧肃之气强旺，又是劫财也喜丙火来克制，且日主辛金喜丙火来合，辛金为首饰成型之金，会更加晶莹剔透。且八字有官则用官，喜财来生官，但八字地支子申半合食伤，食伤旺可泄秀，所以八字地支水也可以为用神，
          但切忌天干透水，地支见火造成水火冲克的局面都是不太好的。所以八字最终天干乙木火为用神，地支水木为用神，而土金为忌神。
          分析克父母：你的八字财星不显，只有甲木财星藏在亥水当中，亥水中的甲木正财可以代表父亲，而八字丑土为偏印为墓，同时参考年柱为丙子，八字地支水旺，而正财藏在水中，地支亥子丑有三会之象，容易造成水多木漂，
          而甲木正财代表父亲，说明父亲的状态是不好的，身体状态不好，有克父亲的信息。同时你的八字当中五行土为印星，而丑土为湿土，湿土逢旺水，容易水土相混，而且丑土去生申金，丑土的力量被泄，丑土偏印的力量也被大大削弱，而偏印代表是母亲，也说明对母亲也不是太有利，但八字有火生土，所以无大碍。
          事业分析：你的八字年柱和月干为用神，正官透出在年干和月干，透但是正属于虚透，坐下被戳脚，所以正官的力量不强，正官可以代表工作事业，但是正官两现反多杂，也代表工作容易变动或调整。
          地支有子水亥水分别为食神和伤官，又有申金生助，地支金水相生，食伤是比较旺的，地支可以代表内心的想法，而食伤旺也代表想法多，不安于现状，想要自己创业。
          正官和食伤互为用神，正官可以代表是上班，食伤可以代表是创业，两者同柱，就分别在天干和地支，也代表自己容易想法矛盾，而八字正官虚透，以正官为主，食伤在地支可以代表内心想自主创业，同时地支之食伤你也可以发展为自己的副业。
          总之，你的八字喜用神力量强可以泄劫财，又有官合身，正官为主代表更适合上班，同时加上你早年走的又是财生官的运气，说明现在不适合创业的。想创业的话，等到走食伤运及30岁之后才有创业发展的机会，在2032年之后更合适些。从给你的八字大运发展来看，事业格局层次还不错，未来财运也会比较平稳。
          婚姻分析：你的八字婚姻宫为丑土偏印，同时偏印在时干透出，说明你的感情会有些敏感，且会有些多疑，而正官来合你，同时八字生合多，也说明你是比较重情义的，把感情看比较重，同时对感情会有些浪漫主义，完美注意。但是地支食神和伤官分别在年支和时支包局，说明你在感情中会有些自我，对对象要求高，
          喜欢让对象按照自己方式来做，对感情发展会不利。同时婚姻宫丑土为湿土，地支水旺，丑土被旺水浸泡，而婚姻宫代表是配偶的所在地，代表婚姻宫的环境不太好，丈夫在婚姻宫中会有些难受，不舒服。
          同时你八字两个正官，年柱丙子与日柱天合地合，说明你现在非常喜欢这个对象，但地支亥子丑三会食伤局，对你的婚姻是不利的，有克婚姻克夫的信息，尤其是40岁走壬辰大运的时候，这个问题会更加明显。
          而月柱是另一个正官星，比年上正官星距离会更近些，而年上的这个对象是可盼不可及的，或者说走到一起也不会长久。而月柱正官星与日主相合，对你来说很容易是二次婚姻。地支申金为劫财，说明对方会是离过婚有的几率很大，同时要注意对象被其他女人抢走，或发生暧昧关系。整体来说你的八字婚姻不太平顺，且有二婚的信息。
          大运分析：20岁-29岁走的是甲午大运，大运天干正财本生正官星主吉，代表你是比较积极努力上进的，且有比较强的事业心上进心，尤其是职场方面会更适合你。但大运天干甲己贪合印星，两两相碍对八字事业发展是不利的，且财合印，自己会有些想法计划，总想做些投资创业的事情。
          但是地支子午水火相冲，午火本身是时干己土的禄增加了印星的力量，代表你有时候容易想法太理想化，不够务实，考虑的不够周到，创业也达不到目标，反而容易破财，属于辛苦求财，财来财去不稳定运气，踏实上班做事更好些。
          30岁-39岁走的是癸巳大运，八字大运食神从年支中透出，代表个人也会有些新的想法，且不安分，想创业做生意的想法会更强烈，有好的项目话可以去尝试去做下。而地支巳火为官星，官星巳申合支劫财，对你整体事业财运是有帮助的，
          所以这个大运会有发展提升，但是大运地支与八字也带冲，又是伤官见官的组合，要注意下口角是非方面，自己创业的话经济纠纷方面也是要注意的，凡事要谨慎些。
          后面的壬辰大运，大运地支申子辰三合食伤局，伤官透出与八字形成伤官克官的组合，对你来说会有一定的提升，但也非常容易闹是非，官非及经济纠纷的问题，凡事应三思而后行，不能急于求成，存侥幸心理。
          辛卯大运和庚辰大运，分别为比劫大运，八字透两个正官可以制比劫为吉，而地支食伤生财，对你的财运也是有帮助的，同时不要太轻信他人，以免发生破耗或受骗上当的情况发生。晚年运气总体还算平稳。
          你的八字食伤及偏印的组合，所以会有些想法奇特，甚至古怪，但不至于不正常。命理方面，民间有很多技术高超的能人，但很多情况下，他们对命运的预测传达，更多是讲结果，而不会告诉你过程，很容易让人对命运有种困惑，迷惘，甚至恐惧，惶惶不安，给自己带来了一些不必要的烦恼。
          命运其实都是不完美的，算命预测是了解自己的一个过程，从本质去发现自己的问题，需要改进的地方，让自己更好，比如提到你会离婚，这只是一个结果，和你的感情相处的过程，脾气有很大关系，不存在有人压住了你们的八字。
          整体而言你的婚姻组合不太理想，但事业格局不差，但是不代表就可以马上去创业，现在社会物质追求重，许多人容易急于求成，而不会认真考察自己各方面条件是否成熟，所以创业失败导致影响生活的也很多，创业是水到渠成的事情，不是小孩子要玩具，闹情绪就能得到，而是你的领域里踏实去做，各方面的条件都成熟了，是自然发生的事情。
          你的八字正官虚透在年月，而地支食伤旺，中年后走的又是食伤大运。所以你的八字非常适合先在职场发展，后面再自己创业做生意。但食伤运时在组合不太完美，所以要注意下是非口角，经济纠纷方面，不要铤而走险，投机取巧，尤其是合同经济利益纠纷要特别注意。后面的大运也还算是平稳，整体也会比较的富足无忧。
          `
  }]
}

export default {
  亥时
}