const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1985年十一月十三日酉时'
  }],
  十神: '枭神   伤官   日元   食神',
  天干: '乙(木) 戊(土) 丁(火) 己(土)',
  地支: '丑(土) 子(水) 酉(金) 酉(金)',
  遁藏: '食神   七杀   偏财   偏财',
  大运: '己丑，庚寅，辛卯，壬辰，癸巳，甲午，乙未，丙申，6岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/415.html',
    命主甲: `我和老公是高中同学，高中的时候他追我，我不喜欢他没有在一起，大学毕业以后才又在一起。这中间我只考上了二本，而他高中没有毕业就辍学了，跟着家里做生意。他做生意不太会去开拓业务，但是业务来了还是会努力去做。
          谈了近10年恋爱后2016年我们结婚了。2017年，我怀孕了，他却迷上了网络赌博，家里包括我欠了很多债。3年多了，这两年没有赌了。他现在每天就在家，除了煮一餐晚饭就是打游戏、刷抖音，讲也不能讲。
          我在体制内工作，每个月的工资也不高，每个月要还债养家，根本就不够，每个月到了月底就很焦虑不安，经常一个人晚上失眠到深夜。
          我意志力强，个性要强，做事能吃苦，扎实肯干，但是不懂得变通，不懂得拒绝，工作也不顺利。
          `,
    珠玑: `八字分析：丁火生于子月，为七杀格，女命七杀格配置不好往往都是婚姻不顺。你八字子丑合，丑土可以克制子水，但丑土同时也要去生偏财酉金，这就是命理界常讲的“贪生忘克”。
          而且，丑土上面乙木为偏印，偏印虽然虚浮，但遇到一些岁运仍然有夺食之嫌。如此，命局财杀两旺，丁火虽长生于酉，却无处托身，全靠一个受伤的食神抵抗重重压力。
          事业分析：丁火生在子月如灯烛之火，年干有乙木生之如燃油灯芯，有默默无闻付出的现象，为人比较务实踏实，亲力亲为，独立要强。年干乙木枭神制月干的戊土伤官，代表自己有约束力，是有原则的一个人。
          而地支酉金财星旺，财星生子水七杀忌神，食神虚透，也代表做事容易困难阻碍多，且遇到困难的时候容易心烦意乱，不满等情绪而影响到个人状态。
          丁火日主不得令，而乙木偏印得令，克制伤官，印星稍旺，也代表自己是比较踏实努力的，在求财过程中会比较辛苦忙碌付出多。
          日主坐偏财，时柱食神生财，泄耗日主力量强，代表自己付出多，容易因为事业钱财而劳心劳累，八字财生七杀，且自刑，代表财星没有起到好的作用，容易为钱财烦恼。
          八字中喜用神少，忌神多而旺，又在月令了力量强，求财会有些被动无奈。
          从你的八字来看贵人的话，以年日找贵人，贵人星为子鼠和酉鸡，表面看起来好像是带贵人，但子鼠和酉鸡，两者都是忌神，且酉金和子水相生，所以是假贵人而已，没有什么贵人帮助，八字原局层次不高。
          结合大运走势看，后面一路走官杀大运，晚年才开始走印比大运，早年发展会缓慢辛苦一些，好的运气在晚年，整体属于普通偏上。
          婚姻分析：酉金为婚姻宫，婚姻宫和时支自刑，婚姻感情是不和谐稳定的，月令为七杀，代表丈夫，婚姻宫又财生七杀克身，七杀为忌可以代表压力，忧患，忧虑等，也可以说婚姻给你的幸福感不高，烦恼忧愁比快乐更多。
          七杀也可以代表是你的丈夫，七杀为忌克身，也代表丈夫对你帮助不大， 七杀也是偏缘，说明命里丈夫容易有脾气不是很好，不良嗜好的问题。
          婚姻宫酉金财星生月支子水七杀，婚姻容易因为钱财带来困扰，加上八字食伤多现，也会对丈夫的问题不满，说话直接，挑剔毛病而导致婚姻矛盾多，不和谐。
          你目前走的是正官坐伤官的大运，同时与八字容易伤官见官，此大运对你婚姻是不利的，容易有婚姻危机发生，特别是2022年，2023年时容易有婚姻危机。
          子女分析：八字以食伤代表女命的子女，子女星在月干和时干，以子女宫的子女星为主，子女星落正位为吉，但子女星被泄，所以力量不太旺，
          同时印星得令，容易对子女有些操心，而日干与印星，子女星流通，所以整体的子女运还算可以，晚年走的又是好运，晚年有子女的福分可享。
          健康分析：八字丁火失令，且土金泄耗日主，八字日主弱，地支金水相生，金水旺而土被泄而虚，同时木克土，所以八字中五行水最旺，而土最弱，健康主要注意眼睛视力，心脏，肠胃炎，皮肤病，女性相关疾病的问题，
          注意2021年，2023年，2028年，2032年，2040年及2047年及2051年，2059年和2062年。
          大运分析：36岁-45岁走的是壬辰大运，此大运正官加伤官，这种正官坐伤官的大运组合，对你的事业和婚姻都是不利的，事业上注意因为言语不得体而与人发生口角矛盾，不受待见，大运与八字天干官印相生，地支伤官生财，财生七杀，压力也是很大的，需要付出更多努力。婚姻对丈夫的不满会更大，容易有婚姻危机闹离婚的信息。
          46岁-55岁走的是癸巳大运，此大运为七杀加劫财大运，大运天干戊癸合，印星直接生日主，对你事业求财有帮助，但也是比较辛苦忙碌才有进步和收获。
          地支巳火本为劫财是帮扶日主的，但劫财巳酉丑贪合，所以财旺，代表求求财会更辛苦些，个别年份比如木火流年运势还是可以的。此大运食伤制七杀，容易有异性桃花运，但大运七杀坐劫财，所以多是烂桃花，也容易遇到有家室或者一脚踏两船的男人。
          56岁后分别走甲午大运，和乙未大运，属于木火生助日主的运气组合，晚年才有相对平稳，晚年运势是较为安逸的，也会比较清静安稳。感情虽然也有好转，但印重容易情绪烦躁。
          你的八字原局一般，加上早年走的大运不太好，早年提升缓慢，多要靠自己努力调整，努力付出能够有收获，但晚年走的运气还可以，子女运也不错，能够子女福分。
          而婚姻组合则不太好，丈夫帮不到你，婚姻生活更多容易给你压力，忧愁多过快乐，虽然你的婚姻不是很好，但结合你本身的感情组合，以及走的感情运来看，如果离婚再婚也不是很好，并不是好的选择，建议是先处理好现在的婚姻再说。
          你的八字七杀旺，食伤多现，会忍不住的也容易说话直接，挑剔，只是这种时候数落没有什么意义，只会更心烦意燥。夫妻就好像一条船上的人，越是困难，越应该互相理解，互相支持，遇到问题多想办法去面对，互相鼓励，克服困难，一步一个脚印去解决遇到的问题。
          `
  }]
}

export default {
  酉时
}