const 巳时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1985年十一月十五日巳时'
  }],
  十神: '七杀   劫财   日元   比肩',
  天干: '乙(木) 戊(土) 己(土) 己(土)',
  地支: '丑(土) 子(水) 亥(水) 巳(火)',
  遁藏: '比肩   偏财   正财   正印',
  大运: '己丑，庚寅，辛卯，壬辰，癸巳，甲午，乙未，丙申，5岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/458.html',
    命主甲: `目前是上有老下有小的年纪，在一个岗位上从毕业就稳定工作已经11年了，刚毕业时太放松了，现在有些焦虑，虽然很喜欢目前的工作，也想成长，精力又有限，努力一定会有结果吗，不努力又担心会被淘汰；
          人到中年，和爱人也是经常各种拌嘴，经常互相看不惯。人家说我晚婚有利，可能是早婚的缘故吧；年纪越大，越感慨父母的养育之恩，想尽可能的多陪伴陪伴他们。
          `,
    珠玑: `八字分析：己土日主生于子月，天干不透癸水，仍取为偏财格。天干戊土透出盖头，为劫财合财的象，地支丑土也合子水，朋友合伙取财，但也会分走很大部分利益，自己有点吃力不讨好。
          日主坐亥水为正财正官，生的日子不错，这里的财需要正官来护卫，也需要正印来旺身担财。已亥冲亥水冲了已火，用神有损，而且冲动夫宫，容易导致婚姻不稳定。
          事业分析：命局比劫多透，为人算是较为重情义的，也较容易相信人，同时有比劫抗七杀，也代表自己能吃苦，比较有耐心的一个人，在求财中也能够得到他人帮助，人际关系不会差。
          命局比劫消耗财星，同时有子水亥水，水是比较旺的，日支亥水冲时支的巳火印星，为财冲印的组合，在事业上容易有不满，计较。命局财星旺，比劫多，说明自己对事业有追求和目标，不太满足当下的状况。
          但命局整体偏弱，年柱乙木七杀得生助力量强，决断力不够，容易优柔寡断，犹豫不决，底气自信不足。
          月令和日支都为财星，说明命局中财星是比较旺的，地支丑土，三会不化，为水土相混的组合，如泥潭，削弱了比劫，也虚弱了财星，事业容易陷入泥潭，虽然稳定，但容易停滞不前，没有太大的发展。水土相混，印弱逢冲，也代表为人不太聪明，不是太灵活。
          天干戊己土比劫帮扶日主对抗七杀，事业上能够获得他人帮助，但事业上也会遇到压力阻碍多，小人干扰等。
          加上地支巳亥为驿马，财冲印，容易有些过失破财发生，要注意理财，而印星逢冲，如果没有官杀或比劫在地支制财的话，就很容易导致工作不稳定。
          结合大运走势来看，地支走东方，南方地支大运对你事业有些帮助，整体大运走的不算太好，有进步收获，但也容易不稳定。特别是癸巳大运财克印，地支驿马相冲，马星填实的时候，容易不稳定，且晚年地支大运逢冲，整体格局层次较一般，踏实的工作做事比较好。
          地支财旺与印相冲克的组合，属于一种工作不稳定的信息，自己要多用心努力，做好本职工作的同时，也要多提升自己，也可以学习些技术技能充实自己为好。
          另外财冲印，也要注意人际关系，提防一些不怀好意的人，影响到你的名声名誉，工作上避免给人抓住把柄影响个人事业发展。
          婚姻分析：亥水为婚姻宫，七杀在年干得水生，地支亥子丑三会不化，婚姻宫与年支丑土比肩拌住，虽绊住但地支水力量强，所以也会冲时支，所以婚姻宫不太平稳，争吵矛盾是难免的，而另一半也不喜欢被管束太多。日支亥水与时支巳火相冲，也代表自己会对另一半不满和计较。
          年干乙木七杀旺容易早婚，婚姻宫暗藏甲木正官，另一半与自己内心想的理想对象有些出入，不太满意不太喜欢，慢慢滋生问题矛盾。
          命局年支，月令，时干，都是比劫，婚姻中发生争吵及各种不爽的时候，婚姻容易被其他女人干扰介入，容易因为其他女人而容易导致婚姻不稳定，平常注意沟通，多些相互理解宽容迁就为好。
          结合大运来看，在壬辰大运，乙巳年时天干七杀力量增加，财生七杀克比劫，同时婚姻宫逢冲的时候，容易有婚姻危机。其次在癸巳大运，辛亥年时，大运流年巳亥冲，引动命局巳亥冲，也容易出现婚姻危机。
          六亲分析：己土日主，命局以偏财为父，印星为木，命局中财星当令且三会虽然不化，但力量还是强劲的，同时月干戊土盖头但被乙木克，父亲健康没太大问题。
          命局以印为母，地支巳火有被冲之像，特别是旺水冲弱火，当地支火的力量加强冲性也会更强，所以命里有不利母的信息。
          特别是壬辰大运，壬水财星透出，在戊申年时，土金相生，地支申子辰三合财冲印时，要注意母亲健康，另外在2031年辛亥年与大运巳火相冲，引动命局财印相冲时，母亲健康也要多注意。
          大运分析：35岁-44岁走的是壬辰大运，此大运天干财生年干七杀力量大，且克比劫不吉，压力会大些，而地支辰土增强地支增加比劫力量帮扶日主且克制财星，所以也有些帮助，代表付出努力也会有相应的收获，劳动成果来之不易，开支花销也比较多。而地支天干财生七杀克比劫，地支劫财，所以会有些分歧争吵矛盾发生，防其他女人干扰插足你的婚姻，少些抱怨计较，彼此多体谅为好。
          45岁-54岁走的是癸巳大运，此大运财克印，大运组合不是太好，同时天干戊癸合，戊缝合，七杀可以直接克日主，所以压力阻碍会更大，地支巳亥冲，财冲印，也很容易有支出破耗发生，同时也容易工作不稳定，特别是财旺的年份，容易时好时坏不是太平稳。而七杀克日主，地支婚姻宫逢冲被引动，所以也很容易夫妻感情矛盾加深，导致婚姻不稳定。
          甲午大运，官印相生，对你运势还是有帮助的，只是大运天干甲己合不化，地支子午冲，所以比肩被合住，同时地支财冲印，也容易有些不稳定及压力，容易财来财去，且午火为日禄逢冲，也难免有些辛苦忙碌，付出多些。
          你八字财星旺而身弱，七杀克劫财，地支比肩混财，命局财星来冲印星，难以掌控大的事情及钱财，所以要求稳发展寻求平稳即可。
          财冲印也很容易有些危及到工作不稳定的信息，平时尽心尽责做好自己的本职工作，也要提升下自己个人的各方面综合竞争力，才能在工作中寻求的更稳定的一席之地。
          结合大运走势方面看，大运组合上不算太好，好的运势走的不是太连贯，一时好，一时不稳定，整体格局层次属于普通大众水平。
          `
  }]
}

export default {
  巳时
}