const 申时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '食神   正官   日元   正印',
  天干: '乙(木) 戊(土) 癸(水) 庚(金)',
  地支: '丑(土) 子(水) 未(土) 申(金)',
  遁藏: '七杀   比肩   七杀   正印',
  大运: '己丑，庚寅，辛卯，壬辰，癸巳，甲午，乙未，丙申，丁酉，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3317.html',
    命主甲: `我从2020年12月开始做期货，到今年亏了一百多万，我有部分的钱是借的，所以钱快到期，我很焦虑。这一年多我有赚钱的时候，但是因为贪念没有落袋为安转为亏损，也有直接亏损的。
          我的主业工作蒸蒸日上，但是这些借来的钱家人并不知情，而且还有家庭负担，本来想借此缓解家庭压力，没想到雪上加霜，有点心态崩溃。还好我天生嘻嘻哈哈，性格男孩子，所以没有抑郁，但是非常焦虑，平时还要装作没事。老公最近失业，不敢刺激他。
          我现在不知道该怎么办，也很焦虑，也不敢给别人说，只能自己着急。
          `,
    珠玑: `八字分析：癸水日主生在子月，为禄神格，但子水被丑合，申半合，未害，就有点不得安宁了。日坐七杀，时柱正印，杀印相生，晚运不错。
          事业分析：八字子水比肩当令较旺，人际关系较好，懂得如何与人相处打交道。加上八字乙庚相合，戊癸相合，子丑相合，申子半合，一般而言，但凡六合超过三个以上，均表示人际关系不差。但是女命合多，一般对感情不是件好事。
          八字见丑土和未土七杀，又见戊土正官，官杀无去留，为官杀混杂的组合，且癸水日主被戊土正官和未土七杀包身，代表内心不太安分的一个人，想法较多，不太踏实。加上子水比肩当令，投机心理较重，在求财上容易有走捷径的心理，想要一步到位，缺乏踏实，这个心理是要克服的。
          子水为癸水日主的禄神，地支子未相害，子水有损，代表钱财难聚，花销较大，未土暗藏丁火偏财，被子水所制，有比肩夺财之象，这种组合均表示不适合去做一些高风险投机的事情，比如炒股、期货、赌博等，很容易破财，甚至负债，故要及时收手，否则越陷越深。
          加上你现在走的是辛卯大运，地支卯木被天干辛金盖头，为枭神夺食的大运，天干辛金来制乙木，也为枭神夺食，加上地支子卯相刑，卯木食神受损，子水禄神也受损，故钱财难聚，很容易破财漏财，容易遭遇是非，踏实求稳为好。
          2020庚子年，天干两个庚金争合乙木食神，也有夺财之象，地支子水引动八字子未相害，子水禄神和未土暗藏丁火偏财受损，财运不济。2021辛丑年，太岁和大运天干两个辛金枭神来制乙木，枭神夺食，这两年投资负债的几率非常大。
          结合后面的有来看，后年转壬辰大运，天干壬水劫财高透，地支申子辰三合化水，旺了比劫，投机心理还是比较重，要尽力克服，切不可再碰期货，很容易有更大负债，安心上班为好。
          之后是癸巳大运，比肩制财，财运依然一般，但好在巳申相合，巳火财星被合入门户，财运有一定起色，印星合财，但多为工资财的增补。到了甲午大运，伤官生财，财运会有一定提升，不过已到中晚年，心有余而力不足，想偿还债务能多方寻求帮助为好。
          八字不见财星，只有日支未土暗藏丁火偏财，但子未相害，被子水所制，年干乙木食神透出，可看作财，乙庚遥合，庚金印星来合食神，可以得到这个财，八字戊癸相合，正官合身，代表适合安安稳稳上班求财为好。
          乙庚遥合，印星来合食神，也可依靠单位、证书、资质、权力等来求财，在工作之余可考虑提升学历，考取证书，提升技能等，可以改善经济状况，而且八字官杀混杂，也可以在主业稳定之后发展副业。
          大运分析：30岁-39岁走的是辛卯大运，此大运地支卯木被天干辛金盖头，为枭神夺食的大运，天干辛金来制乙木，也为枭神夺食，地支子卯相刑，子水和卯木受损，此大运财运不济，易破财漏财，遭遇是非，好在这步大运马上过了，但还是要及时收手为好。
          40岁-49岁走的是壬辰大运，此大运天干壬水被地支辰土截脚，天干壬水劫财高透，地支申子辰三合化水，比劫较旺，一方面事业上竞争较大，易遭遇小人，另一方面，财运不济，求财辛苦，一分耕耘一分收获，收获较为有限，开支花销也比较多，切忌求稳，不要去搞高风险投机的事情，很容易再负债。
          50岁-59岁走的是癸巳大运，此大运地支巳火被天干癸水盖头，为比肩制财的大运，故一样不可轻易投资炒股等，钱财上花销较大，很难聚财。但好在地支巳申相合，申金印星来合财，且财入门户，印星得制，有升职机会，巳火为正财，工资也会涨一些，也可依靠资质、证书、职位来提升财富，若有投资的想法，可考虑投资一些优质的固定资产，有望留住财。
          `
  }]
}

export default {
  申时
}