const 未时 = {
  公历: [{
    甲: '1997-10-08 13:30:00'
  }],
  农历: [{
    甲: '1997年九月初七未时'
  }],
  十神: '偏财   七杀   日元   七杀',
  天干: '丁(火) 己(土) 癸(水) 己(土)',
  地支: '丑(土) 酉(金) 未(土) 未(土)',
  遁藏: '七杀   枭神   七杀   七杀',
  大运: '戊申，丁未，丙午，乙巳，甲辰，癸卯，壬寅，辛丑，11岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/537.html',
    命主甲: `自身情况：1.家庭：我自小跟着爷爷奶奶长大，同父母关系不太亲密。大学毕业后就离家工作了，基本一年回不了几次家。
          2.感情：我有一位在一起六年的女友。明年打算结婚，但之前有找师傅算过，都会提醒我注意桃花，在婚姻中把持住外面的诱惑，注意中年婚姻危机。
          3.事业：2019年大学毕业后，我与一家公司签订五年工作协议，若离职将赔付公司高额违约金。
          公司先派我去泰国工作半年，北京一年，2021才有机会申请调回女友的居住地工作，结束异地恋。在这两年的时间里，我被调换无数次工作岗位，非常的被动不稳定。只因与公司签定协议，不敢贸然离职。
          `,
    珠玑: `八字分析：癸水生于酉月，为偏印格，两未一丑七杀很旺，全靠偏印化杀，但丑土七杀能化，未中的七杀却未必好化。
          事业分析：癸水日主左右己土七杀，年日时支是丑土为七杀，七杀多且旺，虽然有月令酉金通关，但势单力薄，化杀力量不够，为人会容烦恼忧愁多，自己给自己压力大，负能量重，心里想的烦恼较多，也容易导致脾气不太好，特别是对熟悉的人，也容易情绪紧张，做事缺乏魄力，八字身弱七杀旺，也很容易遭遇小人，人际关系一般，有时候处理不太好。
          八字七杀较旺为忌神，性格容易急躁冲动，同时月令酉金为枭神，会有些偏激，也容易做出不太好的事情，在修心修德上要加强。癸未日出生，日坐未土七杀星，地支丑未相冲，七杀互冲，也代表心性不稳，做事会有些三心二意，虎头蛇尾，顾虑重重而导致错失做事的最好机会。
          八字以七杀代表你的事业，身弱七杀多且旺，同时地支两个未土和年支丑土七杀相冲，也代表工作不稳定，变动较多，有协议束缚反而是好事，虽然工作频繁调动，但都是在公司内部，不然工作会三天热度，频繁多变，身心俱疲。也是比较奔波劳累，四处辗转的信息。年支和日支相冲，且地支海底冲，丁火偏财在年柱，为远方之财，为外出发展之命，方位选择北面，西面，西北面比较旺你。
          一般来说比劫旺的人身累，而官杀旺的人心累，你八字七杀攻身，不见食伤来制杀，也不见羊刃来驾杀，虽然有酉金偏印来化杀，但化杀力量不够，而且偏印化七杀，化的会有些不情愿，偏印本身也容易偏激，敏感，所以内心是容易多忧少乐，不开心的。而年干丁火偏财去滋杀，追名逐利的欲望较重，容易为名利所累。
          婚姻分析：八字不见正财，年干丁火为偏财，以丁火代表妻子，妻在年柱，一般代表妻子距离自己远，外地人，丁火是从日支和时支未土中透出来的，妻入门户，可以得到这个妻。
          八字不见食伤来生财，对另一半关心体贴不够，婚姻宫为未土七杀星忌神，且伏吟时柱，日坐七杀抱虎眠，妻子会比较强势，脾气不太好，婚后比较怕老婆，婚姻会给自己带来很大压力，夫妻之间也容易发生纠纷矛盾，婚姻幸福感不强。
          地支三个华盖，七杀较旺，同时月支酉金偏印，内心会有些孤独，甚至有暴力倾向，这些是要引起注意的。地支丑未相冲，婚姻宫逢冲，婚姻不太稳定，比较动荡波折，夫妻时常分开。未土日时伏吟，日时为中晚年，未土暗藏丁火偏财，和丑土相冲，有二婚之象。
          大运分析：21岁-30岁走的是丁未大运，为财杀相生的大运，身弱不担财杀，会为财杀所累，在工作上尽量求稳，能不变动最好，在现在的单位稳定求财为上。地支未土引动原局丑未相冲，七杀逢冲，心性不稳，三心二意，工作容易变动，也非常奔波，要克制有始无终的念头，在感情上也容易变动，双方聚少离多，容易发生矛盾争吵，要多注意。
          31岁-40岁走的是丙午大运，此大运干支一气为财运，正偏财混杂，同时地支午火为桃花，午未相合，合动婚姻宫，要注意婚外桃花，有出轨之象，要注意处理好和异性之间关系。身弱财杀旺不担财，求财会比较辛苦忙碌，财来财去，不宜创业，能上班求财最好。
          41岁-50岁走的是乙巳大运，此大运为食神生财的大运，天干乙木去制己土七杀星为吉，事业上有升职的机会，有望到达管理层，要好好把握，巳酉丑三合，酉金印星被制，身弱财旺，求会比较忙碌辛苦，付出多，稳定求财为上策，也要注意肺部疾病。
          甲辰大运，为伤官克官的大运，大运与命局甲己合化，地支辰土，增强了官杀的力量，故而事业方面压力大，注意提防小人干扰，同时容易花销多，容易存不住钱，容易对工作不满，要注意口舌是非之事。
          癸卯大运，癸水帮身，地支卯未合不化，食神合住七杀，对事业财运发展有利些，喜用神无伤，事业财运一般偏好有收获，只是地支卯酉冲注意些过失失误发生。而地支卯酉相冲，印星逢冲，印星为寿元星，要注意身体健康。
          你的八字结合大运来看，适合在大公司求稳发展比较有利。不管做什么事，最忌讳就是三心二意，缺乏恒心，不但事情不能做好，也耽误自己的时间精力，人生短暂如白驹过隙，切莫蹉跎了岁月，老来回首一场空。
          `
  }]
}

export default {
  未时
}