const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1991年七月二十七日亥时'
  }],
  十神: '伤官   枭神   日元   正财',
  天干: '辛(金) 丙(火) 戊(土) 癸(水)',
  地支: '未(土) 申(金) 寅(木) 亥(水)',
  遁藏: '劫财   食神   七杀   偏财',
  大运: '丁酉，戊戌，己亥，庚子，辛丑，壬寅，癸卯，甲辰，乙巳，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/511.html',
    命主甲: `我在之前吃够了感情的苦，其他的事情也是不顺，事业也稳定不了，有什么好事，都是德不配位的感觉，留不住财，这两年过的一塌糊涂，还欠了一些外债。
          我之前谈了很多年的恋爱最后被劈腿抛弃，好不容易结婚了，结婚时也差不多26岁，算晚婚了。刚开始前夫对我很好，当初追我是我爸爸觉得不错，我也就接受了他。
          可是慢慢结婚3年在去年还是被离婚，离婚后又和前夫在一起好了将近一年，可是他找到其他女人又把我抛弃，他后来回头找我，可是没几天还是又找了其他女人去了。我感觉我总是被抛弃，被劈腿。
          `,
    珠玑: `八字分析：戊土生于申月，为食神格，食神之人一般性格较为恬静。天干丙辛合，戊癸合，地支寅亥合，看起来人缘不错。食神格却透出辛金伤官，于女命不利，食伤旺而生财，自身又合财，对于钱财有强烈的欲望。夫宫为七杀偏印，合冲并现，婚姻处于不稳定状态。
          事业分析：食伤旺、财旺、七杀也旺，印弱，这个财就得不了，纵然得到也是辛苦求财。
          月令申金得未土生扶较旺，申金为食神，是比较乐于付出的一个人，但申金食神被月干丙火盖头，有枭神夺食的象，思维不灵活，比较懒散多虑，有时候急躁冲动，情绪波动较大，容易胡思乱想，做事容易犹豫不决，想的多，做的少，执行力差。
          年支未土劫财去生了申金食神，比较有事业心的一个人，但是也比较不知足，不容易满足，劫财生食神组合的人一般也比较喜欢自由，不喜欢被人管，也不太服管，也因此容易在工作中，和同事领导关系不太好，工作变动较多，心性不稳。
          月令申金食神去制寅木七杀，为食神制杀的组合，七杀代表事业和小人等，七杀被降服，代表事业上可以取得一定发展，获得一定名气和影响。八字食神旺财旺，可以去做金融财会，咨询销售相关工的作。八字以火土为用，从事文化教育，互联网方面工作也较为适合。
          地支寅申相冲，申金驿马星逢冲，日支逢冲，为外出求财之象，也适合奔波求财，动中求财，办公室工作不适合你，出生地南方，东北方，西南方比较旺你。年支未土为官杀库，官杀库在年，也表示要外出找工作为宜。
          时柱癸亥干支一气为财星，且和命局日柱天合地合，有食伤生助，财星不弱，财星合身但身弱不担财，则容易因为钱财而烦恼，压力很大，求财辛苦，收获较少。只有大运助身，才有机会财运变好。
          婚姻分析：八字丙辛相合，戊癸相合，寅亥相合，八字合多则异性缘分不差，但女命合多则对婚姻不太有利。申金食神较旺，比较感性，喜欢新鲜浪漫，较为早熟，很容易早恋，遇到事情易于失去理智，在感情上受到诱惑，被欺骗和伤害。
          八字丙辛相合，戊癸相合，寅亥相合，八字合多则异性缘分不差，但女命合多则对婚姻不太有利。申金食神较旺，比较感性，喜欢新鲜浪漫，较为早熟，很容易早恋，遇到事情易于失去理智，在感情上受到诱惑，被欺骗和伤害。
          年支未土劫财临华盖，有丈夫被夺之象。八字不见正官，以寅木七杀为夫，七杀被申金食神所制，且乙木正官入墓，未来丈夫能力一般，倔强自我，个性急躁，对你帮助不大，夫妻感情不好，丈夫个子不高，长相一般，家庭条件不好，多从事自由行业。
          寅木七杀为忌神，婚姻压力较大，很容易遭遇不好的男人，遇到渣男，在择偶上要多方考量对方的人品和素质，加上你性格的特点，防止被欺骗和伤害。
          你八字正官乙木暗藏于年支未土之中，为夫星入墓，要大运流年冲开墓库，才可以得到这个夫，今年辛丑年，地支丑未相冲，未土墓库被冲开，有机会遇到。2022壬寅年临天喜，有结婚的运气。
          大运分析：32岁-41岁走的是庚子大运，此大运为食神生财的大运，财星较旺，但身弱不担财，求财比较辛苦，操心较多，付出不少，但收获较少。地支子未相害，未土劫财受损，事业上比较孤立无援，难得他人相助，要自己多付出才可以。年支未土受损，要注意母亲身体健康。
          42岁-51岁走的是辛丑大运，此大运天干辛金伤官星透出，但被丙火合拌，心情较为郁闷，有点想不开，要注意心情调节，压力不要太大。地支丑土来助身，事业上贵人运不错，可以得到他人相助，大运助身可以担财，财运有起色，还清外债此大运可以。
          52岁-61岁走的是壬寅大运，此大运地支寅木引动原局寅申相冲，婚姻方面要多注意，很容易发生变动和矛盾争吵之事。此大运财星来滋养七杀，事业上很容易犯小人，压力较大，也要注意身体健康。
          癸卯大运，为财官相生的大运，身弱不担财官，则要注意身体健康。甲辰大运，地支辰土被天干甲木盖头，要注意脾胃方面疾病，但财星被收入辰土财库，晚年物质方面还可以。
          `
  }]
}

export default {
  亥时
}