const 辰时 = {
  公历: [{
    甲: '1995-04-05 07:10:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正印   伤官   日元   七杀',
  天干: '乙(木) 己(土) 丙(火) 壬(水)',
  地支: '亥(水) 卯(木) 寅(木) 辰(土)',
  遁藏: '七杀   正印   枭神   食神',
  大运: '庚辰，辛巳，壬午，癸未，甲申，乙酉，丙戌，丁亥，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/401.html',
    命主甲: `今年刚好本科毕业，学医的，其实没想过会走上学医的路，家人的安排，一开始是排斥的，现在希望自己既然做一件事就要做好。然而19年正值考研，却因为感情的事情弄的自己什么也没有做好。考研没有考好，和另一半也分手了却一直藕断丝连。
          现在选了一家小县医院，想继续考研到心仪的城市过自己想要的生活，却总感觉自己不在状态。心里好难受，总觉得自己在浑浑噩噩的。
          `,
    珠玑: `八字分析：丙火生于卯月，年干透出乙木，为正印格。亥卯合、寅亥合，为杀印相生。寅卯辰三会东方木，水木的力量很强，但卯木遇辰土逢穿，正印穿坏了，等于正印格坏了，层次自然降低了。但天干伤官配印，杀印相生组合都是不错的组合，所以还是有一定的事业。
          事业分析：你的八字己土伤官和壬水七杀虚透，一泄一克，且七杀，伤官为偏星，也主刀枪武职，也有医药的信息，所以你往医药医生发展是可以的。
          而八字印克制伤官，时上七杀一位贵人且为喜用神，同时七杀强根在年支，又组成杀印相生，对你整体事业格局组合是有帮助的。
          只是你八字中的五行木为印星，太旺了，克制了食伤，食伤代表是才华，发挥，心情等，也代表你个人的能力才华难以得到比较好的发挥，心情也相对较差，有时候会觉得找不到方向之感。
          八字原局食伤喜用被制，七杀被旺印泄气太过，导致你的八字原局格局层次不高，有时会感到较为憋屈无奈。
          但结合你大运走势来看，一路走正偏财，官杀的天干运气，对你事业财运还是有些帮助的，不过41岁后大运组合走的不是太好，所以整体命运层次不算太高，属于小康左右的级别水平。
          学业分析：你八字食伤为喜用，但是印星旺限制了食伤泄秀的力量，七杀虽贴身克制日主，但也被旺印泄掉了力量，这是导致你学业运不理想的原因。
          你目前走的是壬午大运，杀印相生，地支劫财旺，整体对学业考研运势是不利的，很难考上。2020庚子年为财生官的运气，与大运金水相生，地支子午冲，代表财被七杀泄不克印，且太岁乙庚贪合，最终还是忌神旺的运气组合，所以今年考研考不上。
          明年2021年财星透出，伤官星在地支得强根，又得劫财生助的时候，考试运相对好点，一定要考的话可以明年去争取下。
          婚姻分析：丙寅日柱，寅木为婚姻宫，地支寅卯辰三会木局，地支杀印相生，代表你的八字地支及婚姻宫都是印星，同时天干又是印克伤官的组合，印星旺为忌代表想法多，思虑多，容易有些胡思乱想，也代表缺乏安全感，疑心重，敏感，不利于婚姻的和谐稳定。
          而八字印旺，而印代表父母长辈，也代表自己的事情生活感情等，容易受到父母长辈的左右，也容易听父母长辈的意见。印星旺为忌在古代是会听从父母安排自己婚姻的，也容易与自己的婚姻观及内心的想法有冲突。
          你的寅木婚姻宫为忌神，且八字见七杀透出，而正官不显被三合化木，说明你的生活环境中不容易遇到各方面满意的对象，容易意遇到烂桃花，且另一半与你的感情缘分不是太深，对你的帮助不大或相处的不太理想。而八字印星过旺，是泄官杀力量的，官杀代表你的丈夫，官杀太弱，也是不利感情婚姻。你要在克印或者增强八字官杀的力量的情况下，才会有结婚的运气。
          大运分析：21岁-30岁走的是壬午大运，大运七杀加劫财大运，七杀力量增加些，对你的事业有些帮助，同时地支寅午半合火，泄掉印星 ，破坏八字寅卯辰三会的组合，地支火旺去生辰土食神，对你整体来说也是好的信息，所以此大运还会有些发展提升的机会，但开始会比较的辛苦，忙碌吃力，你要注意调整心态，顶住压力。
          31岁-40岁走的是癸未大运，大运正官加伤官运，大运官星虚透，官杀混杂而不惧，也属于用神的力量组合。而地支伤官使得月干得强根，但是地支亥卯未三合印局，伤官被克制，所以此大运对你来说属于有利有弊的组合。可以获得别人的帮助，但也必须通过自己付出多些努力才有收获。而地支三合印局，所以有时也难免有些被动，烦闷，要注意调整心态，发泄负能量，不要自暴自弃。
          41岁后分别走的是甲申大运，和乙酉大运，分别为正偏印加这个偏财的运气组合。八字天干见印不吉，而地支属于财冲克印星的组合，印旺为忌，容易犯旺，且又是驿马，所以会比较忙碌，同时内心想的，瞎操心的也多，印旺被冲要注意理财，防止破财受骗上当情况。
          而丙戌大运为比肩加食伤运，地支食神被卯合，也是不太理想的，同时也代表自己会感到有些孤独，想法多杂，晚年运气一般。
          你的八字天干地支印星旺为忌，地支又三会木局，为印星局，对你个人的能力及发挥会有比较明显的现在和阻碍。虽然大运走势方面有官杀大运，对八字运势会有些帮助，但是后面的运势组合走的不是太理想，有利有弊，八字格局层次不太高，属于普通偏好的八字层次。
          `
  }]
}

export default {
  辰时
}