const 寅时 = {
  公历: [{
    甲: '1995-03-16 03:55:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正印   伤官   日元   偏财',
  天干: '乙(木) 己(土) 丙(火) 庚(金)',
  地支: '亥(水) 卯(木) 午(火) 寅(木)',
  遁藏: '七杀   正印   劫财   枭神',
  大运: '庚辰，辛巳，壬午，癸未，甲申，乙酉，丙戌，丁亥，8岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/441.html',
    命主甲: `我出生于一个父母感情很好的家庭中，从小在父母的爱护下长大，父亲军人出身 ，现在是护士，但是我不太喜欢这行业
          `,
    珠玑: `八字分析：丙火日主生于卯月，年干透乙，为正印格。亥卯一合，乍一看是杀印相生的大好格局。然而问题就出在日柱丙午，丙火坐午为阳刃，午亥合阳刃可以合杀，但卯午破坏了正印，于事业婚姻都是不利的。
          事业分析：你的八字印旺透出，地支逢阳刃，自己是个较为有主见，同时也较为固执，脾气比较大。食伤不旺被克，印重，财弱克不动印，也代表自己有时候不太懂得表达和表现出自己，也容易有些胡思乱想。
          月干的己土伤官被年干的乙木正印克，在很多时候及做事都不太令自己满意满足，也会容易有种闷闷不乐，抑郁不得志，不开心，情绪波动。
          己土伤官虚透，庚金财星虚透，虽然自己有理想追求和目标，但是食伤不旺，财不旺，个人能力一般，虽然自己有些上进心，但组合不太好，个人能力运势不太好，很多时候只是停留在想法，实现不了自己的目标，不得志发挥不出个人的能力，造成自己烦恼多。
          卯木印星当令且印星透出在年干，日主得令，印生比劫旺，木火相生，没有达到火多木焚，母亲身体健康方面好，只是财星弱且被克，而财星代表父亲，也暗示父亲有些不利父亲的信息，父亲身体健康会差些，特别是遇到木火旺的流年大运。
          七杀在年支，与年干，月令杀印相生，七杀被旺印化，对你的运势发展不好。
          月干己土伤官也被乙木印星克制，伤官为财源为用神，但无强根 ，被克也代表你求财能力有限，财运容易受阻，工作会也有不开心，憋屈的心里情绪。时干庚金偏财，在地支无强根，坐寅木，八字中的财星也是不太旺的，命里的财富能量有限。
          印旺生比劫旺，所以在工作方面不轻松，赚钱辛苦忙碌，付出多才有收获，也是工作上有时候会加班加点的信息。同时事业竞争压力大，注意预防些不怀好意的人，地支又半合比劫局，注意理财防止钱财的支出破耗，原八字格局层次不高。
          结合大运走势看，一路走天干开始走偏财，官杀及晚年印比大运，而早年大运地支走比劫，中晚年大运走食神运气大运组合上不太好，格局层次不高，属于一般大众层次，小康偏好水平。
          八字忌神旺且透出，己土伤官和庚金财星虽然透出在天干，但为虚透，在地支无根，又容易被克制，力量不强，七杀被印星化的太过，也没有正官，印重为忌，没有公务员的命，一定要往这方面发展也只是做一些基层或者事业单位人员，但难进入编制。不太适合往这方面发展。
          你八字印旺，而比劫旺逢阳刃，又带伤官，阳刃逢伤官，见旺印又逢天医星，故而更适合在医药卫生，护士相关发展。
          婚姻分析：婚姻宫为午火劫财，印星旺透出克伤官，年为亥水七杀被印星泄，八字财星弱，正官不显。整体婚姻组合不太好。
          印星旺为忌，代表婚姻烦恼多，婚姻宫位劫财忌神，劫财也可以代表其他女人，劫财入婚姻宫代表容易有点着女人插足。
          而八字以亥水七杀代表丈夫，但是亥水七杀被印星化的太过，都是泄耗夫星的力量，夫星弱，婚姻宫为忌神，也代表丈夫不那么让你满意，对你帮助不大，家里经济条件不调好。
          加上命犯桃花，劫财阳刃，又逢阴差阳错日又都是忌神，故而不利婚姻的信息会明显些，印星旺透出在年干上，感情容易受到长辈的干涉。
          你的婚姻要当八字夫星透出，且得财星生助的时候，有结婚的运气，但八字原局婚姻组合不太好，比较难达到自己各方面都满意的状态，可以找熟人朋友介绍，知根知底，避免烂桃花，在2023年正官坐下为婚姻宫的桃花位时，有定下的运气。
          大运分析：18岁-27岁走的是辛巳大运，此大运与年柱天克地冲，财克印，地支驿马相冲，导致八字印星比劫乱动，事业不稳定，工作忙碌疲劳疲惫，且地支印星生比劫，比劫旺为忌，对你求财不利，竞争大，没有大的发展收获。
          28岁-37岁走的是壬午大运，此大运七杀克劫财，虽然有些竞争压力，但八字财杀印相生流通，通过自己的努力会能够有发展收获，只是地支寅午半合比劫局，竞争还是存在的，同时要注意避免高风险投机的事情，以及损友给你出馊主意。
          另外七杀坐劫财，七杀透出逢财生，且流通，在个别年份有结婚运气，只是劫财在地支旺，竞争阻碍也多，要注意第三者干扰。
          癸未大运，与八字财官印相生，对你的事业有帮助，而地支亥卯未三合印局，印星旺，还是会比较辛苦忙碌的运气组合，发展提升幅度不大。
          甲申大运，天干甲己合，地支寅申冲，印星被冲起，印比相生流通且更旺些，虽然财星得更有些帮助，但也容易不稳定，运势也不是太好。
          乙酉大运，与月柱天克地冲，也是冲动印星，伤官被克制的运气组合，与上个大运大同小异，印星重也容易敏感多疑，烦躁不安，不利于感情相处。
          你的八字丙火当令，日支坐午火强根为劫财，月令印星当令而透出，八字印比忌神力量强，喜用神食伤被旺印克，又被戳脚，财星虚透无根失令力量也不强，七杀在地支被两旺印泄耗，八字中喜用神力量不强且被忌神克耗，事业上会辛苦忙碌，发展缓慢些，个人心态及心情也不太好。
          结合八字大运走势看，开始走财，官杀的天干大运对八字事业财运发展还是有些小帮助的，虽然提升幅度不大，而后面大运走印运，地支财印相冲的运气，大运组合上不太好，整体格局比较普通。
          `
  }]
}

export default {
  寅时
}