const 子时 = {
  公历: [{
    甲: '1984-10-05 23:30:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '伤官   比肩   日元   劫财',
  天干: '甲(木) 癸(水) 癸(水) 壬(水)',
  地支: '子(水) 酉(金) 酉(金) 子(水)',
  遁藏: '比肩   枭神   枭神   比肩',
  大运: '壬申，辛未，庚午，己巳，戊辰，丁卯，丙寅，乙丑，9岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/396.html',
    命主甲: `自感每到换大运时，感应之事很多。爱读书，爱写文章，不太爱和人交流，但人际关系还可以，性格上不喜欢与众同流，较喜清净。事业上不爱权利更不太喜欢金钱，对宗教国学很感兴趣，喜欢有思想能提升心灵，开拓清净本性的东西。但尘世之人，没有物质就无法生存，更没办法养育孩子，这几年事业不太好，压力也大，所以主要想咨询下后面大运的工作情况。
          我只想有一些积蓄后能给子女留一些，然后能把钱全部用来给那些贫困地区修缮寺庙，同时帮助病苦之人和孤儿孩子们。完成这些愿望，年老以后，自己去寺庙当义工修行。
          本人大学毕业后一直在体制内工作算稳定，但一直不太喜欢身边的尔虞我诈。不喜官场。不喜金钱。收入一般，15年提级后，收入多了一点14-16财运还可以，但17年辞职后至今一直不稳定。还有些信息14年慈母因病去世往生。因父亲重男轻女，自小关系和他关系一般，但父亲对我事业发展帮助倒是很大。
          `,
    珠玑: `八字分析：癸水生于酉月，偏印格，月柱和日柱伏吟，日禄归时。偏印格之人一般有信仰，信佛之人居多，偏印喜欢偏财制约，否则易流于孤独，甚至想不开的境地。你八字中没有一点偏财，命局整体呈金水相生的格局，甲木虚浮无根，伤官是漂木，要注意甲木的状态，以免大运进来刑冲合化影响到健康。
          八字以甲木虚透顺泄金水旺气得以流通为用神，而八字水旺，所以喜见旺木来泄水，且木火组合可以同用，但地支不宜见午火，同时也可以土来制旺水，使得水不太旺，木就不太漂了，所以八字不忌讳土，而忌神为金水，这就如同大坝之水崩塌，淹了周边的花草树木和庄稼，所以来土制水患也是必要的。
          事业分析：你的八字金旺水旺，虽然透出甲木伤官为喜用，但甲木伤官无根，虚透无力，同时八字水旺，造成水多木漂的局面，而伤官代表是想法，创造力，快乐等，甲木伤官虚透无力，又水多木漂，所以容易想法理想化，不切实际，难以实现，不懂得表达自己，容易压抑憋闷。
          食伤为财源，八字不见财星，食伤也不旺，又没有旺土来制水，代表你命理的财源财运不旺，比较一般，而旺水无制比劫旺，所以钱财不稳定，容易破耗支出多。所以关于钱财方面的使用，最好是三思而后行，因为你命里财源不多，花钱厉害，赚钱能力一般，八字原局层次不高。
          结合你的大运走势来看，一路走正偏印，官杀，正偏财的运气，代表后面的运气对你还是有帮助的，格局层次也会得到相应的提升，可以到达小康偏上左右的级别。
          你的八字金水旺，而甲木伤官弱，金水旺为忌又无土制，所以很容导致你有些居无定所，工作事业不稳定，频繁变动，随波逐流的。
          加上八字伤官虚透无力，也是水多木浮的状态，也容易导致你有内心的想法，但难以得到很好的实现，甚至也有些不切实际，有些脱离现实，喜欢自由自在，凡事喜欢自立，不喜欢求人，也容易有理想化的想法，同时也有些清高，不喜与人交流，也较为反感人情世故的东西，且不喜欢被人管束太多，容易因为个人的情绪波动，冲动导致事业不稳定。
          大运分析：29岁-38岁走的是庚午大运，此大运庚金正印高透天干克制年干甲木，甲木本身就弱，被克后更是无法发挥流通泄秀八字的作用，同时运支午火财星被八字中的旺子水冲破，因此此大运对你事业求财是不利的，不但不稳定，且收入也会随之减少，而天干为枭神夺食的组合，地支财星逢冲，所以也很容易有些决定，决策方面的过失失误导致事业财运不稳定。
          39岁-48岁走的是己巳大运，此大运火土财杀星的组合大运，这步运己土与年干甲木合绊住，使甲木喜用神失去泄秀作用，影响五行的流通，求财还是受阻，但两者合拌使得木不再漂，且己土也有些制水的作用，相对来说对八字还是有些帮助的，而大运地支巳酉，巳申相合，可化水，财星被化为比劫，也属破财表现，对你事业是不利的，凡事宜小心谨慎比较好，但在一些旺木，旺土，天干火旺的年份里会有所收获，好好把握。
          49岁-58岁走的是戊辰大运，此大运正官虽然与年干有伤官见官的组合，但是正官与八字戊癸合克，同样对属有克制作用。地支戌土又是燥土也是可以制水的。所以大大削弱了伤官见官的性质，平时多注意些人际关系方面的维护即可，同时也少做些违规的事情。而此大运水得到一定的克制，所以对你的事业发展是较有帮助的，会有相对稳步的发展收获。
          58岁-69岁走的是丁卯大运，这步大运首先应事为甲木伤官得卯木托根生财星，月提日支二酉金虎视眈眈，欲冲卯木食神，但两子化生二酉金转生卯木，为慈母救儿(金克木，水来通关)之义，缓解了克战化凶为吉，运干丁火五合壬水化木，甲木伤食生扶丁火，此二象都为吉利之象。同时从后面的晚年运势看，也是偶组木火相生的运气这，所以晚年还算平稳安逸。
          你的八字整体格局层次不太理想，日主偏旺，印旺比劫旺，虽然透出伤官，但伤官也不太旺，财星不是很强，财运不太理想，印重比劫重钱财容易被克耗，也代表容易清心寡欲，对钱财也没有太大的追求。
          好在八字后面的大运组合运气走的还算可以，对八字有一定的救应作用，使得运势有所好转，事业财运也会有所增加，格局层次会随之提升，晚年生活也还算平稳安逸。
          你是可以往佛道方面去发展的，但是也容易因为世俗而影响到你在佛道的发展，需要注意调整，可以有些小小成。
          `
  }]
}

export default {
  子时
}