const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1993年十月十五日卯时'
  }],
  十神: '比肩   比肩   日元   食神',
  天干: '癸(水) 癸(水) 癸(水) 乙(木)',
  地支: '酉(金) 亥(水) 丑(土) 卯(木)',
  遁藏: '枭神   劫财   七杀   食神',
  大运: '甲子，乙丑，丙寅，丁卯，戊辰，己巳，庚午，辛未，壬申，4岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/460.html',
    命主甲: `小时候家里条件不太好，经常受到同学的欺负，不过还好我一直用功读书，虽然学习过程很吃力，但幸在如今仍有一硕士学历傍身，感觉生活也好多了。由于童年很多吃苦的经历，导致我心理成熟较早，喜欢独来独往，性格较为孤僻。现阶段遇到了很多困惑。
          我有过几次恋爱经历，但都以失败告终，目前已经单身两三年。虽然身边一直不乏追求者，但是他们大多身材矮小，让我委实提不起兴趣。我在2019年8月初认识了一男生，实在很喜欢，感觉他也对我也有感觉，遂于今年6月份告白，但被拒，久久未放下，心中意难平。
          我是文史专业，职业规划是科研工作，我很喜欢该行业，也做好了为此奉献一生的准备。
          `,
    珠玑: `八字分析：癸水生于亥月，天干不透甲木，取为劫财格。你八字的特点是比劫多，无财星，所以大运一见财星就会出现比劫争财的局面，于事业感情都十分不利。癸水坐丑印库，杀印相生，杀弱而食强，所以恋爱方面男方长相、能力各方面都差一点，但对你还是有利的。
          时柱乙卯食神干支一气为用神，时支卯木为时干乙木的禄神，乙木为食神状态较好，比较有力，为食伤泄秀之格。
          事业分析：癸水日出生的人，多遵规守矩，比较勤奋努力，这是有利于事业发展的，会受到领导的青睐和赏识。做事比较墨守成规，但食神贴身为用，创新力是有的。
          所谓好的食神抵财官，你的八字身旺食神泄身，食神状态较好，一生衣食无忧。食神为用神，如有食神大运来助身，则能够学习成绩优异，取得不错的文凭和学历。但食神较多，也代表有时候容易说话不得体，祸从口出，这是要注意的地方。
          亥月水旺木相，时柱乙卯食神较旺，乙木在天干透出，人比较聪明灵活，口才较好，有奉献精神，是比较主动的一个人，不喜太安静。
          食神为用神且较旺，创造力想象力较强，临天乙贵人，文昌贵人，天德贵人，学堂，从事科研，教育，咨询，服务行业是很适合的。
          你的八字财星不显，就连暗藏的财星也没有，对整体格局层次提升是个缺憾，不过食神抵财官，食伤状态好，财运也不会差，在求财上最好依靠过硬的专业能力或特长。
          月支亥水为驿马星，命局水旺，有漂泊之象，这种命格适合外出家乡求财为宜。家乡为印，命局不喜印，也代表不适合在家乡发展。
          年支卯木去克了丑土七杀，七杀得不到解救，容易对工作，同事，上司不满，心生抱怨，有口舌是非，也容易在工作上犯小人，有人给你穿小鞋。八字比肩星较旺，人比较固执，做事较为冲动，或欠缺考量，这是要注意的。
          八字纯阴且食伤泄秀，顺利发展有成为女强人的可能，未来事业上能有一番作为，人也比较长寿。
          婚姻分析：癸水的人一般对婚姻充满理想，在感情方面比较保守，敏感脆弱，容易受到伤害，不容易走出阴影。但有浪漫情怀，性格温和细腻，比较讨异性的欢心。
          你的八字为纯阴的八字，所谓孤阴不生孤阳不长，加上日坐华盖，为孤独之象，内心会有些孤僻，内向，慢热，不够开朗，对婚姻有不利的信息。
          八字食神较旺，时干乙木透出贴身，对另一半要求过高，不能轻易满足，婚姻难以顺利落实。时支卯木去克了日支丑土，则容易对未来丈夫不满，夫妻之间容易犯口舌。
          原局不见财星，日支丑土七杀为夫，财星是来生官杀的，命局是不旺夫的，也代表命里的夫运不强，比较难各方面满意，未来丈夫能力和条件一般。
          一般七杀为夫，和未来丈夫年龄，财富，能力，学历会有很大差距，因为七杀为偏缘，总有有些不让自己满意的地方，自己各方面都满意的难走到一起。
          你的八字官杀轻而比肩重，意思是比肩夺夫，也代表容易有其他女人干扰你的感情，要注意第三者插足，找一个有过婚姻的男人会有利于婚姻的稳定，也适合晚婚，不宜早婚。
          你在2024甲辰年，2026丙午年和2027丁未年，有遇到且有结婚的运气。
          未来丈夫是比较老实，勤奋踏实，任劳任怨，174左右，长相一般，眼睛不大，单眼皮，皮肤微黄有点偏黑，在企业或政府部门从事管理岗位。
          子女分析：时柱乙卯食神为用神，乙木和卯木是有力的，时柱也为子女宫，为子女入主位，你的子女缘分是非常好的，子女有出息，比较孝顺，以后发展较好，晚年有靠，能得子女帮助，子女方面不必太过担忧。但由于时柱空亡了，子女比较迟，晚育为吉。
          大运分析：24岁-33岁走的是丙寅大运，此大运为伤官生财的大运，八字身旺可以担财，这步大运财运是不错的，只是八字不见财星，大运财星透出，构成比肩夺财，为空亡大运，财来财去不聚财，也要注意和朋友，同事之间的金钱往来，容易被欺骗。
          34岁-43岁走的是丁卯大运，此大运为食神生财的大运，此和上一个大运类似，天干丁火透出也构成比肩夺财，要注意破财之事。另外地支卯酉相冲，则两卯冲一酉，时支卯木食神为寿元，要注意肝胆疾病。用神被冲克，在事业和感情上必然也会有不顺之事。
          44岁-43岁走的是戊辰大运，此大运干支一气为正官大运，天干戊土正官透出，戊癸相合，三个癸水去争合一个戊土，工作上竞争压力会很大，也要注意丈夫和其他女性之间的交往，防止第三者插足。
          54岁-63岁走的是己巳大运，此大运为财杀相生的大运，地支巳火和年支酉金，日支丑土合而不化，且巳亥相冲，冲了财星，容易破财，花销较大。
          后面的庚午，辛未大运是不利婚姻的，地支丑午穿害，丑未相冲，都冲害了婚姻宫，容易发生家庭矛盾，夫妻不和之事。
          你的命局属于事业比较好，婚姻差些，适合把心思放在事业上，能取得不错的发展。
          平常生活上可以选择红色，黄色，青色，绿色为宜。佩戴一些红水晶方面的饰品，在家里的正南方挂一幅旭日东升图，则对你有帮助。
          `
  }]
}

export default {
  卯时
}