const 巳时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1990年九月二十四日巳时'
  }],
  十神: '伤官   枭神   日元   比肩',
  天干: '庚(金) 丁(火) 己(土) 己(土)',
  地支: '午(火) 亥(水) 卯(木) 巳(火)',
  遁藏: '枭神   正财   七杀   正印',
  大运: '丙戌，乙酉，甲申，癸未，壬午，辛巳，庚辰，己卯，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/489.html',
    命主甲: `出生在广西玉林市，大学的时候母亲就生病去世了，家庭条件还不错，但是运气就不是怎么好，毕业听爸爸的话在家当了代课老师，虽然人挺聪明的，可是每年考教师资格证都过不了，考单位也是笔试过了面试就是不过，公务员也是考不过，
          身体也比较虚弱，不知道什么时候可以结婚生子！
          `,
    珠玑: `八字分析：己土生于亥月，为正财格，亥卯半合，正财生杀，日主坐下七杀，不过巳、午印星皆可化杀，日主是个聪明伶俐之人。
          事业分析：己土日干在地支没有强根，但有印星，月令财杀印相生，而月干与月令，午火与月令存在暗合关系，容易有财碍印的信息，也代表一些想法容易受到他人所左右，特别是来自长辈的意见。印星克伤官在地支，说明为人是比较传统，容易顺从父母长辈安排的一个人。
          财星在月令，地支财杀印相生，最终比肩帮扶日主，说明有事业心，有上进心，同时内心也有自己的一些想法，只是不那么善于表达出来，伤官被克，自己有时也会有些困扰，内心会有些闷闷不乐的情绪波动。
          丁火偏印透出月干，年支有午火强根，八字印星贴身生助日主发用，同时地支财杀印流通相生，八字中的印星起到了好的作用，也代表事业上通过自己的努力可以获得好的发展进步。
          印星比劫为用，而印星为长辈，年长的人际领导，比劫代表同事朋友，能获得他人的付出和帮助，贵人午火为印星，且印星透出为真贵人，所以事业不会差。
          结合大运走势看，后面大运天干运势走的不太理想，但地支运势走的还算可以，有帮扶作用，整体可以有小康偏上到中产水平。
          八字以印星为用神，且印贴身生，地支财杀印相生，地支杀印流通向比劫考试的话对他人有帮助，但也代表竞争大。而印星在月干透出，月令亥水对印有些干扰作用，考试的时候容易发挥不稳定。
          八字印星多现，没有明显的被冲克信息，而八字身弱用印，是非常适合从事教育老师工作的，从考试运来看，2024年-2026年考上教师资格证的机会很大。而丁火印星为喜用在月干，也代表适合往国企事业单位，公务员，行政类的工作发展。
          婚姻分析：婚姻宫为卯木七杀，月令亥水财星生卯木七杀，七杀生时柱印星，八字不见正官以七杀为夫星。婚姻宫忌神得财生，代表另一半出身条件一般，而七杀被印星所化，通过自己的努力也会慢慢变好。
          七杀在婚姻宫，同时月令财生七杀，代表感情容易受到家里男性长辈干扰，而八字印星透出，对感情也是较为敏感，想得多，顾虑多，且财星月令生婚姻宫，代表自己感情也较为专一，对另一半及也较为用心。
          八字伤官不是太旺，且被克制，感情方面还算可以，争吵矛盾少些，克夫信息也是不存在的了。
          时柱己土比肩透出，七杀被印泄，另一半开始也还算不错，但时支巳火印去生己土比肩，后面也很容易对其他的女人好。要注意提防第三者女人插足，同时婚姻宫坐桃花星，又是七杀，容易遇到烂桃花，桃花煞且因为感情而容易有伤心的事情。
          大运分析：32岁-41岁走的是癸未大运，此大运地支亥卯未，地支水木火土流通相生，整体运势不会太差，但天干癸水得伤官生克印，对工作容易有不满影响到工作状态，癸水坐未土，力量不强，整体事业利大于弊的，也有发展收获。大运地支半合官杀局，地支也流通，有结婚的运气，只是大运地支比肩力量增加，也要注意其他女人干扰。
          42岁-51岁走的是壬午大运，天干丁壬合，地支午火力量增加，印星被合日主生伤官星，地支印力量增加，事业心重，干劲大，地支午午自刑，也会较为辛苦忙碌，付出多，有时候后也会情绪烦躁，整体还是利大于弊。大运月干逢合，年干伤官得生力量增加，地支午火为印旺，容易有感情烦恼，争吵矛盾多。
          辛巳大运，庚辰大运，这两个大运天干食伤泄日主，地支印星和劫财力量增加，日主有得生助，也有泄耗，五行方面有生有泄，晚年运气问题不大，相对平稳，注意下理财就可以。食伤的力量增加，较容易有争吵矛盾，特别是进入更年期后，会容易看不惯对方，婚姻中相处合不来，容易说不了几句就吵架。
          八字日主不得月令帮扶，日支坐卯木七杀戳脚日干，日主的力量会弱点，有些承受不住财官的力量。好的是八字中印星透出，在地支有强根，只是月令财与印有暗合自合的关系，影响力年支，月干印的力量。
          同时地支财杀印流通相生也有相对好的一面，所以事业财运发展也是有帮助的，适合稳定的工作单位，教育工作也是适合的，同时后面大运走的又是地支南方火的运气组合，所以事业财运也还有发展提示的空间收入增加，整体格局层次不差。
          `
  }]
}

export default {
  巳时
}