const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   比肩   日元   七杀',
  天干: '庚(金) 丁(火) 丁(火) 癸(水)',
  地支: '申(金) 亥(水) 亥(水) 卯(木)',
  遁藏: '正财   正官   正官   枭神',
  大运: '戊子 己丑 庚寅 辛卯 壬辰 癸巳',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/163.html',
    命主甲: `湿木无焰七杀攻，遭空难命亡之命造
          `,
    珠玑: `此造出生日的日干为丁火，所以属命丁火命，生于十月，冬天火气已绝，先天生下来就身弱。想要使火暖融融，最好能见有甲木，甲木为丁之母。滴天髓云：如有嫡母，可秋可冬。
          现向八字查去，不见有甲木，反见年柱庚申两金去生旺壬癸水，月令亥水本身当旺，再见日主丁火自坐亥水，时干癸水七杀透出，值两亥水之旺根，复得年柱庚金、申金财星生旺，成为财（金）生杀（水）旺攻身（丁火），全赖时支一卯木生火，月干一丁火相助，全局财官（金水）力重，日主丁火一方印劫（木火）力微，不成比例，显然是一格局不高之命。
          《命经》中说：丁火若失时丧局，即韬光晦迹，而烟无存，虽微眇之金亦不能制。在此造中即是这种情况，虽说月干丁火透出，理论上可制年干的庚金，然丁火生十月，失时；局中二金三水，丧局，所以说，虽微眇之金亦不能制。
          又以为卯木见亥日，亥卯半合木局，可化杀为印（化水为木）以生身（火），日元丁火，见印木自强。殊不知冬木有癸水之生，与亥水作合，反成湿木，虽增加了木的份量（亥卯半合木），然木湿虽多，亦难以致火之明，木湿焉能助丁之气？
          可见此造时支卯木上下被水包围而成湿木，木印未必能生火，犹如十月立冬小雪时节，你去外面抱回一捆又冷又湿的灌木，回屋后去生火煮饭一样。分析到这里，此造连普通中等正常的格局都不能入，只有列入格局配合无情，喜用不力的下等格局了。
          喜用不力，前面说过，指丁火无力制金，卯木为湿木，湿木无焰。格局配合无情又是怎么说呢？此命有一特点，就是四柱内有“伏吟”：命局中有二柱或三柱相同，就是四柱内有伏吟，此造是指月柱和日柱都是丁亥，月柱和日柱伏吟。
          其二是地支已经是财生杀旺（金生水旺），天干更是透出财生杀旺克身（庚金生癸水克日主丁火），与地支相呼应。地支是潜在着的事象的表现，天干便是将要这种事象发挥出来的迹象，两者呼应，事情发生的可能性就很大了，癸水七杀专攻身，出现在时干，指事情发生会在晚年。
          最后一个格局配合无情的是：亥卯半合木局，本来是将水合成木，化忌为喜，如果是夏天出生的命，这种合局最相宜，因为夏天木渴草枯，最需水来调候。但此造是冬天，如此一合，干木反成湿木，湿木难生无焰之火，可见合有相宜不相宜了。
          由于癸水七杀出现在时干，主晚年，现再去查晚年时期的大运，晚年55岁后入癸巳大运，与命中月柱丁亥，和日柱丁亥皆天克地冲（反吟），加上原命中这两柱有伏吟，《命理正宗》中说：“反吟伏吟泪淋淋，不伤自身也损他人”。这么多反吟和伏吟出现在这柱大运中，自当提防出现意外冲动、变故之事了。再查其大运内之流年，有辛酉年，酉金再冲命中唯一用神卯木（卯酉相冲），喜用全灭，此年死于空难。
          可能有人说，巳火是丁火禄旺之地，为喜用神，正行好运，怎么会死呢？其实关于意外、事故、凶亡等事，多由命、运、岁三者间的冲克关系而定，运程是看一个人的名利、事业、钱财等的升降浮沉的过程。
          正在行好运的人，并不能保证你不发生意外，犹如一辆好车，开在一条毕直的柏油好路上，也会发生突然的车祸，如对面的车酒醉驾驶撞到你车头上来一样。你不能说因为我这部是好车，又行在好的道路上，就不应该会出事一样。
          所以见过许多名人，成功人事，在出差途中，或飞机上突发心机梗塞或其他意外死亡，你说他不走运吗，他们已经是红得发紫的社会名流，但为何又会突发意外而死亡，这是由于他命中和大运及流年可能见到双重，或多重的反吟、伏吟和冲克之故。
          像此造那样，命中已见一组伏吟，加上大运与月，日双重反吟，又加上流年冲克命中喜用神，正如一辆车，内部的机件已存有隐患，加上在行驶途中，先是被对方撞上，然后自己失控又撞上路边的防护栏上，再翻车掉下山沟，这还不车毁人亡了吗？
          `
  }]
}

export default {
  卯时
}