const 未时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '偏财   七杀   日元   食神',
  天干: '癸(水) 乙(木) 己(土) 辛(金)',
  地支: '酉(金) 卯(木) 亥(水) 未(土)',
  遁藏: '食神   七杀   正财   比肩',
  大运: '甲寅 癸丑 壬子 辛亥 庚戌 己酉 戊申 丁未',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/64.html',
    命主甲: ``,
    珠玑: `己土生于卯月，旺木当令，己土气势衰微，全靠辛金食神制杀。
          一、杀性旺。二月乙木，帝旺之势，强不可挡，再加上地支亥卯未三合局，更是旺上加旺。七杀既是压力又是一个人的能量，就看怎样驱使和利用，
          如此七杀，犹如抱着老虎睡觉，敌人虽不敢近身，但是自己随时都有被吃掉的风险。表现在生活中，就是富贵险中求，并非自己愿意冒险，而是人在江湖，身不由己。
          二、自身弱。己土仅在时支得本气强根，且未意在卯木七杀，不能全力帮身。有人说是假从格，实在荒谬至极，不管怎样有强根，而且有强力食神，想从也从不了啊！
          三、食神强。食神辛金在年上，先才而后食，不算破格。如果食神在年上，偏财在时上，食神制杀的格局就破了。辛金在年支有本气强根，卯酉冲针尖对麦芒，冲的是中神，非常有力，最大限度地发挥了食神的功用。
          食神就好比一个人的思想和武器，它能管理人，制服人。比如此造，命主就是一个管理人才，而且管理的都是比他强的人。一个能力突出的企业老板，管理着各个领域的优秀人才，要论专业领域，每个下属都比他强，可他就是有这个能力去管理，这就是食神的力量。
          当然，由于自身能量不足，身体也会体弱多病，而且赚的钱又用于追加投资，自身是难以积累固定财富的。而且，这样的人，财富多了反而祸害自身，就这样也挺好的。
          四、财不弱。偏财癸水根在日支，按常理，日主坐在正财上，应该是个富人。的确，命主能赚很多的钱，但是上文也提到了，财是生杀的，对格局起的是反作用，财多伤身对日主极其不利，所以宁愿财来财去，衣食不愁就是最大的幸福。
          总结：大抵食神制杀，不怕杀强，只怕财厚，因财能生杀破格是也。观其大运，早年辛苦，压力重重，眼看要成功的事情也会意外地失败。一进食神、比劫大运，命主用神发用，必能有所建树，大器晚成之造。
          `
  }]
}

export default {
  未时
}