const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1997年六月七日亥时'
  }],
  十神: '伤官   伤官   日元   劫财',
  天干: '丁(火) 丁(火) 甲(木) 乙(木)',
  地支: '丑(土) 未(土) 寅(木) 亥(水)',
  遁藏: '正财   正财   比肩   枭神',
  大运: '戊申，己酉，庚戌，辛亥，壬子，癸丑，甲寅，乙卯，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/350.html',
    命主甲: `从小到大我都是一个好学的学生，渴望着通过自己的努力成就一番属于自己的事业，来给自己和家人提供理想中的生活，我也如愿顺利考上理想的大学，平稳而充实的度过了大学四年的时光，去年我如愿考上了法律的研究生，之所以选择法律是因为兴趣所至。
          然而，近几个月了解到的一些法律专业最新的就业信息让我焦虑不已，我开始怀疑自己放弃以前的专业一意孤行选择法律的做法是否是正确的。
          事业之外，我对于自己的爱情姻缘方面也十分迷茫。在我二十几年的人生历程中，我从来没有过一次两情相悦的爱情。曾经断断续续有几个男生暗恋我对我表示过好感，但我自己在当时的情况下心里都有一个我很喜欢但对方不喜欢我的人，所以我的态度都是拒绝。
          直到现在，我也没有谈过一次真正意义上的恋爱。所以，我很困惑，也很迷茫，是否那种两情相悦的爱情火花就真的命中注定不属于我。我个人比较喜欢那种积极向上阳光的男孩子，希望自己未来的另一半有一个让我崇拜的点，并且他上进，绅士，温柔，对于未来有明确的规划。
          `,
    珠玑: `八字分析：甲木生在未月，为正财格，丑未相冲土很旺，癸水印星有受克的风险。又兼甲寅日柱为比肩，时干也是劫财，两个丁火是伤官，所以没有多少现在的享受，也没有太多长辈助力，是自力更生之命。
          正财格八字又有伤官相生，甲木和正财和相合的，所以事业财运方面会有不错的层次。比劫多朋友多，伤官多有傲气，有才艺，知识渊博，清高之人，对人对事都有一套严格的标准，一般人做事很难入你的法眼。
          事业分析：甲木日主自坐禄，劫财也旺，且禄印相生，说明你为人还是比较有自信心的，而且能够凸显甲木的特性，自尊心也比较强。而伤官透出生财，也代表你有自己主见和想法，不太喜欢被束缚管束太多，被人所左右，比较有事业心和上进心，自立而不喜欢依赖别人，处事追求完美，但也有些急躁和固执。
          月柱和年柱都是伤官生财的组合，年月支财旺，属于身财两停的组合，且能担起财官。八字中伤官透出，代表财源，且年支月支为正财，八字伤官生财，八字中的财星力量不弱，代表命里有一定财富。
          地支寅木为禄神，也代表日主的身体，地支寅木克地支丑土未土财星，说明通过自己努力求财，亲力亲为的信息。
          时干透出乙木劫财，所从事的行业竞争会比较大，同时要注意理财，结合大运走势来看，一路走财，官杀大运，50岁后开始走印比劫大运，晚年运气一般，但八字伤官无冲克，且流通，所以整体格局还算可以到达小康偏上到中产左右。
          你的八字属于比劫配伤官生财的组合，身财两停，宜食伤财为喜用神，食伤生财是做生意，或技术技能的信息，财为用可以代表金融财经相关的行业，但八字地支财星丑未冲，财星逢冲代表财运容易有波动，同时也是钱财进进出出更替只想，所以金融财会，银行信贷是适合你的。
          而八字比劫旺逢伤官，八字水木相生流通，文化教育培训，及法律事务也适合你，只是八字伤官最终生财，所以金融财经方面更适合些。
          婚姻分析：甲寅日柱，寅木比肩入婚姻宫，地支寅亥生合增加了比肩的力量，且时干透出乙木劫财，加两个伤官透出，劫财和伤官都是克制女命官杀夫星的，说明命里婚姻运比较弱，择偶要求高，但难遇到自己各方面满意的对象，自己喜欢的对象不喜欢自己，或是名花有主。
          八字官杀不显，年支为丑土为官杀墓库，地支丑未冲，丑中的正官星被冲掉，代表你的夫运不旺，且与夫的缘分不深，丈夫对你帮助不大，且命带劫煞，整体的感情婚姻不太平顺。
          你现在走的是己酉财生官的大运，地支酉丑也生助官星，对你的婚姻比较有帮助，2021辛丑年与大运天干地支土金相生，八字伤官生财，财生官的时候，有遇的运气，注意好好把握，错过的话后面婚姻运不太旺，要到2028年才有。
          对象方脸，大眼睛，双眼皮，眼睛炯炯有神，眉毛有些浓密，肤色不黑有些清白，有点而像悬胆鼻，嘴唇不厚，头发不长，额头微高，身高在175厘米左右。
          大运分析：20岁-29岁走的是己酉大运，此大运与八字伤官生财，财生官，八字五行流通，属于发展收获的运气组合，同时学业考试运也还不错，能学有所成。大运财生官，官星出现得生助，地支酉丑生合增强官星力量，所以此大运有结婚的运气。
          30岁-39岁走的是庚戌大运，大运七杀克制比劫，对你事业发展有帮助，竞争压力也会减弱些，但同时大运地支与八字丑未戌三刑，八字财星三刑，注意防止些经济钱财纠纷矛盾，切忌不要涉及违规的事情。另外要注意下烂桃花，地支三刑，脾气情绪容易不稳定，导致婚姻感情不和谐。
          40岁-49岁走的是辛亥大运，大运与时柱天干相克，地支比和，本是好的，但大运金水相生，五行力量集中在水，所以生助比劫，也会有些支出破耗，而天干与八字也有伤官见官的组合，人际关系不是太和谐，容易与人有不合的是非，运势方面有些患得患失。此大运女命伤官见官，地支寅亥合，要注意感情矛盾激化，以及第三者插足，
          50后分别走的是印比劫运气，运势会稍微忙碌，付出也会多些，晚年运气整体较一般。
          你的八字年柱，月柱为五行火土，为伤官生财的组合，日柱，时柱水木相生，代表日主和比劫的力量，八字身财两停，五行力量相差无几，八字日主还是可以任财官的，同时八字五行也还算流通，形成木火土相生的组合，也代表你还是可以获得相应的财富。
          而大运方面走的一般偏好些，在求财方面能够有收获，但不是非常巨大，中年后晚年运不是太好，格局层次一般偏上的水平。
          `
  }]
}

export default {
  亥时
}