const 申时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '伤官   比肩   日元   比肩',
  天干: '己(土) 丙(火) 丙(火) 丙(火)',
  地支: '巳(火) 寅(木) 辰(土) 申(金)',
  遁藏: '比肩   枭神   食神   偏财',
  大运: '乙丑 甲子 癸亥 壬戌 辛酉 庚申 己未 戊午',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/243.html',
    珠玑: `八字分析：丙火生在寅月得月令生助，寅月木旺火相，同时年支巳火又是日主的强根，对丙火的帮扶力量也是非常大的，而地支寅巳刑生助火，再加上八字月干和时干，分别透出丙火贴身帮扶日主，而年干逢己土，日支辰土，属于泄日主力量的五行，火旺最喜湿土来泄，时支又可以土生金。
          而八字天干火过旺，只能用旺土来泄，用水则难克掉旺火，反而容易犯怒反克，被旺火蒸发干掉，除非水特别旺，地支明显也是用土金的五行才比较好些。
          事业分析：丙火为太阳之火，旺而烈，急而燥，加上八字木火旺，火旺更是脾气会比较大，做事也容易火急火燎，比较急躁，缺乏耐心。而火为比劫，比劫旺也是急于求成，想走捷径之象。说明是一个缺乏耐心，不能循序渐进，持之以恒的人，对于一些重复性的工作，会容易厌烦，而影响到工作状态。
          八字食伤为用神，食伤代表是想法，行动等，年干透出己土伤官，但是见三个丙火，坐下又是巳火，这个己土简直就是被丢到火炉一般，很容易被烤焦，这叫火多土焦，不能化泄消耗掉火的力量，反而是己土受伤不吉，所以在思想方面会比较消极，自卑。而日支为辰土，虽然辰土为湿土，可以泄旺火，但是又和月支寅木组成枭神夺食的组合，同样也是容易消极悲观之象。
          加上八字丙火天干三连，又有木来生，火太旺了，必然刚烈，就好像太阳一样，有毁灭，烧毁一切的意思，丙火过旺也容易滋生些极端，悲观，消极厌世，甚至轻生的念头，对事业发展是不利的。
          时支虽然是申金偏财，且有辰土食神来生助本吉，但八字比劫过旺，八字只有日支，时支食神合财星且不透干，很难泄掉旺火，同时申金偏财在时支被丙火比肩盖头，说明命里的财星不旺的，食神被克力量也有限，加上比肩无制容易分财，所以整体格局层次不高，属于较为一般的命造，比较适合稳定的工作。
          从八字组合来看，适合选择土金五行的行业或食伤财的相关的工作，比如土地建筑，文化教育，健身养身，技术相关的工作比较适合。
          婚姻分析：八字辰土婚姻宫为喜神，说明对是有帮助的，而八字五正财，则以辰土，以及偏财来婚姻，婚姻宫为喜神，又生助时支申金偏财，代表妻子可以帮助到，而且婚后后运势会更好些。
          但财星在是时柱，时柱代表晚，也说明婚姻来得比较晚，同时八字比肩过旺，当遇到财星透干的时候就容易被其他比劫合克走，八字财星不旺，而比劫无制，说明婚姻是比较难成的，申金上一个丙火，说明妻子会有过一次婚姻。
          从婚姻运来看，近几年都不旺，在明年庚子年，大运太岁金水相生水旺可以克制比劫，太岁地支合入婚姻宫，且八字申金透出，所以明年是容易遇到桃花，但竞争也大，要注意把握好，在2021辛丑年的时候有结婚的运气。
          如果错过是要等多几年，在2024年太岁临婚姻宫的时候桃花旺些，但因为婚姻宫辰辰自刑，所以也不是那么理想，不稳定的因素也是比较多的。而2025年地支巳火为日禄去合时支财星的时候，代表这一年也有结婚运，但是八字比肩旺得印星通过，大运官星克不到比肩，说明感情竞争同样是比较大，也不容易把握，综合来说还是好好把握明年吧。
          健康分析：八字最旺的五行为火，其次为土，金，其次到水，木。八字火旺必然克金，而木被旺火泄焚烧殆尽，五行力量不显，且克泄耗严重，水是非常弱的，水代表是肾，肾是一个人的先天元气所在，也代表先天体质不太好。
          加上早年一路走的是乙丑，甲子，癸亥大运，乙丑大运木火相生，地支丑土泄火气，但水还是相对较弱的，难以改变原局状态。甲子大运天干助火，地支见水被八字地支克泄也是不吉。
          而目前走的癸亥大运直接与年柱天克地冲，伤官见官，运气也不理想，但此大运属于旺水大运，水旺则健康会有慢慢好转，特别是2020年和2021年是金水流年和湿土逢金的流年，土金水相生旺，容易康复很多，自己也要把握有利时机，多注意调理，适当锻炼，同时注意下反反复复的情况。
          大运分析：28岁-37岁走的是癸亥大运，此大运与年柱天克地冲，八字伤官见官，地支巳亥驿马相冲，对属于有利有弊的，事业会比较被动，且容易招惹是非口角，同时驿马相冲，也比较辛苦，事业不稳定，容易变动。而大运官杀旺主事还是可以克制一些比肩的，好好用心努力，事业也能慢慢好转，
          但同时也要注意搞好人际关系，多团结他人，才能更好些。同时官杀透出克制比肩，对婚姻着落也会有帮助，感情竞争也会小些。健康运方面，原局水很弱且受克泄耗，大运旺水，身体健康方面也会慢慢的好转。
          38岁-47岁走的是壬戌大运，大运与日柱天克地冲，这个大运虽然天干壬水，但坐下戌土，壬水被制，壬水的力量不强，属于弱水冲旺火，不但不能克制火，反而是火上浇油。这种情况就好像现实生活中，一团大火，用一点点水去浇，不但不能浇灭，反而水遇到火分解出氢气和氧气，让火烧的更旺盛。
          加上地支辰戌冲，辰中弱水也受伤，而戌为火库地支土被冲旺生金，代表这个大运压力开始增加，而食神生财，是在比肩旺的情况下生财的，所以同样是劳碌付出多的运气，财运虽然会有些好转，但也是不稳定，破耗多，整体不理想。
          而此大运也容易忽视对方感受，发生不合的矛盾，且婚姻宫冲破，容易有闹离婚危机。同时大运犯旺火，水伤，又容易有旧病复发的情况，对事业和婚姻都是不利的。
          48岁后分别走的是辛酉，庚申，己未等大运，后面走财星、伤官的运气，对事业所有帮助，财运会有所增加。但劫财旺合克财星，花销也比较多，但整体而言，日主被泄耗，对各方面都是有帮助的，晚年生活也会比较好。
          八字身旺比肩旺，且透出多个比肩无制，地支又有比肩的强根，寅巳刑生增加火的力量，使得财运容易受到比较大的限制，事业发展也容易被动受阻。而八字日支，时支食神生财，还是有生养的财运的，但财星被比肩盖住，说明命里财运还是有的，只是不会太多，整体格局层次比较一般。
          在目前这个癸亥大运，对各方面是有利些的，一定要好好把握，做个规划，因为中间的壬戌大运对不太有利，也是为这期间做个积累，可以抵抗风险。
          婚姻方面婚姻宫和妻星虽然为用神，但是比肩旺无制，且枭神夺食的组合，让对感情会比较敏感，被动，要求高，但又难达到自己的要求，导致婚姻难成，建议是降低择偶要求比较好。
          `
  },{
    作者: '',
    出处: '',
    珠玑: ''
  }]
}

export default {
  申时
}