const 申时 = {
  公历: [{
    甲: '1989-02-17 16:00:00'
  }],
  农历: [{
    甲: '1989年一月十二日申时'
  }],
  十神: '劫财   偏印   日元   食神',
  天干: '己(土) 丙(火) 戊(土) 庚(金)',
  地支: '巳(火) 寅(木) 申(金) 申(金)',
  遁藏: `丙偏印 甲七杀  庚食神 庚食神
        庚食神  丙偏印  壬偏财 壬偏财
        戊比肩  戊比肩  戊比肩 戊比肩`,
  大运: '乙丑 甲子 癸亥 壬戌 辛酉 庚申 己未 戊午',
  批注: [{
    作者: '知命理懂进退',
    出处: 'https://www.bilibili.com/video/BV1gu411v7CA',
    珠玑: `生于己巳年丙寅月，戊申日庚申时，戊土生在寅月月干上面透出了丙火格局形成的杀印相生。
          丙戊长生在寅木，戊土有丙火的存在，在寅月也算得令；日主坐下是食神地支下面形成了寅巳申三刑，刑到了夫妻宫。这个婚姻方面的话呢，还是要注意一下。
          生于庚申时，格局喜欢食神去生财。命局来讲，以财星为用，年干上面透出己土劫财，这个劫财为忌神。
          现在走的这一步大运，走北方水运，癸亥合亥，这一步大运的运势对你来讲的话呢是不错的，能够赚到钱。但是呢也容易财来财去，为什么说容易财来财去呢？因为你年干上面透出了劫财，见到癸水肯定要来克，所以说容易财来财去；
          壬戌大运，地支下面戌土是戊土的强根，那么这个土是比较旺的，这个八字是不喜火土的，火土流年容易花钱；走到北方水运财运会比较好；
          辛酉大运，丙辛合把丙枭印合掉，己土回来帮助，食神回来泄己土，然后去生财，地支巳酉丑三合，当然寅巳申三刑是本身原局中，巳酉丑三合合不成，天干上见到了癸水财星，食伤去生了财，财运很不错；
          庚申大运食神很重，也是好事，食神会暗生财星；
          65岁以前的运势都很不错，命带寅巳申三刑，容易因为父母家里年，或者说领导的一些事情产生是非，需要注意，行事需要谨慎一点；每逢到了寅年申年巳年容易引动刑冲，是非会比较多；
          己未戊午大运，不利求财，65岁以后一定要退休享受晚年，做生意投资方面都不利；容易花钱比较多。
          `
  },{
    作者: '',
    出处: '',
    珠玑: ''
  }]
}

export default {
  申时
}