const 巳时 = {
  公历: [{
    甲: '2000-01-07 09:30:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   伤官   日元   正财',
  天干: '己(土) 丁(火) 甲(木) 己(土)',
  地支: '卯(木) 丑(土) 子(水) 巳(火)',
  遁藏: '劫财   正财   正印   食神',
  大运: '戊寅，己卯，庚辰，辛巳，壬午，癸未，甲申，乙酉，丙戌，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/536.html',
    命主甲: `从小到大都过得不是很快乐，初中被同学排挤霸凌。小时候家境不好，只能在生存线上挣扎，初二开始就学不进去知识，后来考了大专又退学。没有技术，只能做比较辛苦的工作，现在在家准备明年再战高考。
          今年谈了一场失败难忘痛苦的恋爱，被对方欺骗感情骗色得到了就对我冷酷无情冷暴力，电话拉黑微信删除，使我身心俱伤。现在内心特别迷茫恐慌，不知道什么时候才能遇见真心对我的男生。
          `,
    珠玑: `八字分析：甲木生于丑月，干透己土，为正财格。正财格最怕阳刃，年支卯木便是甲木的阳刃，子丑一合，丑土被阳刃克得厉害，无处躲藏。而且，你八字早年也走阳刃运，所以财运不好。
          事业分析：月干丁火伤官高透，喜欢追寻内心，有些任性，不喜欢低头服输，也比较随性的一个人，八字不见官杀，喜欢自由，不喜欢框框架架的约束，天干地支食伤生财，野心是较大，对现状不容易满足。甲木坐子水为用，丁火伤官高透贴身，口齿伶俐，但有时候容易说话不得体，顾及不到别人感受，不招人喜欢，影响到人际关系。
          甲子日出生，日坐子水印星为用，但子丑相合，子水被丑土合克，为财星制印的组合，子卯相刑，子水受损，学业受阻，难以取得文凭和学历，而且很容易辍学。地支要见申酉金来护印，才有机会取得文凭和学历。
          你现在走的是己卯大运，地支子卯相刑，子水受损，印星受损不利学业，今年辛丑年，子丑相合，财星制印，不利考学。2022壬寅年，地支寅木去制丑土财星，考学运稍好，但还是比较艰辛。
          2023癸卯年，子卯相刑，不利考学。2024甲辰年，子水见辰入墓，不利考学。2025乙巳年，巳火去生丑土，不利考学。2026丙午年，子午相冲，不利考学。2027丁未年，子未相害，不利考学。2028戊申年，地支申金通关，考学运较好，但年龄已经很大了，错过了最佳学习阶段。
          八字食伤生财，伤官高透，适合去做销售，技术，服务相关工作，时支巳火为驿马星，巳火为食神，可以动中求财，奔波求财，八字食伤较旺，年支卯木为甲木的远根，外出求财比较合适，也代表在外定居安家之象，方位选择北面，东面，东南面比较适合你。
          丑土财星得令较旺，且有食伤生财，八字身弱则难以担财，天干两个己土正财争合甲木日主，故而求财辛苦，年支卯木帮身制财，多付出体力劳动来求得薪资，身体比较劳累，只有大运助身才有机会得财。地支卯木去制丑土，丑土去制子水，子水去制巳火，为顺克，事业中会遇到坎坷较多，挫折不少。
          年支卯木羊刃，有手术，开刀之意，八字火土旺，丁火伤官高透，甲木坐子水印星为用，子水临太极贵人，天乙贵人，天医星，这种从医是最好的，八字正财合身，印星贴身，能去医院上班也是比较好的，也可以考虑开始去读个卫校，或专升本去学医，对你发展比较有利。
          只是近几年你的学业运都不好，学业运对你助力不大，只能是后天通过自身努力来弥补，付出更多努力，在考学上，适当降低标准才有可能，今年备考，明年争取下。
          婚姻分析：月干丁火伤官高透，伤官生财，己土正财星伏吟高透，会有些虚荣，对感情比较敢想敢做，敢于追求，喜欢浪漫，不传统保守，比较前卫的一个人，在和异性相处上比较放得开。
          甲子日出生，日坐子水为桃花，临沐浴之地，有一定异性魅力，但也容易吸引不太好的男人，同时也代表未来丈夫会有好色花心的倾向，容易心生二心。
          地支子卯相刑，子丑相合，婚姻宫子水不得安宁，婚姻感情波折较多，很容易发生变动。八字临孤辰寡宿，为婚姻不利的体现。
          八字不见正官，只有月令丑土中暗藏辛金正官，为夫星入墓，夫藏墓库不显不透，地支子丑相合，为闭库，容易遇到烂桃花，好的缘分少，容易错失良缘，晚婚比较适合，未来另一半能力不强，条件一般，但日支子水印星为用，丈夫对自己还是不错的，比较关心体贴。
          官杀不显不透，也可以财星为夫，因为财星是生官杀的，且命局为正财格，年干和时干己土正财星从月令丑土中透出，可以将己土视为丈夫。
          天干两个己土正财争合甲木日主，年干己土被卯木截脚，有劫财夺财之象，早年很容易经历的失败的感情。
          夫星入墓，要大运流年冲开墓库，才可以得到这个夫，2027丁未年，地支丑未相冲，解了原局的子丑相合，丑土官杀库被冲开，可以遇到缘分。
          大运分析：20岁-29岁走的是己卯大运，此大运天干己土被地支卯木截脚，为劫财制财的大运，可以赚到钱，但求财辛苦，忙碌，付出多，比较辛苦，天干三个己土去争合甲木，一方面事业上付出较多，收获不成正比，另一方面容易遇到失败的感情，要注意避免被表象欺骗迷惑，地支子卯相刑，子水印星受损，考学运不好，保护神受损，也容易受伤。
          30岁-39岁走的是庚辰大运，此大运为财杀相生的大运，天干庚金冲克甲木，地支子水印星见辰入墓，压力会比较大，开支花销多，容易有事业工作的变动，运势不稳。子水为寿元星，且日主被冲克，地支卯辰相害，卯木根受损，甲木为日主，无根怕有根，有根怕损根，要注意意外伤害，手术之事，身体健康很容易出问题，但如果从医的话，可以化解这部分灾祸。用神全部受损，财运自然很差，印星入墓也要注意母亲身体健康。
          40岁-49岁走的是辛巳大运，此大运天干辛金被地支巳火截脚，为食神制官的大运，容易对丈夫挑剔不满，夫妻之间很容易犯口舌，婚姻环境不理想。地支巳火去生财，身弱不担财，则求财辛苦，且巳火为驿马星，则比较奔波劳累，需要付出很多才可以得财。
          壬午大运，地支午火被天干壬水盖头，天干丁壬相合，壬水被合拌，地支子午相冲，子水印星逢冲，印星被合帮扶力量不大，而地支伤官被冲事业财运容易有些时好使坏的不稳定波动，或者容易有些过失失误发生要很重要，同时丁壬合自己也有些想法计划，努力的话可以有些小发展提升，大的提升还需要更多的坚持努力才行，另外，地支相冲也要适当注意身体健康。
          癸未大运，天干癸水被地支未土截脚，力量不是很强，但印透出生日主，对命局运势发展也是有些帮助的，只是地支丑未冲，财逢冲与地支印相克，也会有相应的支出破耗消耗，事业财运也是较一般的，也要多注意理财。同时财星制印，地支子未相害，子水受损，也要注意身体健康。
          人生不如意十有八九，一个真正优秀的人，不会因为外界的不如意，而轻易改变自己的信念，根据外部环境的变化，随时调整自己的应对措施，不惧困难，迎难而上。
          `
  }]
}

const 亥时 = {
  公历: [{
    甲: '2000-01-07 22:00:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   伤官   日元   劫财',
  天干: '己(土) 丁(火) 甲(木) 乙(木)',
  地支: '卯(木) 丑(土) 子(水) 亥(水)',
  遁藏: '劫财   正财   正印   枭神',
  大运: '戊寅，己卯，庚辰，辛巳，壬午，癸未，甲申，乙酉，丙戌，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3297.html',
    命主甲: `在某新一线城市三甲医院作为实习护士工作，越发的迷茫与纠结，临近毕业了，我在考虑转行，原生家庭情况不大好，母亲希望我踏踏实实成为一名护士，我也努力的去适应过，但实在过得很疲惫，心力交瘁。我更想追求自己喜欢的事业。
          这几年里我遇到过好几段感情，现在处在沉淀自己的空窗期，即便过去受过不少伤但我仍相信爱情的。
          `,
    珠玑: `八字分析：甲木日主生在丑月，年干透出己土，为正财格，丁火伤官生财，地支亥子丑八字较为寒冷，甲木有印有刃身强，刚好用丁火伤官泄身生财为用。
          事业分析：命局地支亥子丑三会水局，印星较旺，月令本来丑土财星，不但不能制印，反而被合化为印星局。
          印星旺而无制，印星为忌，会体现出印星的负面作用，一方面做事依赖性较强，害怕吃苦和困难，做事缺乏耐心和坚持，而内心也会比较敏感，遇到事情反复纠结，顾虑多，给自己造成比较重的思想负担，特别是遇到一些安全性的问题，忧虑会比较多。
          月干虽然透出伤官，但伤官力量不强，地支三会印星局，很多时候容易不开心，闷闷不乐。
          甲子日出生，甲子为六十甲子之首，这一天出生的人，再加上月干丁火伤官，年支又见卯木羊刃，性格也体现为权欲较重，比较固执执拗，倔强，有时候容易钻牛角尖。
          丁火伤官透出，也不安于现状，想法非常多，但地支三会印星，又偏于保守，自己也会内心矛盾，纠结，给自己带来一些困扰。
          地支印星较旺，代表母亲对自己事业生活，干涉会比较多，虽然自己想做点自己的事情，但又不得不听母亲的话，虽然可以得到母亲疼爱，只是印旺无制，这种疼爱是有些过度的。
          但甲子日出生，日坐子水正印，也会体现为仁慈善良的一面，有一定爱心，月干丁火伤官高透为用，也代表自己可以付出，适合依靠一技立身。甲木日主坐子水之上临天医贵人，《命理通鉴》讲到：天医拱照，可为良医。从事医学方面是适合你的。
          加上子水临太极贵人，也可以从事服务行业，或传统文化相关行业也是很适合，也可以去做以上行业，可以考虑心理医生，发展中医方面等等，总之丁火伤官为用贴身，能把专业知识和技术学好，对事业发展较为有利。
          甲子日出生临天赦，这种组合不论喜忌，也表示一生会避免很多灾祸，容易逢凶化吉，也可以在关键时刻得到贵人相助，为吉的一面，尤其是临天乙贵人，更是如此，为命中有福之人，一生平安，也表示自己很适合造福于人，多付出多奉献较好。
          月令丑土财星化印，只有年干己土为正财，己土得丁火伤官生扶，为伤官生财，但己土坐卯木之上被截脚，为劫财夺财的组合，天干虽甲己相合，正财合身，丁火也生财，代表能得到这个财，只是财坐劫财，财不太大，而财在年，故而是可以在国家及国企事业单位做事发展的；而财虚不旺，故能上班求财最好，也要注意和身边人的金钱往来，防止钱财破耗。
          婚姻分析：命局不见官杀，只有月令丑土暗藏辛金正官，但地支亥子丑三会水局，辛金正官跟着丑土一并化水，且丑土临寡宿，这种组合代表姻缘较弱，即使经历感情也很容易多败少成，错失缘分，另一半容易离开自己，也容易因为感情而受伤。
          日支婚姻宫为子水忌神，又亥子丑三会，子卯相刑，婚姻宫动荡不安，表示夫妻感情不太好，容易感情冷淡，夫妻之间矛盾较多，易有隔阂，婚姻有一定压力，能选择晚婚是比较好的。
          辛金正官为用被化掉，又子水临红鸾和桃花，未来丈夫长相颜值虽然比较高，但条件一般，对你没什么帮助。
          2020庚子年，天干庚金七杀高透，地支子水临桃花和红鸾，异性缘分较好，但多为偏缘，又乙庚相合，对方很容易劈腿或离自己而去。
          后面几年的感情运来看，要等到2026丙午年，子午相冲，天喜入命，2029己酉年，甲己相合，酉金正官和己土一并被合入，酉金临桃花，这两年有遇到正缘并结婚的运气。
          大运分析：20岁-29岁走的是己卯大运，此大天干己土被地支卯木截脚，为劫财制财的大运，此大运竞争会很大，贸然转行变动，不易找到理想的工作，容易四处碰壁，开支花销大，此大运建议是求稳比较好，不要有太多变动，否则不利于事业积累。地支子卯相刑，婚姻宫受损不吉，表示容易经历失败的感情，在婚姻上不会太顺利。
          30岁-39岁走的是庚辰大运，此大运为财杀相生的大运，天干乙庚相合，乙木被合克为吉，事业上竞争变小，地支辰土财星来制印也为吉，总体运势有起色，事业上有一些机遇，可以展露才华，做出一定成绩，但卯辰相害，也要注意和身边人金钱往来，钱财易破耗。
          40岁-49岁走的是辛巳大运，此大运天干辛金被地支巳火截脚，为食神克官的大运，天干丁火见辛金为伤官见官，事业上要注意口舌是非，也要注意婚姻家庭矛盾，容易对丈夫不满挑剔抱怨。地支巳火临驿马，巳亥相冲，驿马逢冲，求财比较辛苦，走动奔波较多。
          50岁-59岁走的是壬午大运，此大运地支午火被天干壬水盖头，为枭神制伤官的大运，天干丁壬相合，丁火伤官被合拌，运势较为低迷，表示才华受阻，心情容易压抑，甚至抑郁，贵人运较为缺乏，阻碍较多，丁火为命局寿元星，被制要注意身体健康，尤其是心脑血管方面。地支子午相冲，婚姻宫逢冲，夫妻之间易有矛盾纠纷，要注意婚姻变动。
          你的命局组合来说，地支印星旺，虽然透出伤官但力量不够强，即使换一份工作，也会有不开心，闷闷不乐地方。
          追求自己喜欢的事业，和能够让自己糊口的事业，两者要分清楚。你所学专业是护士护理，做其他的必然会专业不对口，也没有工作经验，加上你工作的第一步大运不太好，如果贸然转行，必然会四处碰壁，更加泵东。
          当你自己能量不够的时候，能够让自己选择的机会不多，更多是别人选自己，这个时候要踏踏实实做事，积蓄能量，等自身能量足够强大，再谈去做自己喜欢的事情。
          对你来说，临近毕业能够到一线城市的三甲医院实习，有这个城市最好的医疗资源让你学习，算是一个好的起点，这个工作也是适合你的，建议实习期间好好表现，争取能够留在医院工作。
          从学校投身社会的过程中，必然会经历捶打和磨练，毕业后三年是人生的关键时期，学会放低身段、沉下身心、转变角色、精学业务，才是应该有的正确心态。
          `
  }]
}

export default {
  巳时,
  亥时
}
