const 申时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1996年三月初四15时50分'
  }],
  十神: '枭神   偏财   日元   食神',
  天干: '丙(火) 壬(水) 戊(土) 庚(金)',
  地支: '子(水) 辰(土) 子(水) 申(金)',
  遁藏: '正财   比肩   正财   食神',
  大运: '辛卯，庚寅，己丑，戊子，丁亥，丙戌，乙酉，甲申',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/306.html',
    命主甲: `从小到大都命运多舛，从05年父亲车祸成了残疾人，那时我两姐弟也还是小学生，整个重担都压在妈妈身上，一边供我们读书一边还要支付爸爸的医药费，那时候受尽同学的欺凌亲人的白眼。
          现在的我从事着护理专业还是临工，本想着能顺利靠到编制到时候工资高了就能跟妈妈一起担起这个家跟弟弟昂贵的学费，谁知考试失利，到后来的遭男友分手，再到护师考试也失利，各种的不顺利。认识的男生也很难发展成男女朋友，即使成了也都会分手。
          父母亲戚这边也各种给压力。还有就是在工作岗位上我还担任了一个小职位负责管理工作，下面的人也各种闹心，都支撑不下去了。
          事业上的不顺心，感情上的失利，让我越觉得压力大越来越怀疑自己，越迷茫，我到底何时才能走出困境考上我的编制，遇见那个对的人。
          `,
    珠玑: `八字分析：你的八字日主为戊土，戊土为阳干是不轻易从的，同时戊土生在辰月得令，辰月本气为戊土日主得强根，同时年干透出丙火，也有生助日主的作用，而八字天干金水相生，月干壬水克年干丙火，且丙火坐子水被戳脚力量打折扣。
          而地支申子辰三合水局，辰土又为水库，对日主的帮扶也会大打折扣，所以日主整体偏弱，喜生助的火土五行为用神，以金水的五行为忌神。
          事业分析：你的八字身弱，以年干的丙火偏印，和月令的辰土比肩为用神，其他都是金水五行为忌神，忌神的力量大于用神的力量。比劫为隐身，而比劫可以代表是你的兄妹，同辈的朋友，同事等，
          你的八字月令为辰土比肩，本来是好的，但是地支申子辰三水局，比肩被三合为财，原本的用神被化掉，也说明比肩的帮助力量打了折扣，兄妹朋友同事帮不到你什么。
          而年干透出的丙火为用神，但是丙火坐下是子水财星，月干透出壬水财星克丙火，年干的用神被克，且年月的忌神力量强，也说明你的出身条件不好，长辈父母对你帮助不大，且没有什么贵人运，很多时候需要自己亲力亲为去完成。
          同时八字印星被克，八字财星非常旺为忌神的病，也代表父母的健康容易出问题，有些克父母的信息。
          整体来说，你的八字忌神过旺，用神又被克制，对你整体发展是不利的，同时你的八字财星过旺，财旺也代表欲望和追求大，说明你非常在乎钱财，对钱财非常渴望，但是八字身弱，又没有有力的印星比劫来帮身，财过旺，容易物极必反，难以把握住钱财，身弱不担财的情况会更明显，容易为适合和钱财的事情烦恼，困扰，为了事业钱财劳心劳力。
          八字财旺透出克印星，印星和比劫可以代表你的事业，财旺克印，也代表你对工作环境待遇会非常不满意，发展中遇到的困难阻碍也比较多，而财旺是官杀的元神，所以财过旺也很容易导致你的人际关系不和谐，压力，招惹小人等。
          结合你的大运走势来看，早年的大运走的不是太好，其他大运组合也是属于有利有弊，整体格局层次一般，属于比较普通人好很多的类型，达到小康或稍好些还是可以的，家里的经济条件也会得到改善，能够帮助到家里。
          而学业方面，你的八字以印星代表学业，年干的丙火偏印在八字中无根，又被财旺克印，所以代表你的学业发展是不利的，考试方面也是非常容易失利，结合你的运势来看，想考上编制很难，一定要考的话，在2024年-2026年学习运相对旺些，可以好好努力下。
          婚姻分析：你的八字子水为婚姻宫，婚姻宫为忌神，且忌神得时支的申金食神生助，同时地支申子辰三合水局，忌神力量更旺，婚姻宫的环境是不太好的，说明对象对你的帮助不大，出生条件不会太好。
          同时你的八字官杀星不显，而乙木正官代表夫星，暗藏在辰土之中，地支本身水比较旺，还有三合水局，水是很旺的，所以乙木夫星藏在辰土中属于水多木漂的状况，乙木是小木小草，就好像乙木正官就像漂在水上的水草一样，正官的力量是比较弱的，属于浮木无根，无根之木心性多变，不稳定，也代表谈感情容易多变，感漂浮不定，对象比较难以留住。
          同时你的八字财旺克印，也说明你为人会比较现实，有时候要求多，欲望大，控制欲望，得不到满足的时候也会比较小气，有时比价固执，不易改变，自我，易忽略对方感受，也造成在感情相处中不和谐，不利感情发展，婚姻组合不太好，婚姻来得晚且难成。
          大运分析：16岁-25岁走的是庚寅大运，大运增加八字食神的力量，地支七杀冲食神。食神旺去生财，代表你容易为事业而不断的努力付出，但比较辛苦忙碌的运气。而七杀冲食神，八字大运中的食神被冲动，代表你的是想情绪不太稳定，想得东西也会比较多，烦躁不安，
          对事业有不满的情绪，容易会招惹口角是非，平时支出花销也是不少的，属于踏实辛苦付出的运气，但回报不明显。而此大运，太岁大运天比地冲，七杀星被冲，七杀为偏缘，又被冲，所以此大运遇到的桃花不太正，也不稳定，不利感情的发展。
          26岁-35岁走的是己丑大运，大运劫财干支一气帮身，大运可以制水，打破僵局，刑冲火土金流通相生的局面，整体财运都会有好转，钱财收入会增加。且容易获得他人的帮助，可以尝试多团结他人，借助他人的帮助，来发展自己的事业也是不错的。但是大运丑土是湿土，不是太好，因为地支子丑合容易水土相混而滋生些不太稳定的问题和矛盾、及一些破财问题。同时也要注意人际关系。但总体而言此大运你的财运会有明显好转。
          感情方面，此大运干支一气为土为喜神，对水有一定的克制作用，同时婚姻宫子丑合也代表男女之合，所以此大运有结婚信息，只是此大运为劫财大运，所以也要注意提防些烂桃花或对象移情别恋的情况发生。而从你的感情结婚运看，你在2023年和2025年夫星出现的时候，容易有感情结婚方面的运气，特别是2025年的时候官印相生的时候机率会更大些。
          36岁后面的戊子大运，大运与日柱伏吟，比肩帮身对你的事业还是有帮助的，但财星伏吟，要注意下钱财开销破财方面，用心努力的话，还是会有所收获的，但切记不要避免因为心生烦躁，厌烦而不想工作，导致事业不稳定，调整变动的情况
          丁亥大运，八字正偏印全增加八字印星力量，使得天干财不克印，事业财运也会有所好转，只是地支财旺，所以还是会有些忙碌，付出多及钱财破耗。
          丙戌大运，天干地支用神力量旺，对你的事业财运会更加有利，获得的发展收获也会更大，但是大运与八字枭神夺食，在做事特别是大决定额时候，注意避免些失误，过失导致的问题。晚年走的是喜神运气，对八字也是比较有帮的，晚年的生活还可以。
          你的原八字格局组合不太好，八字身弱财旺，用神又直接被忌神克，而且财旺克印，代表你对事业容易不满，付出多收获少，财来财去。
          好在你26岁后开始走生助日主的运气，事业财运会慢慢好转，虽然大运组合上不太完美，会比较辛苦忙碌，为财奔波付出多，但大运对你事业求财还是有帮助的，整体命运属于小康左右层次。
          `
  }]
}

export default {
  申时
}