const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1989年九月十二日11点30分'
  }],
  十神: '正财   比肩   日元   七杀',
  天干: '己(土) 甲(木) 甲(木) 庚(金)',
  地支: '巳(火) 戌(土) 辰(土) 午(火)',
  遁藏: '食神   偏财   偏财   伤官',
  大运: '乙亥，丙子，丁丑，戊寅，己卯，庚辰，辛巳，壬午，癸未，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3327.html',
    命主甲: `我2017年结婚，目前育有一女。婚姻状况时好时坏，自己的事业比老公好一些。老公，比较安于现状，或者说有些不思上进。但这不是我们矛盾的中心。我始终觉得他并不那么爱我。生完孩子后，矛盾也更多了。
          （去年年末，他精神出轨了，在网上撩陌生的女孩子，被我发现后，恼羞成怒，找了各种理由解释，不过，后面我觉得没什么实质出轨，也原谅了他。）
          我和老公矛盾的中心在于他经常不顾事实，是非不分地维护他的妈妈，对我态度极差。我的心里非常痛苦，夫妻矛盾重重。我很想离婚，但是处于畏惧世俗的眼光，顾及幼小的女儿，总想着，看开就好，也许一切就是命运，忍着没有离婚。
          `,
    珠玑: `八字分析：甲木日主生在戌月，为偏财格，辰戌冲土越旺，又有已、午火生，火干土燥，辰中癸水受克严重。戌月透己土，甲己合土，虽有比肩从中作乱，但七杀庚金透出克掉比肩，甲木无气只得从财。
          事业分析：八字为从财之格，喜见食伤来生财，也喜走食伤和财星大运，顺从弱势，方为吉祥，不喜见太多官杀。结合你的大运走势来看，早年走的是乙亥大运，丙子大运，为北方水运，弱不受生，大运反背不吉。现在走的丁丑大运，顺从弱势为吉，未来转东方木运，大运又反背，是较为不利的，中晚年行财和食伤的运气，顺从弱势为吉，晚年吉祥。
          八字地支辰戌相冲，又为食伤生财的组合，时干庚金七杀贴身，代表个人事业心比较强，人比较上进，财星可以代表是一个人对事业名利的追求，一般从财的人，野心和欲望比较大，对求财比较执着，偏财当令且逢冲，人比较精明，但也容易缺乏耐心，有时候偏急躁，这是要注意的。
          地支食伤生财，时干虽见庚金七杀，但庚金被午火截脚，伤官制杀，不是很适合管束太多的工作，相对自由一些的行业较为适合你，食伤星来生财，也有一定经商头脑，地支辰戌相冲，二者相冲，也有交换之象，故运势不反背的时候可以考虑做点生意，也有一定财运，有担大财的运气。
          不过，大运一旦破格的话，八字用神就会变为忌神，食伤生财，财多压身，会因为求财而产生很大压力和很多烦恼，也会为了生计而辛苦求财，操心操劳，且可以得到的财也较为有限，事业财运的起落，和心情的起落都比较明显，接下来走的戊寅大运，己卯大运均破格，故能稳定求财是上选，现在走的丁丑大运顺从弱势，可顺势而为，步子迈得大一些。
          从长远来看，有两方面的选择，一方面，食伤生财，未来身弱难以胜财，可以趁现在学习钻研一门过硬的技术，以对冲未来的风险，可以考虑设计策划，咨询销售，培训服务等方面工作，能进大一些的平台发展较为有利，在求财上也不宜太过执着，尽力就好。
          另一方面，未来走的是戊寅，己卯大运，地支寅卯木比劫帮身，大运反背，身弱难以担财，也很难得到这个财，财富等级不会高，为财来财去，过路财神的运气，相对适合从事些行政管理，人力资源，经营销售及一些服务性质强的工作及技术相关的职业工作，财会金融工作的话其次。
          婚姻分析：八字为从财之格，五行之气较为极端，有时候性格脾气略为古怪，也有偏执的一面，财星当令较旺，财星相冲，财为情根，又食伤生财，故情欲较重，容易多情，在感情上愿意全身心付出，不过对于感情，有的时候付出越多，越放在心上，越容易因为回报不对等，心理落差，而不利感情关系，也容易因为感情不利而内心受到伤害。
          八字月令戌土暗藏辛金正官，时干庚金为七杀，为透杀藏官的组合，故在感情上不够坚定，容易动摇。时柱庚午，为伤官制杀的组合，戌土暗藏的丁火伤官来制辛金正官，这些组合均表示婚姻较为不利，和丈夫相处久了容易不满抱怨，也容易有口舌之争。
          命书曰：女命辰戌冲不良。意思是女命逢辰戌相冲，易有婚灾。当然任何断语都要结合个人命局综合判断的，不然有失之偏颇之嫌。结合你八字来看，辰戌相冲，婚姻宫逢冲，又甲辰日出生临寡宿，天罗地网，太极贵人，又伤官制杀，这些综合来看，也为婚姻不利。
          庚金七杀坐午火桃花之上，表示丈夫有劈腿外遇的潜在信息，要特别注意。女命以偏财代表婆婆，八字从财，戌土偏财当令较旺，日坐辰土也为偏财，偏财旺而入婚姻宫，又辰戌相冲，代表婆媳关系不太好，而且婆婆会对自己婚姻干预较多，这方面也要注意。
          大运分析：30岁-39岁走的是丁丑大运，此大运为伤官生财的大运，八字从财，顺从弱势为吉，代表事业财运较为不错，事业有发展的机会，也有一定财运，可以赚到钱，要好好把握。天干丁火伤官高透，丁火来制庚金七杀，为伤官制杀的组合，表示婚姻较为不利，夫妻不和之事居多，只有忍让包容维护婚姻稳定。
          40岁-49岁走的是戊寅大运，此大运天干戊土被地支寅木截脚，为比肩制财的大运，地支寅木为甲木日主的禄神，比肩帮身，弱不受生，大运反背不吉，身弱难以胜财官，会因为求财、事业和丈夫产生很大压力和烦恼，事业上求稳是最佳选择，钱财上适可而止就好。好在地支寅午戌三合，解了八字辰戌相冲，故婚姻感情要稍好一些，夫妻相对和谐。
          50岁-59岁走的是己卯大运，此大运天干己土被地支卯木截脚，为劫财制财的大运，地支卯木劫财帮身，大运反背不吉，依然难以担财，求财比较辛苦，收获有限，能退则退为好。地支卯辰相害，婚姻宫受损不吉，婚姻有一些压力，平稳过渡为好。
          `
  }]
}

export default {
  午时
}