const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '伤官   正印   日元   食神',
  天干: '癸(水) 己(土) 庚(金) 壬(水)',
  地支: '卯(木) 未(土) 申(金) 午(火)',
  遁藏: '正财   正印   比肩   正官',
  大运: '戊午，丁巳，丙辰，乙卯，甲寅，癸丑，壬子',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/312.html',
    命主甲: `守着财库钥匙的银行行长八字
          `,
    珠玑: `八字分析：庚日生未月，透己，杂气正印格，印旺身强，不喜官杀，得泄，或耗。
          喜食伤泄身，或财制印。
          运喜水木。
          初步看，原局层次就有中产，大运配合好，可以小富。
          庚申日主，坐下申禄，天干食伤，都是命主的体。
          看申和壬到底做了什么事情，就可以看出命主的意向。
          卯申暗合，壬午自合。
          看卯木正财的位置和出处，卯木在年支，并且是从月令未中出来的，
          月令未，是木火库、财官库。未是贵人星，被正印定义，那么这个未肯定就是国家单位了。
          卯申暗合，说明命主追求稳定工作、领国家工资，卯申暗合还有金融象。
          壬午自合，食神合官，命主想得到午火这个官星，午火在时支，但是午火是月令的未送到家里来的，与公家有关系，有职务。
          而月令财库被正印所定义，财库带着印帽子，管理财的象，也是权力的象。
          所以能当领导。
          命主丙辰运进了银行。
          乙卯运，财合身，升行长。
          甲寅运，总体看也是好运，但是此运后五年的寅运略差，冲了禄，又碰上三刑流年，有麻烦。
          癸丑运，会再提升，因为开财库的钥匙来了。
          注意：这个八字午未合，是闭库，但是走乙卯甲寅运的时候，财自己跑出来了，所以库闭不住。
          乙卯、甲寅运总体来说还是好运。
          癸丑运，直接来了开库的钥匙，当然也是好运了。
          注意：这个八字午未合，是闭库，但是走乙卯甲寅运的时候，财自己跑出来了，所以库闭不住。
          乙卯、甲寅运是好运。
          癸丑运，直接来了开库的钥匙，当然也是好运了。
          `
  }]
}

export default {
  卯时
}