const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '食神   正官   日元   比肩',
  天干: '癸(水) 丙(火) 辛(金) 辛(金)',
  地支: '酉(金) 辰(土) 巳(火) 卯(木)',
  遁藏: '比肩   正印   正官   偏财',
  大运: '丁巳2岁，戊午12，己未22，庚申32，辛酉42，壬戌52，癸亥62，甲子72',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/304.html',
    命主甲: `2020年7月去检查，结果发现子宫hpv超标。及时发现，及时治疗，就能大事化小，小事化无。
          `,
    珠玑: `八字分析：此八字辛日生在三月，金有湿土相生，年酉金，时辛金相助，日主不弱，时支卯木，主肝胆，金克木，所以判断此人肝胆功能比较弱，金多水浊，也就是说妇科容易不干净，大运行己土运，土克水，妇科容易得病，流年庚子年，子卯三刑，为无礼之刑，不小心会出现手术的迹象的。
          此八字丙火为正官星，八字有两个辛金，一丙合两辛，在情感方面容易出现竞争对手，婚后老公很难一心一意对待此命主。
          `
  }]
}

export default {
  卯时
}