const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1993年一月四日卯时'
  }],
  十神: '正官   七杀   日元   七杀',
  天干: '壬(水) 癸(水) 丁(火) 癸(水)',
  地支: '申(金) 丑(土) 未(土) 卯(木)',
  遁藏: '正财   食神   食神   枭神',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/337.html',
    命主甲: `在工作后感到前所未有的迷茫，2020如今这个尴尬的年纪缺的不是吃苦和勤奋，而是一个正确的方向。
          2019在去年的时候我的感情事业都很糟糕，我感受到了各方面的压力，甚至抑郁了去看了精神科，从事的工作看不到什么前景，感情也出了很大的问题，和女朋友有了很大的分歧，当时我真的被这些事情烦死了，一个人坐在家里会发上好久的呆，今年和女友长谈了一次，算是好多了， 但是事业上还是老样子，也不知道何时会有起色。
          `,
    珠玑: `八字分析：日干丁火在丑月出生不得令，又坐未土克泄自身，同时未土中有丁火的弱根，时支卯木为偏印。月干和时干都为七杀克泄日主，年干透正官坐正财生旺，故官杀为忌神，时支卯木为偏印可以生身，八字以印比为用。
          事业方面，由于八字的用神为印星和比劫，但是却没有比劫来帮扶，只有卯木偏印和日支的藏干来帮扶，加上卯未为半合，时柱杀印相生可以制杀，但是印星和比劫力量很小，八字的格局不是很高。
          另外八字中有年干壬水这一正官，还有月干和时干两个七杀，属于官杀混杂，你为身弱之命，所以为官杀无制，命局层次再次降低。
          由于官杀也代表阻碍，所以你不管做什么事情，都不会那么的顺利，会遇到很多的阻碍和反对，在事业上容易被人排挤，不被领导看重，自己比较的辛苦和劳碌，但是却得不到什么回报，很难有发展成就。加上官杀在上，食伤在下，克泄严重，说明你的压力是很大的，
          当然这其中也有你自己给自己的，因为地支食伤很旺，说明你内心迷茫且有很多的想法，官杀很旺克自身，你是无法承受这些压力的，往往会选择逃避。
          但是在事业上你十分的好高骛远，急于成功，所以是很迷茫且无助的，去年你走的是劫财大运，又是伤官流年，所以有很明显的伤官见官，在八字中，有时候伤官是可以代表动的，伤官克正官，正官为当前的环境，伤官是很旺的，所以会有明显的变动。食伤又太旺，没有很强的比劫来泄，日主又被官杀克制，所以去年克泄严重，精神是很不好的。
          大运分析：你在24岁-33岁走的为丙辰大运，此大运虽然有劫财来帮身，在表面上看是不错的，但由于地支为伤官，且大运与年柱壬丙冲，引动了官杀局，地支申辰来拱七杀星，所以此大运官杀星很是猖獗，并且是无制的，劫财对自身的帮扶力量是很小的，在事业上压力很大，同时也有小人干扰，也会招惹一些不必要的麻烦，是劳碌、奔波的大运。
          此阶段一定不要急于求成或者逃避现实，轻易的放弃自己。由于大运劫财坐伤官，在感情中也是十分波折的，有很多的竞争者，财星为妻子，婚后财星到位，说明官杀变强，所以你的压力更大，婚姻会带给你更多的不安。你在28岁时是有结婚之运的，所以一定要抓住机会。
          你在34岁-43岁走的为丁巳大运，为比肩大运，对自身的帮助很大，大运和年柱相合，八字中的官星被制，时柱的七杀也被制，所以改善了两者混杂的局面，且比劫之力很大，所以这十年你的发展很好，会有很大的提升。
          由于大运也有驿马，所以你的走动变多了，依然是很辛苦的，但是回报也是不错的，只是这十年对感情不利，由于一直忙于事业，所以在感情上会忽视另一半，对其不顾关心，所以平时要多照顾妻子的感受。
          你在44岁到53岁走的为戊午大运，此大运与八字形成了伤官见官，午未合火，旺了日主，所以你会获得一些小成就，另外大运也制服了官杀，所以你会更加积极的去求财，也能有很不错的收获，但是也会显得有些冲动，急于求成，还会得意忘形，所以要注意在事业上与人发生口舌纠纷。而大运的比肩合入了婚姻宫，所以婚姻也是容易生变的，对感情是不利的。
          总的来说，你八字的层次一般，而由于大运的原因，你在34岁之前会有很多的困难和阻碍，这一阶段一定要勇敢的面对困难，调整好自己的心态，做好人生的规划，等到你34岁之后大运就会转好，虽然你八字的格局不算好，但由于此时大运对你的帮助很大，所以过得会比普通人好上很多。
          `
  }]
}

export default {
  卯时
}