const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1993年一月十一日卯时'
  }],
  十神: '枭神   正印   日元   伤官',
  天干: '壬(水) 癸(水) 甲(木) 丁(火)',
  地支: '申(金) 丑(土) 寅(木) 卯(木)',
  遁藏: '七杀   正财   比肩   劫财',
  大运: '甲寅，乙卯，丙辰，丁巳，戊午，己未，庚申，辛酉，壬戌，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3102.html',
    命主甲: `山西运城，性别男。我在十几岁的时候母亲得病去世了，后来有了后妈和弟弟。我后妈是那种不算坏但是对你也不好的那种人，她做点事就连小到做饭，也要让全家人动手帮忙，要让全世界知道她的好。所以我并不喜欢回家，常年基本都是一个人在外或跟朋友一起。
          我爸做古家具生意的，我后妈帮他打理。在我亲生母亲去世之前我家生意做的很好，后来因为母亲生病生意就没落了，这些年又渐渐有了好转。
          大学期间就跟朋友合伙开宾馆，起初赚了钱，但是因为对方不作为，我也就没心思打理了，后来就不干了，赚到钱也都花了。毕业后我来了广州跟朋友一起做潮牌衣服 赚点小钱也还可以。但是后来也是因为钱的问题，我决定离开朋友自己单独做了。现在跟另一个朋友在抖音上搞运营，投的钱还没赚回来。
          2021年谈了一个女朋友，我们很聊的来，她的性格也很让我欢喜，给了漂泊的我家的感觉，很喜欢她觉得她就是我要找的另一半。但是她家里人都不赞成我们在一起，因为我各方面条件她家里人都看不上，看不上我的家庭也看不上现在没有经济实力的我，就连我的外貌也遭到嫌弃。
          我深知必须为了她改变现在的经济状态，所以即跟朋友一起探索新的赚钱方式，又自己单独做。
          `,
    珠玑: `八字分析：甲木日主生在丑月，丑土的本气为己土，主要起到耗身之用，但丑为湿土，暗藏癸水，对甲木有些生扶作用，甲木坐下寅木得地，寅木为甲木的禄神和强根，帮身力量较强，时支卯木为甲木日主的羊刃，也来帮身，力量不弱，年干壬水和月干癸水来生扶日主，壬水坐申金之上不弱，申金得丑土生扶，时干丁火来泄身，
          且丑土生申金，申金生壬水流通有气来生扶日主，丑土被寅木所制，甲木虽失令，但依旧为中和偏旺之命，金虽克身，但在地支喜见，在天干不喜见，金来生水不吉。
          事业分析：甲木为大树之木，在丑月出生为寒木，寒木喜向阳，喜见丙火来暖身，命局不见丙火，时干丁火也可起到暖身之用，但丁火较丙火略逊一筹。甲木较旺，也喜见庚金来剪除枯枝败叶，年支见申金为吉。月令丑土为用，但丑土来生申金，申金生壬水，用神化忌不吉，只有时干丁火来泄身，但丁壬遥合，丁火被合拌不吉。
          结合大运来看，早年走的东方木运，即将转南方火运，运势向好，只是命局比劫不弱，印星也透出，格局层次一般偏好些，会经历一些坎坷波折，但总体趋于和顺。
          甲寅日出生，日坐寅木比肩，时支卯木劫财，比劫较重，且寅木和卯木来制丑土正财，比劫制财，丑土暗藏己土，寅木暗藏甲木，甲己相合，寅木和丑土暗合，有比肩夺财之象，投机心理较重，喜欢走捷径，容易急于求成，而欠缺考虑去做一些风险大的事情，求财容易剑走偏锋，这是要注意的，在投资上要谨慎求稳。
          甲木日出生，日坐寅木比肩为忌，时支又见卯木羊刃，时干丁火伤官透出，性格比较固执，个性也较为刚强，做事容易冲动，自尊心比较强，好面子，不喜“摧眉折腰”，比较争强好胜的一个人，这种性格是一把双刃剑，好的一面在于比较有事业心，不服输，不好的一面容易固执己见，不能兼听则明，缺乏婉转容易在社会上碰壁。
          甲寅日出生，日坐寅木为驿马，年支申金也为驿马，寅申相冲，驿马逢冲，是一个比较勤快的人，闲不下来，日支和太岁相冲，年柱可代表家乡，日柱可代表自己，快马加鞭，是外出发展之象，也代表很多时候比较奔波，难稳定下来，申金七杀临驿马，代表事业不太稳定，比较多变。
          日坐寅木为禄神也为驿马，禄马相逢，且甲寅日出生为日禄，时干丁火伤官高透，伤官入门户为吉，是衣食无忧的命，但寅木和丑土暗合，构成比肩夺财，寅申相冲，寅木禄神逢冲，钱财上容易有破耗，不太适合和人合伙求财，容易发生不快的事情，加上丑土财星空亡，命里财富不大。
          年干壬水为偏印，月干癸水为正印，一般而言，男命正印和偏印同见，容易有“两个母亲”，除亲妈外还有后妈，或者干娘等。命局丑土空亡，丑土中暗藏的癸水正印也跟着空亡，癸水坐丑土被截脚，母亲和自己缘分不深。
          婚姻分析：八字丑土正财当令，身旺以财星为用神，对象一般不会差，能遇到不错的女人，也代表女方家境不错，但丑土被寅木所制，且丑土来生申金，申金来生壬水，忌神制用，用神化忌，婚姻宫为忌，未来妻子对你帮助较为有限，大多时候爱莫能助。
          地支寅木和丑土暗合，构成比肩夺财，土木相战，且时干丁火伤官难以来生助丑土正财，丑土又空亡，夫妻之间感情较为冷淡，夫妻之间感情不够好，容易发生矛盾冲突。地支寅申相冲，婚姻宫逢冲，不利婚姻，容易变动，故而晚婚为吉。
          婚姻宫为寅木比肩，婚姻宫的环境不太好，婚姻宫是妻子的所在地，也代表妻子在婚姻家庭中会待的不自在，不太开心，夫妻之间感情容易僵化。
          寅木暗藏戊土偏财，偏财星到妻宫，月令又见丑土正财，对待感情不太坚定，加上寅木临驿马，对感情容易心猿意马，三心二意，这是要注意的。
          你现在走的是丙辰大运，地支辰土为偏财，有异性缘分，地支寅卯辰三会，会动婚姻宫，解了命局的寅申相冲，可以遇到正缘。今年辛丑年，地支丑土正财出现，命局丑土填实，且天喜星入命，遇到的人有机会定下，好好把握。
          大运分析：21岁-30岁走的是丙辰大运，此大运为食神生财的大运，行火土大运，总体运势相对和顺，但地支寅卯辰三会，卯辰相害，辰土偏财星被合克，构成比肩夺财，不适合与人合作求财，很容易亏损，也容易遇到不太靠谱的人，导致合作有经济矛盾和纠纷，步步为营比较好，不要去做成本高，风险的的事情。
          2021辛丑年，地支丑土正财星填实命局丑土，财运尚可，但丑土和寅木比肩暗合，有比肩夺财之象，今年投入的钱较难回本。
          2022壬寅年，天干丁壬相合，丁火伤官被枭神合克，丁火为财源受制，财源不广，能赚到的钱较为有限，地支寅木引动命局寅申相冲，寅木禄神逢冲，且寅木来制丑土和辰土，暗示不宜合作，投资需谨慎小心，容易破耗，申金七杀星逢冲，工作容易变动。
          31岁-40岁走的是丁巳大运，此大运干支一气为食伤，行南方火运，则总体运势较为和顺。但天干丁壬相合，丁火伤官被合克，地支寅巳申三刑，丁火和巳火食伤星受损，暗示财源较为一般，能赚到的钱较为有限，走三刑大运要注意下避免官非口舌，寅木禄神受损，也要防破耗，火土旺的年份运气才比较好些。婚姻宫被刑伤，要注意妥善化解婚姻矛盾，注意家庭和谐。
          2023癸卯年，行水木印比，地支卯木劫财来制丑土，则财运较为一般，不宜合作，容易破耗。
          2024甲辰年，辰土被甲木盖头，比肩制财，地支寅卯辰三会，卯辰相害，比劫夺财，投资很容易亏损，之后的年份运气才相对好些。
          41岁-50岁走的是戊午大运，此大运为伤官生财的大运，总体运势不差，地支午火来丑土财星，且寅午拱火，午火伤官财源被合入，财运有所提升，但地支丑午相害，丑土财星受损，钱财上有进有出，很难存住钱，财富很难积累。
          后面的己未大运，干支一气为正财星，天干甲己相合，正财合身，命局身旺，甲木日主在地支有寅木强根，可以担财，能够得到这个财，财运不差，但地支丑未相冲，财星逢冲，也表示钱财上花销不小，中晚年财富等级较为一般。
          真正能攀登高峰的人多是可以一步一个脚印沉淀自己的人，今天沉淀多少决定你未来收获多少。
          `
  }]
}

export default {
  卯时
}