const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1989年十一月二十二日辰时'
  }],
  十神: '七杀   正财   日元   正财',
  天干: '己(土) 丙(火) 癸(水) 丙(火)',
  地支: '巳(火) 子(水) 丑(土) 辰(土)',
  遁藏: '正财   比肩   七杀   正官',
  大运: '乙亥，甲戌，癸酉，壬申，辛未，庚午，己巳，戊辰，5岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/390.html',
    命主甲: `父母都是普通人，在家里排行老大，还有个弟在读大学，家里生活费和我弟读书费用也要负担！十几岁就开始去外地打工，有过一段婚姻，可是不长久，现在带着小孩一起过！到现在事业也没有，收入也不高！
          `,
    珠玑: `八字分析：癸水日主生于子月，为建禄格，一般来说，禄神如果不被破坏，就是一个有福禄的八字。八字子丑合，丑土克子水，丑土坐日支直接克身，算是比较厉害的七杀。
          而且，局局七杀既无食伤制，也无印来化，七杀无制为凶，这种不利的信息一直跟随着日主，导致事业和婚姻的不顺。天干又是两个丙火财星生助七杀，可以说日主孤立无缘，没有护佑，有没有机遇全看大运了。
          事业分析：癸水日主虽然有子水强根，但是被财星，官杀克耗，癸水日主有些偏弱，八字财官杀旺，代表对钱财欲望大，同时也是比较踏实诚恳做事办事的一个人，没有太重的心机。八字身弱，且财生官杀旺，又不太流通，在人际关系交流上一般，会有些过于老实，不懂得变通，而影响到做事，以及给人的印象，遇到困难阻碍的时候，也会有些感到无奈。
          年柱己巳财生七杀，时柱丙辰财生正官，且财星又透出月干，日支为丑土七杀，喜用神只有月令子水，虽得令，但地支和天干都有克耗的五行，帮扶力量上打了折扣。属于日主身弱，财旺生官杀旺而为忌的组合，难以承受住财官杀的力量，在事业求财上遇到的困难阻碍会比较多，也会有比较多的开支破耗。容易钱财不稳定波动和流失，没有太多的积蓄。
          财星得强根透出，且没有起到好的作用，同时又去生助官杀星克身，既没有比劫制财，也没有印星化官杀，或者食神制杀，八字原局层次是不高的。结合大运来看，后面一路走的是比劫正偏印的运气，对你的运势发展有生助作用，格局层次会有些提升，能够比普通偏好些的水平。同时后面走比劫，正偏印的运气，也可以获得些人的帮助。
          八字日主偏弱，财透出生官杀，财生官杀没有起到好的发展作用，同时官杀无制，又无印星化官杀，难担起财官，做生意是不适合的，比较适合上班，且适合求稳发展比较好些，往有些小管理方面发展也可以。
          婚姻分析：丑土为婚姻宫，婚姻宫与月令相合克不化，婚姻宫为忌神，没起到好的帮扶作用，同时正偏财两透，财去生官杀星，正财为妻星也没有起到好的作用，八字宫位和妻星都为忌神，婚姻组合不是太好。同时财星在地支有根，透出天干生官杀，也代表在婚姻当中不太和谐，婚姻容易给你带来比较多的压力和烦恼，妻子也较容易对你有些不满情绪，导致吵架矛盾而不利婚姻。
          年支为正财，月干也为正财星，时干丙火也为正财，而年支为第一任妻子且月干的禄在年支，故而是同一个人。而丙火时干为你的第二任妻子，丙坐辰库为比肩库，代表你的第二段婚姻会娶一个有过婚姻的女人，从你的结婚运来看，八字财生官杀，而日主弱，日主的生助且泄耗掉官杀力量时有遇到及结婚的运气，2021年太岁与大运八字巳酉丑三合，官杀流通，财星天干逢合的时候有再婚的运气。
          大运分析：25岁-34岁走的是癸酉大运，此大运天干得禄，地支合印局，化官杀的力量，对你求财有帮助，但同时也会比较忙碌辛苦付出多。
          35岁-44岁走的是壬申大运，此大运地支子申半合水，天干劫财帮身，日主力量增加，可以更好的对抗官杀，对你八字运势是有帮助的，能够有进一步发展，只是天干壬丙冲，开支花销也会比较多，容易财来财去。地支土金水流通，天干劫财旺，感情也会有不稳定波动，容易滋生矛盾，同时要注意其他异性与另一半走的过近。
          辛未大运，天干杀印相生，对你的运势是有帮助的，但地支丑未冲官杀力量增加克日禄，同时也会有些压力和不稳定的波动，开支花销还是不少。婚姻宫逢冲导致感情不太和谐，容易有冷战，分居，甚至婚姻危机。
          庚午大运，天干杀印，地支财生官杀，且冲月令，同样属有吉有凶，容易患得患失，运势一般。
          己巳大运吗，财生七杀，与年柱伏吟，属于明显的忌神运气，运势不太理想。
          你的八字属于日主偏弱，财星得根透出，官杀旺而透出的组合，日主虽然得令，也有一定的事业心上进心，但财透出生忌神官杀星，用神力量微薄，难担起财官杀，八字原局层次不高，事业提升会比较缓慢，也容易招惹小人，遇到困难阻碍。
          相对好的是中年后开始走比劫，正偏印的运气，对你的运势发展有帮助，日主得生助可以增强地支官杀的力量，格局层次能得到些提升，只是中年后期晚年的运势组合不算很好，大的发展就没有，建议是求稳发展，尽量找往大的平台靠拢，依靠平台的力量，增加自己的稳定性和抗风险能力，整体属于普通偏好些。
          `
  }]
}

export default {
  辰时
}