const 巳时 = {
  公历: [{
    甲: '1987-03-23 09:10:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   食神   日元   食神',
  天干: '丁(火) 癸(水) 辛(金) 癸(水)',
  地支: '卯(木) 卯(木) 未(土) 巳(火)',
  遁藏: '偏财   偏财   枭神   正官',
  大运: '甲辰，乙巳，丙午，丁未，戊申，己酉，庚戌，辛亥，壬子，5岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/512.html',
    命主甲: `出生在辽宁法库的一个农村家庭，性别女，早年家庭波折不断，从记事开始父母就经常争吵打架，我爸爸脾气很坏，经常打我妈妈，我妈妈性格也很刚烈。后来母亲出轨，我3岁半左右父母离婚，我被爸爸送到爷奶家跟着爷奶生活，从此就与父母远离了。现在和爷奶的感情最深，父母各自成家，虽然偶尔有联系也和陌生人差不多。
          4.5年级时候读书成绩还可以还当过班干部。到了小学六年级98 99年就感觉对数学有点吃力，以前解多难得数学题都很简单，不知为什么越来越糊涂没了思路大脑一片混乱。到了中学往后就一落千丈了。2005年参加成人高考，考取了辽宁一所学校的专科，2009年参加专升本考取了吉林一所学校的本科，念的法律专业。
          2007年被人追求过，不过很不顺利2年后分手了。2011年再次遇到感情，对方是广东人，12年我从老家来到广东找对方，对方开始说的很好，会支持我帮助我。我当时快要本科毕业了准备努努力考研。
          来到广东后对方就叫我不要再想着读书了，怂恿我做生意创业赚钱，找工作也不顺利，各种原因形式所迫13年开始从家里要钱创业，对方和我说好一起出资，最后也没出钱。对方条件也很不好，我也不去计较了。创业期间承受了难以想象的巨大压力，最后失败告终，损失了一点钱。现在回过头想自己那段日子真是超级蠢，太幼稚了，在当时的环境下也确实没办法。
          后来15年开始不再乱折腾，在当地的法律服务机构帮工。18年萌生出考法考想拿律师资格的想法。19年没有准备的情况下裸考没通过。19年和广东对象分手了。16年也出现过追求者，当时有对象拒绝了。目前一心想通过这个考试，也是我唯一的出路了，压力也是很大。
          2021年也就是今年5月份遇到了一个92年阳历9月19的，但是我现在工作事业不稳定，考律师也是压力很大，目前我经济条件也不是很好。对待感情有心无力，不想连累对方同时又不想失去，很矛盾。现在被事业前途情感困扰，自己又是很要强的人不甘平庸。
          `,
    珠玑: `八字分析：辛金日主生在卯月，为偏财格，年支也为卯，又有癸水生，偏财很旺。丁为七杀，在未和已中有强根，财旺杀旺，癸水食神偏弱。八字整体木火旺，金水弱，取财较为艰难，要等到大运助力才有作为。
          事业分析：八字偏财较旺，但无比劫来制财，忌神无制，格局层次一般。
          命局卯木偏财较旺，在地支伏吟，是一个有野心和想法的人，月干癸水食神去制年干丁火七杀星，事业心较强，人比较上进。天干癸水食神高透相随，比较崇尚自由，多喜欢投资创业，八字偏星较旺，内心比较不安分，难以长期坚持去做好一件事。
          天干透癸水食神相随，命局有食神生财的组合，多为手艺人，八字先见丁火七杀，再见巳火正官，为官杀混杂的组合，多从事偏门冷门的事业，八字身弱无依，喜一技傍身。
          癸水去制丁火食神，为食神制杀的组合，从事法律相关行业是适合你的。八字喜印，可以努力考取律师资格证，对你的运势和事业发展帮助很大。
          命局官杀混杂，偏星较旺，时支巳火正官星临驿马，事业工作比较多变，不容易稳定下来，比较奔波动荡。
          卯木偏财得令较旺，身弱不担财则求财非常辛苦，需要付出更多努力才可以改变经济窘境。日支未土为木库，也为财库，日坐财库则衣食无忧，小财还可以，但大财难求。
          身弱喜印，日支未土为枭神用神，但被卯木财星所制，为财星制印的格局，则不利学习，考学运较差，难以获得高文凭和学历。枭神贴身为用，也有考取二流院校，成人大学，民间技校之意。
          你现在走的丁未大运，杀印相生，旺了印星，今年辛丑年，印比帮身，要好好把握，争取上岸。想提升学历也要把握住今年，否则就要等到2028戊申年以后了。从现在起要多努力，45岁后一路走的土金运，运势很好，可以有相对不错的发展。
          婚姻分析：八字卯木偏财较旺，异性缘分不差，追求者不少，人缘较好，比较注重物质，在感情上比较喜欢追求刺激。天干癸水食神相随，比较爱慕虚荣，有食神制杀的组合，也是一个慷慨豪爽的人，时支巳火为驿马星，对待感情不容易定性，也容易相信人。
          八字先见丁火七杀，后见巳火正官，为官杀混杂的组合，早年容易遇人不淑，经历失败的感情，但好在癸水食神去制杀，虽遇不良人，但难以对你造成太大的伤害。时支巳火临驿马星，多为远嫁他乡，外地成家。
          日支未土为用神，未来丈夫对你关心体贴较多，夫妻感情较好，对你事业帮助较大，但被财克，打折扣。今年辛丑年，地支丑未相冲，流年太岁冲了未土婚姻宫，可以遇到缘分。
          大运分析：35岁-44岁走的是丁未大运，此大运为杀印相生的大运，今年进入该大运第一年，总体运势不差，未土枭神得丁火生扶有力，助身力量较强，可以考虑去考证或提升学历，但竞争比较大，需要付出更多努力，2021辛丑年，2028戊申年，2029己酉年，2030庚戌年考运都不错，好好把握。但丁火七杀星高透，身边小人不少，事业上压力较大，也要注意“烂桃花”来骚扰你。
          45岁-54岁走的是戊申大运，此大运行土金运，运势较好，天干戊土印星高透助身，地支申金劫财去制财，事业上运势较好，可以得到贵人相助，财运有起色，可以考虑去大一点的平台发展，或组件团队一起发展。
          55岁-64岁走的是己酉大运，此大运为土金大运为吉，天干己土印星高透助身，地支酉金去制财，事业和财运都有进一步的发展。但地支卯酉相冲，酉金禄神逢冲，身体健康不好，要注意。
          后面的庚戌，辛亥大运，庚戌大运，印比助身为吉，总体运势较好。辛亥大运，天干辛金比肩帮身为吉，地支亥卯未合木局，未土寿元星化忌，身体健康不好，巳亥相冲要注意丈夫身体健康。整体命局，属于先苦后甜的组合，格局层次在后面大运发展中也会提升。
          `
  }]
}

export default {
  巳时
}