const 巳时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1989年七月初九酉时'
  }],
  十神: '正官   比肩   日元   伤官',
  天干: '己(土) 壬(水) 壬(水) 乙(木)',
  地支: '巳(火) 申(金) 寅(木) 巳(火)',
  遁藏: '偏财   枭神   食神   偏财',
  大运: '癸酉，甲戌，乙亥，丙子，丁丑，戊寅，己卯，庚辰，辛巳，11岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/488.html',
    命主甲: `我从2018.4离职到现在一直在家看孩子，不过这中间我婆婆和我妈帮我轮换着看孩子，只是她俩都属猪，我属蛇，不知道是不是真的命里犯冲，所以矛盾都特别多，之前我的脾气也不好，加上那几年生活很曲折，心情不好，所以矛盾更大。目前是老大上幼儿园，老二由我妈看着，我在家学习PPT设计。
          因为我从3岁到7岁跟我奶奶爷爷生活，其实我很讨厌自己的童年，因为没有快乐可言，也造成我成年后的很多缺点，所以我很坚持孩子必须在我身边，不能送老家，所以问题来了：老人来我家帮看孩子的困难很多，不仅仅是可能会有婆媳矛盾，而我看孩子没收入，光靠我老公一个人，基本没有存款，就很焦虑。
          虽然我觉得自己很有学习设计的天赋，但因为我刚学PPT没多久，短时间不可能赚到钱。我也没精力找其他兼职，我老公就提出把老二送老家，他的意思是以后都放老家，或者上幼儿园之前都放老家，我很痛苦，因为我不想我的孩子也像我一样缺乏安全感，可能也是我确实不想离开她。但我也没有办法反驳他，他说的确实是解决问题的最简单的方法，因为确实他工作也很努力，也不能把经济压力都让他一个人背。
          目前我的积蓄都花光了，所以偶尔还是会焦虑。有段时间我像疯了一样的学习PPT,没有时间照顾家里，当时就我婆婆一个人照顾老二，时间长了我老公就有意见了，我知道他上班很累，但我也在努力让自己更好啊，但矛盾就是很多，有次吵架他说：你自己像打鸡血一样，不能让所有人都跟你一样那么累吧？
          于是我就怀疑我是不是真的错了？我也很憋屈，我就想找一份能兼顾孩子和收入的事情做，没有收入怎么证明我是对的？怎么能够有能力把孩子放自己身边？但目前确实没有好的发展，我老公的意思就是以后把俩孩子都送回老家，这样我就能上班，啥问题都解决了！
          很多事情都是做的虎头蛇尾，我怕我现在的困境是我不够努力造成的。我之所以没有去找个体力活儿，不是因为我怕苦，就是我觉得精力应该花在让自己更好的事情上，就是想让自己多学习，目前还没到山穷水尽的地步，照顾家人已经分散我一部分精力了，再找个兼职，我不知道还能不能坚持学习PPT,或者这些只是我对自己“偷懒”的借口？
          `,
    珠玑: `八字分析：壬水申月，为偏印格。支坐食神，偏印夺食了，这偏印得制，用什么制？已申合！两已合一申，制得太过了。而且寅已相穿，食神受伤严重，食神代表一个人的精神的福气，肯定会有所损伤了。夫宫受穿，天干伤官见官，婚姻也会受累。
          事业分析：地支巳申相合，寅巳申三刑，寅申相冲，寅巳穿害，一片刑冲克害，地支代表内心，也可以说内心是不平静的，内心比较苦闷，也比较纠结，时常不开心。
          申金枭神得令，时干乙木伤官透出贴身，有三刑，性格比较固执要强，容易以自我为中心，从自己的角度出发考虑问题，而不能站在全局，或考虑他人的感受。
          在工作中和婚姻中也容易犯口舌，与人发生口角。八字带三刑的人很容易翻脸不认人，这是最大的性格缺点，不利于人际关系，在工作中难得到领导和同事的偏爱，在修德上要加强。
          月支申金得令，三刑被刑克，在性格上体现为做事缺乏魄力，容易三心二意，瞻前顾后，难以善始善终，虎头蛇尾。这些性格缺点是要克服的，不管做什么三天打鱼两天晒网都难以成事。
          申金用神为用且受损，学业受阻，难以取得学历和文凭。申金印星生了月干壬水比肩，申金为驿马星，印生了其他人，没有生自己，主辛苦，驿马主奔波操劳，地支寅申相冲，为驿马逢冲，快马加鞭，为奔波求财之象，照此来看，不适合长期待在家里，外出求财会比较适合。
          年柱巳火正财去生了己土正官，日时也有食伤生财的组合，身弱食伤旺，为身弱财官旺之命，但身弱难以担财官，会被财官所累，工作上比较辛苦，却收获很小，劳碌命。且巳火财星在地支受损，也为财来财去不聚财之命。你走的大运多为财官大运，对你事业发展是不利的，烦恼较多。
          年柱为财官相生的组合，己土正官星去克了比肩，事业上容易遇到小人，不被领导待见，这是要注意的。由于命带三刑，要注意祸从口出，或口角是非，工作上要谨言慎行，少说多做为好。
          八字申金偏印得令，则也适合从事设计，规划，策划相关职业，做PPT也属于设计，需要一定的天分，是适合你的。原局食伤生财，身弱不担财，则是依靠技术吃饭的命，有了过硬的技术才可以立身立足，也适合从事办公室相关工作，不适合单干。印比为用也可以从事健康养生相关职业，而且你的身体不好，从事这方面工作也利于你为自己养生。
          婚姻分析：日支寅木为夫妻宫，寅木为食神，代表你对婚姻和另一半有自己的想法，要求较高。地支寅巳申三刑，且寅申相冲，寅巳穿害，地支没有水来生木，寅木受损严重，婚姻比较不顺，婚姻压力较大，夫妻感情不好，多发生口角争吵之事。
          你的性格缺点也是不利婚姻的，比较任性，不容易为他人着想，这是不利于夫妻感情的。有时候说话不顾及对方的感受，容易把对方伤害到。夫妻之间不去换位思考，离心离德很难婚姻美满。
          年干己土正官为丈夫，丈夫在年干、和日主之间隔了壬水比肩，这个正官不易被自己得到，也代表丈夫和自己之间有距离，夫妻关系不好。日坐孤鸾星，也为孤独之象，不利婚姻。
          八字官透而杀藏，夫宫寅木中暗藏戊土七杀，对待感情不够专一，对婚姻存有二心，容易在思想上出轨，有这个想法的话要尽量克服。天干有伤官克官的组合，也是不利婚姻之象，代表对丈夫不满，容易心生抱怨。
          日支寅木为食神，和月支申金枭神相冲，则成枭神夺食的组合，枭神夺食一方面代表心情不好，才华受阻，另一方面也不利子女，且日主壬水被食伤星忌神包身，说明其实你对孩子的帮助是不大的，小孩和你分开是有利于孩子的，也是有利于你的运势的。
          之所以你觉得小孩离开自己没有安全感，是私心作祟的结果，只要老人疼爱和自己适当分开也并非不可，时常去看看孩子也是可以的。
          健康分析：地支巳申相合，寅巳申三刑，且寅申相冲，且地支无土来生金，申金受损，代表健康受损，容易受伤，诱发一些暗疾，也容易遭受不幸之灾。要注意肺部，肠道，肾脏，妇科，肝胆方面疾病。
          大运分析：31岁-40岁走的是乙亥大运，此大运地支亥水出现非常不吉，四马星全，逢冲，加剧了刑冲克害。申亥穿害则申金用神受损严重，这步大运身体健康是非常堪忧的。天干乙木伏吟，构成伤官克官，此大运对婚姻也不利，争吵会比较多，事业上也会犯口舌，犯小人，压力较大。
          41岁-50岁走的是丙子大运，此大运天干丙火被地支子水戳脚，天干忌，地支为喜，事业有相应的发展进步收获，收入增加一些，要注意和他人金钱往来，提防被坑骗，也不能合作求财，财透天干也代表花销大，不聚财。
          51岁-60岁走的是丁丑大运，此大运为财官相生的大运，身弱走财官大运则会为财官所累，会因为工作和求财以及家庭给自己带来很大压力和很多烦恼，事业上阻力较大。而且壬水用神被合拌，要注意肾脏，妇科方面疾病。
          戊寅大运，己卯大运，均为土木的组合，要注意口舌是非，夫妻不和之事，晚年的压力还是不小的，也要注意身体健康。
          庚辰大运，天干庚金被乙木合拌，喜神难以发挥作用，地支辰土为七杀，也会有些不顺之事。
          你能意识到你自己性格缺陷和原生家庭有关，害怕孩子的成长受到老人家不好的影响，但你有没有想过自己是否就能很好的影响到孩子呢？你虽然能意识到，但摆脱不了受原家庭影响，克服不了自己的性格缺陷，对孩子成长来说也不是一个好的环境，带在身边，不过是一个新的轮回而已。
          可怜天下父母心，作为父母都希望能够给孩子提供好的物质条件，希望他们能够陪伴在身边，内心能够快乐成长，但你们目前只是维持生活开支的话，两者难以兼得，建议你还是优先考虑怎样去提高家庭收入，给孩子提供好的物质基础，而且自己和家中老人年纪大了，有一定积蓄，也能够应对风险。
          你描述的问题不是无法抉择的问题，只是你八字地支三刑，枭神夺食，对你影响是很大，容易自我为中心，不能站在全局，为他人考虑，想的太多，太琐碎，又不能解决重点，缺乏魄力而已。
          你命带三刑，所谓君子不刑不发，刑冲克害多，要多积德修福，那样对自己的运势帮助很大。
          尤其是性格上的缺点，自己后天多去反省克制改进，性格决定行为，行为决定命运，性格不去改变，那么事业家庭都会不顺。
          `
  }]
}

export default {
  巳时
}