const 申时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正印   正印   日元   比肩',
  天干: '乙(木) 乙(木) 丙(火) 丙(火)',
  地支: '丑(土) 酉(金) 子(水) 申(金)',
  遁藏: '伤官   正财   正官   偏财',
  大运: '甲申 癸未 壬午 辛巳 庚辰 己卯 9岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/55.html',
    命主甲: `在我们老家，我这个年龄的早都结婚生子了，父母总说我惹得他们被别人笑话了。现在本来就男多女少，谈不到对象我自己也急得慌。`,
    珠玑: `日元丙火生在酉月，秋季金旺，地支金水过旺都来泄耗日主，丙火在地支无气，天干有印比帮身，但日主失令且地支无根，整体八字偏弱。喜用神为木火，忌金水。
          日元丙火以金为财星代表妻子，命局中的财星申酉均逢空亡，暗示姻缘比较弱，婚姻来得晚。命中的妻子能力比较一般，对你帮助不大。你生在丙子日，这天又逢阴差阳错，更是代表感情不顺。
          财星被丑合住，时柱财星又被丙火去争夺，在感情上也容易有情敌竞争，或者会娶一个离过婚的女人。夫妻感情不深，以后婚姻中争吵较多，晚婚相对反而更能化解上述问题。
          2014-2024年走壬午大运，大运与命局天克地冲，逢冲则动，且冲动日支婚姻宫，大运又逢桃花，则表示桃花会进入你的生活，能有异性缘和姻缘进入。
          并且这步大运行南方火运，日主坐支，你的感情、财运都会好起来，整体运势都会好起来，但因为壬水盖头，则运势容易反复，多有起伏。
          在这步大运中的2021年，财星遇合，有天干丙辛相合，财星合入日主，婚姻可成，这年好好把握，就可以顺利成婚。
          2024-2034年走辛巳大运，大运巳火禄神坐支，日主丙火在地支得根得气，干透财星又有比肩制财，这步大运中运势很好，并且财星逢库地，财运亦佳。但大运与命局中巳酉丑三合，则有不利，尤其不利合伙，要特别注意。
          总体看来，你在现行大运和下一个大运运势呈上行趋势，2021年有婚缘。
          在你的八字中日柱是丙子，干支水火交战，日干丙火是你自己，日支子水婚姻宫为妻子，则说明夫妻两人生活中争吵较多，婚后要多为家庭付出，以此增进彼此的感情。
          你的日支婚姻宫为正官星，且是忌神，则配偶能力比较一般，个性固执倔强，容易自以为是。因为你的财星混杂且旺，更要给配偶安全感，才能使以后的感情更加顺利。
          `
  }]
}

export default {
  申时
}