const 未时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   偏财   日元   食神',
  天干: '丁(火) 癸(水) 己(土) 辛(金)',
  地支: '卯(木) 丑(土) 卯(木) 未(土)',
  遁藏: '七杀   比肩   七杀   比肩',
  大运: '甲寅4，乙卯14，丙辰24，丁巳34，戊午44，己未54，庚申64，辛酉74',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/353.html',
    命主甲: `食神制杀遇偏印，工作变换与前上司产生矛盾。
          `,
    珠玑: `八字分析：己土生卯年卯日，卯未半合，七杀专旺。七杀有制为偏官，无制为七杀，丑月土旺又是金库，辛金得时不弱，为食神制杀的格局。
          食神制杀年干却透出偏印，且偏印有根也不算弱，势必会对食神造成一定的克害，癸水偏财虽然可以一定程度护卫食神，但木土两旺，癸水克泄交加自身难保。现在行运丁火，也是偏印运，偏印为小人，所以这5年遇到小人的情况就会比较多。
          2020庚子年，伤官可以合制七杀，所以在工作方面会有一定的进步和提升，但子水一进来过程中就有很多状况发生了。子水和原局卯木、丑土、未土都能发生化学反应。子卯刑，七杀动而克身，七杀也代表小人，所以和前上司发生矛盾。
          原因是什么呢？原因就是子水，子水是偏财，因为钱的原因，偏财是日主所喜的，所以想得到更多的钱。
          此八字2020工作有变动，2021辛丑食神制杀工作会更上一层楼。
          `
  }]
}

export default {
  未时
}