const 卯时 = {
  公历: [{
    甲: '1993-05-06 6:00:00'
  }],
  农历: [{
    甲: '1993年闰三月十五日卯时'
  }],
  十神: '七杀   比肩   日元   七杀',
  天干: '癸(水) 丁(火) 丁(火) 癸(水)',
  地支: '酉(金) 巳(火) 亥(水) 卯(木)',
  遁藏: '偏财   劫财   正官   枭神',
  大运: '丙辰，乙卯，甲寅，癸丑，壬子，辛亥，庚戌，己酉，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/514.html',
    命主甲: `我是一个出生在农村的一个大山里的孩子本应该快快乐乐的生活，在学校里上学生活都很不错的但是正当我人生最得意的时候，也是每个人的人生最美好的时候风华正茂却因为意外导致左侧肢体不好使不会动，为了给我治病家里欠下了40多万元的债务，
          我想知道我以后还有没有好运以后靠什么去生活呢？比如意外之财如买彩票之类的财运呢因为我现在是一个残疾人了。
          `,
    珠玑: `八字分析：你的八字中间两个丁火，两边两个癸水，呈对称状态，癸为脚为下肢部分，已火为丁的禄，已酉一合被绊住受克。已火很重要，一冲一合，岁运引发肯定会出问题。
          事业分析：巳火劫财当令，丁火比肩帮扶日主，比劫对抗官杀，为人是较为固执的，地支虽有亥卯合，但巳亥还是有些冲的信息，有的时候会比较急躁，烦躁不安，月令巳火劫财合财，日时支官印相生，自己有事业心，但也会有些急于求成。
          年柱是癸酉财生七杀，癸水去克月干丁火，只是财生七杀与日主距离远，同时癸水七杀泄气，干支又逢官杀，官杀被印星泄，所以八字中的财星力量不旺，而且官杀的力量被泄，官杀的力量也不旺，官杀被印星泄，命里的财富能量不大。
          月令巳火劫财与酉金财星相合，又与日支正官有相冲的关系，又是驿马星，这样的组合，对你事业是不利的，暗示工作会不太稳定，也不利于事业开展，结合大运走势来看，开始几步大运不太好，发展被动且阻碍多。31岁后走官杀及后面的财运则比较有利，收入也会增加些。
          丁火日主偏旺，能任财官，但八字财星弱，没有食伤生财，同时财星去生官杀，官杀但被泄，官杀也不太旺，同时官杀多现混杂，适合学习一些技术方面的工作，冷门的行业，有一技傍身安身立命比较好些。
          你的八字逢双太极贵人，带文昌星，又逢杀印，官印相生，和玄学有一定缘分，可以学习，对你以后生活发展及安身立命也会有帮助。
          而命局有偏财，但财星力量不强，正财也不显，财运不太旺，切忌不要去做一些高风险投机的事情。八字有财星，没有财库，月令又是劫财星去合克财，很容易导致钱财的不稳定波动财来财去，注意理财。大运虽然逢财库，但是不算的。
          婚姻分析：年支酉金为偏财，正财藏在巳火中，正偏财都与巳火劫财发生关系，代表感情竞争阻碍大，结合你大运走势看，也没有走生助财星的大运组合，婚姻难落实，而婚姻宫亥水被巳火相冲，婚姻宫不稳定，另一半难留住，同时八字逢孤辰，巳火劫财冲婚姻宫，也是感情不顺，有些孤独之象。
          从你的运势看，婚姻机会是有，但不容易落实，和你目前自身情况也有关系，今年明年好好把握下。要不然要到2028年才有好的机会。
          大运分析：21岁-30岁走的是甲寅大运，为印星大运，生日主也生劫财，自己也会想得多，忧虑多，烦恼多，敏感，加上地支带刑，印比力量增加，事业被动缓慢，没有什么好的发展。
          31岁-40岁走的是癸丑大运，此大运地支巳酉丑三会财，而天干七杀，财生七杀，对你事业发展有帮助，收入会有所增加，付出也会有发展收获，只是官杀多现，且官杀混杂，开支花销也多。
          41岁后走的是壬子大运，属于官杀旺的运气组合，会相对稳定平稳些，但提升幅度不大，平时支出破耗，花销多，注意理财。
          庚戌大运，己酉大运，属于流通的运气组合。庚戌大运伤官生财，财星力量增加，己酉大运食神制杀，地支半合财星，也属于好的运气组合，晚年运还可以，可以安享晚年。
          风华正茂的年纪，遇到这样的变故，对个人的打击是很大的，除了身体上的打击，最严重的莫过于对心灵的打击，对过往事情的悔恨，对当下无助无力，对未来的恐惧，迷惘。
          对于你来说，身体上的创伤其实还是小的，更重要是你对自己，对未来失去了自信，这才是最可怕的。摧毁一个人，莫过于摧毁他的自信，如果一个人一点自信都没有了，那么不管做任何事都很难做好。
          对于你的经历，表示同情，但不管怎样，事情已经发生了，目前能做的，就是慢慢去接受现实，重新的去建立自己的自信。
          你的八字是适合学习一些八字命理方面的，可以慢慢去从事这个行业，我身边有认识从事命理的残疾人，他在八字命理上的天赋虽然不太高，但因为身体的关系，没有太多选择，在命理研究上下更多的苦功夫，更多时间去钻研，属于努力型天才，也取得不错的造诣。
          自己要慢慢去冷静思考下，为未来人生做个规划，清醒的给自己做个定位，虽然自己目前是残疾，但内心不要因为残疾，就觉得自己在社会上，处处理所应当要受到他人照顾。社会有他既有的运作规律规则，不会因为你的问题而去发生变化，也不要以为身体上的问题，而去想着走捷径。
          `
  }]
}

export default {
  卯时
}