const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '食神   正财   日元   偏财',
  天干: '丁(火) 戊(水) 乙(木) 己(土)',
  地支: '巳(火) 申(金) 巳(火) 卯(木)',
  遁藏: '伤官   正官   伤官   比肩',
  大运: '3丁未，23丙午，33乙巳，43甲辰',
  批注: [{
    作者: '大爱无疆mpmnom',
    出处: 'http://www.360doc.com/content/19/0815/14/63842938_855103276.shtml',
    命主甲: ``,
    珠玑: `乙木与地支中的关系，年日支都是巳火，是乙木的伤官，月支申金是官星，时支卯为禄神，比肩，年干为食神，月干为正财，有两个根源，身旺，时干己士偏财虚透无根源，乙木在天干中，有生无合，地支有合，妻宫巳火合月支申金，申上坐正财，一生中必得之妻，
          时干偏财，也是他的妻子，妻宫巳火，巳中庚金，合时支卯木，乙庚合，此命合申，又合卯，有了正财戊土，还想偏财己土，吃看碗里，看着锅里的。
          日主乙木在天干中，有克无合，乙木生丁火，食神生财，食神为技术手段，妻宫巳合申，申上坐财星，巳火伤官主技术手段，手艺，巳火合制申金为工作，申为钢铁，金属机械，是个搞电焊的，电焊工，财在年月宾位，给人打工的命(实际在厂里里当电焊工）。
          丙火大运食神生财，此运结婚，时柱己卯为财星，99年流年己卯，财星到了流年，此年结婚，2000年流年庚辰，庚为正官，正官为女，此年生女儿。 2007流年丁亥，亥冲妻宫巳，此年二人感情不好，亥为车，巳亥相冲，两车相撞，四月份出了车祸，车坏了，人无伤，十月份辞职。
          2009流年己丑，巳丑拱合，此年作起养鸡事业。甲辰大运，2011流年辛卯，辛为日主的七杀，七杀克身，卯表示日主乙木，辰也表示日主乙木，卯穿辰，自己与自己过不去，此年破财，改行。
          2013流年癸巳，癸是雨露生身，身旺生巳火，巳火为伤官，表示技术手艺，此年又被聘去当电焊工。
          2015流年乙未，未是身库，未中丁为食神为子星，此年生儿子，大运甲辰，流年乙未，比劫旺而克父，时柱己卯为父星，己土虚透，又被甲乙木合制，父星在天干地支都无立足之地，此年丧父，甲木为头，得脑血栓去世。
          2017流年丁酉，酉与大运辰合，合动了辰中乙木日主，大运甲辰与时柱己卯，天合地穿，他想得到时上偏财己土。己土坐卯，是有夫之妇，此年发生了外遇，出轨。己土不是正财，是命局中固有的，也是有缘分。
          2018流年戊戍，戊戍正财妻子，来到流年上，与大运甲辰天克地冲，自己外遇被妻子知道了，闹离婚。2019流年己亥，日主乙巳与流年天克地冲，此年本应离婚，但是离不了，戊土财星力大。
          在地支中，有两个根源，居月令，坐下官星表父母，是合制乙木的，待2020庚子，庚金出干，合制乙木，乙木未有还手的能力，又子破卯，破了时柱偏财，乱桃花就没了。
          `
  }]
}

export default {
  卯时
}