const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1994年三月十四日午时'
  }],
  十神: '伤官   偏财   日元   枭神',
  天干: '甲(木) 丙(火) 癸(水) 辛(金)',
  地支: '申(金) 子(水) 未(土) 酉(金)',
  遁藏: '正印   劫财   七杀   枭神',
  大运: '乙亥 甲戌 癸酉 壬申 辛未 庚午 己巳 戊辰，7岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/328.html',
    命主甲: ``,
    珠玑: `八字分析：癸水生于子月，辛酉金申金生扶，身旺，喜木火土，忌金水。
          能力强，有胆魄。脑子灵活反应快，有是非大局观念，做事比较认真细致，原则性强。缺点是有时候容易冲动，感情用事，不够冷静。
          命局以辛金正印为学业，结合未土中的己土七杀看学业事业发展，小孩的事业就是学习，八字正印忌神旺，学习上不够主动积极，有点偷懒，七杀用神旺，内骨子上进心还是蛮强的，只要年运吉利，走木火土旺的大运，学业事业就会顺利。八字中只有正财，正财不旺，一生虽然衣食无忧，但是想发财发富，有难度。
          大运分析：2012—2021年，乙亥大运，食神大运泄秀，学习还是不错的，11—17年。小学阶段（按国家上学年龄标准算），接受能力强，成绩不错，17—21年，初中阶段，学习压力增大。17，18年还是不错的，19，20年成绩进步不大，不过要考上比较理想的高中，应该没有问题。
          2020—2023年，高中阶段，20，21年学习成一般，表现平平，但是2022—2031年，进入甲戌大运后，命主开始发奋，成绩迅速提升，22，23年成绩不错，依我看，能够考上比较理想的大学。尤为吉利的是，23—26年，流年吉利，在大学能够学到广泛的知识，
          2027—2031年，财杀旺，多半不会深造，而是就业，就业顺利，工作遂心如意，收入较高，28年会有工作上的变动，工作量增大，事业压力增大，一直持续到31年，都是辛苦操心较多的年份。
          2032—2041年，癸酉大运，大运起伏较大，32，33年，小人不断，事业发展不理想，财运不佳。34—37年，命主有单干或者兼职单干的迹象，事业发展顺利如意，财运红红火火，我的建议是最好兼职单干，因为40，41年以后，事业走下坡路，破财之象，安心上班更为妥当，如果贪多求大，多半事倍功半，吃力不讨好。
          2042—2051年，壬申大运，事业发展平平，竞争激烈，财运不理想，想赚轻松钱很难，唯有辛苦求财，财利可得。这步大运安常守分最好，比较吉利的年份有：44，47年，其余年份难有多达发展。
          2052—2061年，辛未大运，大运开始转好，52，53年，事业财运不佳，54—59年，事业开始走上坡路，财运逐步回升，但也只是细水长流之财。60，61年事业财运处于平稳状态。收入一般。
          2062—2091年，庚午大运、己巳大运、戊辰大运，30年大运顺利如意，孩子们事业发展颇有成绩，对家庭帮助较大，晚年生活幸福富足，乐享天伦。
          适合学一门技术特长，适合从事金融、会计、财务之类的工作，从你的大运看，适合再企事业单位上班，不适合单干，有点怀才不遇，有志难伸的遗憾，建议调整心态，安常守分。晚年运势大吉，福泽绵长，足慰平生。
          `
  }]
}

export default {
  酉时
}