const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   比肩   日元   七杀',
  天干: '丁(火) 己(土) 己(土) 乙(木)',
  地支: '卯(木) 酉(金) 卯(木) 亥(水)',
  遁藏: '七杀   食神   七杀   正财',
  大运: '庚戌，辛亥，壬子，癸丑，甲寅，乙卯，丙辰，丁巳，戊午，5岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3105.html',
    命主甲: `出生在广西，在家排名老幺，小时候家境过得还可以，算是比较无忧。父亲一直都是做生意，但从02年那年家里就产生了变故，举家搬迁，然后那个时候上初中，读书也读不好，初中毕业就直接在本地读了所中专，中专毕业就早早的出来社会打工了。从辛亥大运起过得就很不顺，也倍感压力，因为家里父亲在做水产生意，一直在家帮忙，钱财收入也少。
          壬子大运后，也就是12年到14年出外地打工，做的是销售导购员，14年又回了家乡发展，15年找了份房地产销售去做，从15年到18年工作还算顺利，一直也都是做房地产，但是19年和20年收入就很差了，赚得不多，直至今年的六月份离职。
          现在年龄也越来越大了，想出来自己创业，但没想好做什么，现在失业中也想先找份工作度过困境，所以也在找工作中，总的来说今年过得很不顺，因为也在装修房子，钱财耗损得厉害。
          另外就是婚姻问题，父母也比较着急，至今还没结婚，以往相亲得次数不多，而且内心是有点排斥的，也一直没遇上合适的，相亲完后也没有了下文，不知道是本人独立惯了还是对婚姻的态度比较淡然，曾经也去算过命，算命先生说我容易不婚，只能找离过婚的或是大七岁以上的去化解。
          `,
    珠玑: `八字分析：己土生在酉月，为食神格。己卯日为天元坐杀，七杀猛如虎，纯杀在座下犹如抱虎而眠，因此必然具有过人的机智。年支卯木，时支亥水，亥卯半合木，财生而杀愈旺，食神制不住七杀。八字己土、酉金虽处月令，但势单力薄，七杀的坏处就会体现出来。
          事业分析：己土日出生，在地支无根气，一般来说缺乏缺乏根气的话，容易缺乏主见，而地支是酉金食神，食神可以代表一个人想法等，地支两个卯木来冲酉金食神，酉金为食神逢冲，也代表想法有时候容易多变，有时候不够坚定，做事不容易坚持，三分钟热度，半途而废。
          己土日主被乙木和卯木七杀贴身，虽然有丁火印星，但丁火在年干较远，难以起到化杀生身之用，七杀贴身克身，平时压力较大，思虑忧愁多，七杀为忌克身，也代表做事困难阻碍多，身边小人较多，工作环境不够理想，也容易遭遇是非。八字三个七杀为忌神，内心有一定阴暗面，容易负能量重，生活中遇到的事情，往往会往坏处想，也导致烦恼比较多。
          地支两个卯木来冲酉金，卯木为七杀，七杀代表工作和事业，事业变动较多，难稳定下来，地支六冲较多，也代表适合做一些经常走动外出的工作，到外地发展比较适合你，方位上选择南方，东北方，西南方比较旺你。
          八字七杀较旺，贴身攻身，虽有酉金食神来制杀，但一个食神势单力薄，双全难敌四手，制群杀难制尽，缺乏贵气，难以去管人，事业运平平，很难当“领头羊”。
          地支酉金食神来生亥水财星，为食神生财的组合，身弱财旺，且己土日主在地支无根气，难以担财，求财比较辛苦，加上亥水财星去生七杀，会因为求财产生很大压力和烦恼，也容易诱发灾祸，尤其是身体健康方面，求财的欲望不宜太大。
          八字食神生财，酉金食神临文昌贵人和学堂，酉金属兑卦，口才是不差的，日主为己土，己土有策划的意象，适合从事设计策划、咨询服务、销售相关的工作。八字身弱难担财，日主无根，创业不太适合，自己也缺乏主见，容易摇摆不定，这是做生意的大忌，上班为好。
          八字年柱代表早年，月柱代表青年，日柱代表中年，时柱代表晚年，年柱丁卯杀印相生，丁火为用，来生己土流通生入日主，早年可以得到父母疼爱，快乐较多。但地支两个卯木来冲酉金，青年和中年很容易遭遇大的变动，也代表个人不太稳定，波动较多。
          月干己土比肩可代表兄弟姐妹，月令酉金空亡，己土跟着空，代表六亲无靠，兄弟情薄，兄弟姐妹很难帮助到你，也代表身边难有贵人相助，己土比肩贴身，但己土跟着空亡，且地支卯酉相冲，也表示贵人虚而不实，表里不一。
          婚姻分析：八字不见正官，以七杀代表是丈夫，地支卯木七杀伏吟，时干又见乙木七杀，七杀也叫偏官，偏缘，偏缘就是不太稳定，或总有一些让自己不太满意的地方，在择偶上比较难遇到自己各方面的对象。
          七杀多且旺，对感情会要求高，有些完美理想主义，同时酉金食神去冲克卯木七杀，自己在择偶方面，一般人难入法眼。一方面难遇到自己满意的，一方面要求不低，导致感情婚姻难以落实。
          同时自己在感情上也会有些缺乏安全感，感情婚姻中容易对丈夫挑剔不满，而影响到感情婚姻关系，七杀多且为忌，容易遇人不淑，也要多方考量对方的人品素质，要注意烂桃花不太好的男人，
          八字七杀攻身，七杀为忌，酉金食神难抵群杀，且日支婚姻宫为卯木七杀，未来丈夫性格脾气不太好，甚至会有些家暴倾向，夫妻之间感情不太好，地支卯酉相冲，容易发生争吵矛盾，婚姻不太和谐。卯木七杀伏吟到婚姻宫，婚姻宫逢冲，感情婚姻容易发生变动，晚婚对你是比较好的。
          七杀较旺，得亥水而生，婚姻中容易因为另一半产生很多烦恼和压力，另一半对你没什么帮助。
          2022壬寅年，为财官相生的流年，地支寅木为正官，寅亥相合，正官动，且被合入门户，可以遇到缘分，2024甲辰年，天干甲木正官星透出，地支酉辰相合，解了命局的卯酉相冲，可以结婚。
          月令酉金食神代表女儿，命局不见伤官，单纯从你命局来看，女儿缘分相对较强。但酉金空亡，又被两个卯木相冲，子女缘分较弱，为晚婚晚育之命，时柱乙亥为忌神，子女发展一般。
          健康分析：月令酉金为食神，不管为用神还是忌神都不喜被刑冲，有刑冲则身体健康很容易出问题，地支酉金被两个卯木所冲，容易有病痛，很容易摔跤，四肢受伤，这是要注意的。
          己土日主被乙木和卯木七杀贴身，且难得丁火通关，造成七杀攻身，容易睡眠不好，加上地支卯酉相冲，容易受伤在身上留疤，身上如果有胎记或经常吃药要好点，可以避免大的伤害。
          地支卯酉相冲，要注意肝胆，以及一些经络，腰椎颈椎，肺部肠道方面的问题，己土虚透较弱，跟着空亡，也要注意脾胃方面疾病，己土日主被乙卯木克身太过，也要注意有胃病，要注意饮食规律健康。
          大运分析：35岁-44岁走的是癸丑大运，此大运天干癸水被地支丑土截脚，为比肩制财的大运，今年为该大运第一年，己土日主在地支有了丑土根，可以担财，依靠团队和他人力量，可以得财，财运有所改善，收入也会增加，但求财比较辛苦，天干癸丁相冲，丁火印星被冲克，暗示会因为房子之事花销较大。
          45岁-54岁走的是甲寅大运，此大运干支一气为正官，天干甲己相合，正官合身，地支寅亥相合，寅木被合入门户，此大运事业上趋于稳定，可以找到一份较为稳定的工作，稳定求财，但压力较大，比较辛苦劳累，财运较为一般，多为辛苦钱。
          55岁-64岁走的是乙卯大运，此大运干支一气为七杀，命局七杀本就很旺，再加上大运的七杀，加重了七杀攻身的问题，事业运较为低迷，做事阻碍较大，容易遭遇小人。地支卯木引动命局卯酉相冲，夫妻之间容易发生争吵矛盾，也容易对丈夫不满，婚姻易有波动。
          一个人的事业发展，和家庭出生，教育条件，个人能力有大关系，和自己的职业规划也有很大关系。
          如果把成功比做目的地，职业规划就是导航，出发前要规划好自己的路径，选择好自己要走的路，再出发。一个人如果能够比别人更早的有清晰的职业规划，往往能够有更好的发展。
          `
  }]
}

export default {
  亥时
}