const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1987年七月十七日酉时'
  }],
  十神: '七杀   枭神   日元   七杀',
  天干: '丁(火) 己(土) 辛(金) 丁(火)',
  地支: '卯(木) 酉(金) 酉(金) 酉(金)',
  遁藏: '偏财   比肩   比肩   比肩',
  大运: '庚戌，辛亥，壬子，癸丑，甲寅，乙卯，丙辰，丁巳，戊午，11岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/539.html',
    命主甲: `有时也研究一些八字知识，但我的悟力有限，希望能给点评一下我的生辰八字，八字身旺金旺，又是全阴命格，对于我的前途和命理走向，希望老师能给予解答一二。
          `,
    珠玑: `八字分析：辛金日主生在酉月，地支三个酉，金的气势很旺，丁火七杀透出有用，卯木为之杀的根气，受损严重。八字身旺无依也会一无是处，需要官杀来塑造制约，尤其对你的八字来讲，官杀是夫星，夫星太弱也不好。
          事业分析：辛金日主在地支有三个酉金帮身，酉金为比肩，且临将星，比较固执，要强，自我，不太听得进别人的建议，控制欲和占有欲较强，天干丁火七杀贴身，情绪比较波动，容易冲动，缺乏耐心，脾气不好，不利人际关系。
          月干己土为枭神不弱，八字纯阴，五行之气较为极端，比较敏感，多疑，疑心较重，喜欢猜忌，心眼不大，有时候会有一些阴暗的想法，这是要尽力克服的。八字缺食伤，则缺乏城府，容易直来直去，性格较为直爽果断。
          八字金旺，不见水来泄金，不够灵活，比较一根筋，但也体现为做事比较执着，有不达目的誓不罢休的品性，有利事业的发展。地支酉金得令伏吟，酉金也为禄神，禄神多而不富，较为劳碌，身体比较辛苦劳累。
          地支三个酉金冲克年支卯木偏财，造成比肩夺财，容易因为亲戚朋友而破财，也能投资做生意，破耗较多。八字不见食伤来生财，财源不广，求财不稳，特别是大运反背，命里财富不大。
          八字丁火七杀挂两头，有肃杀之气，八字身旺比肩旺，可以担杀，加上地支临将星，太极贵人，适合舞刀弄枪的工作，比如外科医生，整形医生等职业较为适合，时干丁火七杀坐酉金虚透贴身，进入门户，可以得到这个杀，有机会获得一定名气。
          你的性格比较有个性，与人相处容易不顺，对夫妻感情也有所影响，容易犯冲，容易忽视对方，缺乏关心体贴，单独从日柱是癸卯来看，和你日支相冲会不和，具体要看双方八字组合而定。
          子女分析：八字不见食伤，月干己土枭神较旺，地支三个酉金自刑，子女宫受损，子女缘分较弱，怀孕生子多借助丈夫的运气，酉金伏吟到子女宫，容易生双胞胎，大运反背，时柱为忌神，子女发展较为一般。
          大运分析：31岁-40岁走的是壬子大运，此大运干支一气为食伤运，天干丁壬相合，伤官去制杀，才能和智慧可以得到发挥与施展，总体运势不差，贵人运不错，地支子水去生卯木，财运好，能赚到一些钱，但子卯相刑，卯木受损不吉，钱财上花销也不少。
          41岁-50岁走的是癸丑大运，此大运癸水出现受己土克制，为枭神夺食的大运，天干己土枭神也去制癸水，地支丑土旺了酉金，运势受阻，事业竞争大，容易被排挤，财运一般，容易破财，也容易错失良机，加上地支三个酉金自刑，容易有心事反复纠结，想不开，甚至抑郁，也要注意官非和意外之事。癸水食神为寿元，要特别注意身体健康，尤其是肾脏泌尿系统方面疾病。
          51岁-60岁走的是甲寅大运，此大运干支一气为正财运，正财生七杀丁火，甲木财星去制己土枭神为吉，七杀生旺起来，身旺可担杀，可在事业上有所发展，能有一番作为，要好好把握，身旺可担财，则财运较好，但也要防比肩夺财之事。
          接下来走的乙卯，丙辰大运，乙卯大运，干支一气为偏财运，地支卯木引动命局卯酉相冲，禄神和偏财星逢冲，财来财去，要注意破财，也要注意肺部，肠道，肝胆方面，也要注意四肢受伤。
          丙辰大运，官印合身，运势较为顺风顺水，财运较好，晚年运势较理想。
          你的命格五行组合有些极端，八字金多金旺，建议有佩戴一个黑曜石材质的生肖猪饰品。二是在卧室的北方用一个圆形的鱼缸养六条金鱼。三是睡觉头朝北，多穿黑色或蓝色系的衣服。对你的五行运势会有调理帮助。
          `
  }]
}

export default {
  酉时
}