const 戌时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1991年十二月二十六日戌时'
  }],
  十神: '七杀   七杀   日元   伤官',
  天干: '辛(金) 辛(金) 乙(木) 丙(火)',
  地支: '未(土) 丑(土) 巳(火) 戌(土)',
  遁藏: '偏财   偏财   伤官   正财',
  大运: '壬寅，癸卯，甲辰，乙巳，丙午，丁未，戊申，己酉，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/365.htmll',
    命主甲: `本身对神奇又富有魅力的命理玄学十分感兴趣，奈何自己没有钻研、坐冷板凳专注搞学问的精神，又自觉没有极高的天赋和悟性，否则跋山涉水亲临您的门下拜你为师，穷尽毕生精力弘扬传统文化。
          我想这种心性也是因为八字的影响吧。奈何八字命理博大精深 我虽然也时常看自己的八字，但总是困于表面，龃龉不前，越看越困惑。
          有的人说我身弱不担财，有的人说我从弱，有的人说我七杀伤官混战，影响格局，哎！我好迷茫。希望大师能指点迷津！
          我之前的路就一直不温不火，2018年发生了很不好的事情差点把自己弄成了小残疾。戊戌年真的对我影响太大了。
          目前都快三十岁了 没有事业没有家庭，家庭条件并不是很好 也靠不上，父母很累，我想快一点赚钱让他们轻松点但总是没有能力去改变。
          感情上总是遇不到合适的对象，看到八字今年正官星显，但是这一年都快过去了，还是没有遇见什么合适的人。我好像能感觉到自己很受男性喜欢，也许他们看到的只是外表吧，但是我想成为一个靠实力被尊重而不是被亵渎的女性。
          总是遇见一个又一个烂桃花，但是似乎原则底线总是把持不住，明知没可能还是沦陷。我讨厌这样的自己，我知道作为一个女性，七杀和伤官俱旺并不是一件完美的事，我为此深感痛苦。
          我毕业后一直在姑姑家公司上班做外贸，见惯了生意场上虚伪的嘴脸，明明我可以借此机会学习成长的，但是我总是拒绝成长，感觉好像毕业四五年还没真正迈入社会。不想再这样继续下去了，想走出去，真正地脱变和成长。
          目前在准备法考，希望老师看一下我做律师可以吗，去深圳发展怎么样，我相信命运，但是我不会屈服，我想我一定要改变现状，我希望自己成为一个有能力的女人，可以庇护我关心的人。
          `,
    珠玑: `八字分析：此八字既不是身弱不担财，更不是什么从格，就是普通的七杀格，生在偏财月，又是七杀库，七杀双透天干气势非常强。当然，此七杀有伤官合制，但丙火在丑月不得时，虽然有已火、戌土为根，但气势完全不能和辛金相比，所以八字就是七杀制不住的问题。
          七杀代表事业、压力和不顺，和伤官结合也代表残疾、流血等事件，女命七杀伤官相战也不利于感情，而且日坐伤官合的都是七杀，正官无法进来，所以出现烂桃花也是正常现象。
          事业分析：八字伤官在日主周围，同时伤官生财，财星旺，可以代表是你的事业心，以及物质的追求，同时八字伤官合克七杀，也代表你事业心和欲望是比较大的，也有不屈不挠的精神，不怕困难。
          但是七杀克日柱，反被伤官合克，说明你不喜欢约束太多，且八字年月财生七杀，七杀是比较旺的，七杀克日柱，也代表你容易焦虑，急躁，顾虑多，想得多，容易造成自己压力大，导致遇到压力，挫折的时候，会心生退意，不能很好的坚持下去。
          财生七杀克日主，又有伤官来克官杀，有时会在社会压力之下显得有些无奈，伤官又代表自己不想认命，想在逆境中求发展的，所以也经常会内心矛盾。
          地支伤官生财，丑未戌三刑，刑旺了土，财星旺克印星，同时八字透出双七杀，七杀为凶神，财旺又去生七杀，财耗日主，七杀克身，也说明你脾气不好。
          年月代表是出生，也是父母宫位，年月为忌神，说明出生条件不是很好，父母长辈对你帮助不大，面临的压力也是比较大的。
          地支财旺生七杀，也代表你容易为求财奔波忙碌，为财所累，地支丑未戌三刑，身弱财旺而不担财，虽然有伤官去合克七杀，但是难制尽，七杀也代表灾祸，要注意一些大额的钱财来往，以免是非经济纠纷。
          七杀为凶神，且七杀旺克身，制七杀为要，七杀被伤官克，组合上对你有帮助的，不过制不尽，确容易出现身体健康的问题。
          八字七杀为凶神，制七杀是最重要的事情，八字透出伤官，伤官合克七杀，七杀有制但制不干净，且伤官在日支得强根，伤官主教育培训，销售，而七杀和伤官也较符合法律，律师的特性，是可以去往律师发展的，而且律师的工作也是和是非打交道，
          开有一定程度上化解你八字所带的问题，做律师适合你的。从方位看，深圳及东方，南方区域城市也适合你发展。
          明年辛丑伏吟月柱，且引动丑未戌三刑，又是甲辰大运，八字四库全，且逢冲七杀三现克日主，地支财旺，健康也是要注意的，有条件的话给自己买份保险，同时也要注意家中长辈健康。
          婚姻分析：巳火婚姻宫是代表女命配偶的地方，巳火是伤官，伤官是克女命夫星的，同时伤官透出在时干，对婚姻是不利的。加上七杀双透在年月，正官不显，七杀也代表偏缘，烂桃花，同时财星生七杀，也代表是对感情的付出，对感情是愿意付出的，但有时候也不太懂得拒绝烂桃花，造成感情上的困扰。
          婚姻宫伤官生财生助忌神，七杀双透为忌神，也比较难遇到自己各方面都满意的对象，出身条件不算太好，不过婚后可以通过自己的努力，能够提升生活经济水平，不过对你帮助不太大。
          你的八字七杀旺必须制化官杀，且日主得生助有强根时，才有利于你把握住财官，官者为女命夫星。在2023年天干杀印相生，地支卯木见乙木的禄神帮扶日主时可以遇到，且有结婚运气。
          对象身高中等偏上，身体结实，脸型方圆，肤色不白不黑，略带黄，五官端正，长相普通些，眉毛浓密，眼睛不小，双眼皮，嘴唇不厚，身高在178厘米左右。
          大运分析：22岁-31岁走的是甲辰大运，甲木帮身，辰土为湿土可以生养甲乙木，大运天干盖头地支，对你求财是有帮助的，但地支辰土，与八字辰戌丑未全，引动地支四土相刑冲，容易财来财去不稳定，同时四土相刑冲，也要注意意外安全，特别是土旺，金旺的年份要注意下。地支土旺冲旺忌神，导致感情方面也不太理想。
          32岁-41岁走的是乙巳大运，大运乙巳，地支巳火力量强生财星，天干比肩帮身，生丙火，伤官克七杀，是吉利的，只是地支巳火泄日主生财，生助财星，对日主的泄耗力量也较大，通过消耗自身的精力和付出，能够有回报收获，但开支花销也很多。此大运伏吟日柱临婚姻宫，有结婚运气，但也有婚姻危机，在2026年，2027年要注意。
          42岁后的丙午大运，和丁未大运，两个大运为食伤大运，两个大运天干食伤克制七杀，七杀得制，对你的发展有帮助，是能够获得发展收获的，只是地支午火食伤生财，增加财星力量，未土大运地支丑未戌三刑引动，容易导致先好后差，要规划好，以免一时冲昏头脑，而不利积累。62岁后的晚年运走的是财生官杀的运气，大运组合不太好，晚年运一般。
          你的八字丑未戌三刑，伤官生财，财星旺为忌，同时财星生七杀克身，导致你虽然有事业心，但内心容易焦虑，矛盾，纠结，忧愁多，且容易招惹小人，以及是非口舌矛盾。做律师这方面是适合你的，也可以化解一些你八字是非的问题。
          有七杀先制七杀，好在八字七杀得伤官制，只是七杀难以制尽，结合你的大运来看，还是有发展的，能够有些小成绩，只是八字原局不太好，内心的欲望会比较大，不满足，不太知足，导致幸福感会偏低。
          你的八字在人际关系上不太好，在生意场上，如果人际应酬多，容易处理不好，你想要在这方面做好来，也很难，一个萝卜一个坑，每个人都有适合自己的位置，一个人短暂几十年，不要总想着用自己的劣势的一面去和别人的优势对抗，即使花了再多经历，劣势也很难成为你的优势，关键是找好自己定位，好好发挥自己的长处。
          但同时你要明白，人生之路，很多事情不是一步到位的，对现在阶段的你来说，上班的就好好上班，帮老板实现他的情怀，才能拥有和实现你自己的情怀。
          只是你有时候容易急躁，急于求成，缺少对长远目标的规划和隐忍，不知足，也导致你内心焦虑躁动不安，而烦恼忧愁多，平常多注意调整，也可以多学习，多看书，让自己静下来，也是通过印星的力量可以起到化杀的作用。
          `
  }]
}

export default {
  戌时
}