const 巳时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1991年十二月月十三日巳时'
  }],
  十神: '正印   正印   日元   伤官',
  天干: '辛(金) 辛(金) 壬(水) 乙(木)',
  地支: '未(土) 丑(土) 辰(土) 巳(火)',
  遁藏: '正官   正官   七杀   偏财',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/333.html',
    命主甲: `我出生在一个小山村，是家中的老大，家里还有弟弟妹妹，由于家里穷，小时候常常饿肚子，高中毕业就出来打工了。后来在工厂的时候被领导提拔做了办公室人员，心里是十分感恩的。
          到现在2020为止一次恋爱都没谈过.
          `,
    珠玑: `八字分析：日干壬水，在丑月出生不得令。由于在小寒后出生，故命中寒气较大，喜丙火来暖局为吉，地支巳火也能起到暖身的作用，不算水冷之命。八字喜见财星，但是财为忌神，故不宜多见。
          天干辛金为正印，八字属于正印格，正印是可以保护自己的，所以格局是非常好的，命中喜金为用神，也可以见水，但是走土运会克身，好在有金可以通关，所以也是不凶的。八字有印透出，或能克印，所以见火也是不吉的。
          婚姻方面：你八字的夫星挺多的，其中年支和月支为正官，日支时支为七杀，为官杀混杂，是不利婚姻的。由于年月相冲，所以早年的感情有些波折，这样的命格是不适合早婚的，只有晚婚才可以稳定，这样能避免很多不好的缘分。
          另外，年月相冲，也说明你祖上贫穷，家庭不富，好在八字中有印来生自己，所以家人对你还是很疼爱的，而且在工作中也会遇见贵人来帮助自己，同时，印为用神代表你可以获得文凭，你的命格是很适合求学的。
          由于年月相冲，年柱逢空，所以祖上对你的帮助不大，一切靠你自己去努力，在学习上千万不要放弃，多参加考试，考取证书，才能改善你的命运。
          由于日支坐七杀，生于阴差阳错之日，命犯寡宿，你是非常孤独的，不容易找到合适的人，在感情中，由于印星贴身，你是比较保守的一个人，往往会很害羞，容易错过好的姻缘，所以在感情上一定要主动一些。
          26岁之前，你走的是伤官大运，加上八字又有伤官星，所以你对另一半的要求比较的高，非常的挑剔，不容易满足，加上原局官杀混杂，所以情路坎坷，很不顺利。
          你八字中夫星是比较多的，说明你并不缺少一些缘分，只要你愿意去接触，那么很快就会拥有一段缘分，由于夫星不透，只有印能通关，所以应该让一些女性的长辈为您介绍，这样才会更容易落实婚姻。
          你的八字官杀较多，所以做事情有很多的顾虑，比较的胆小，从而也在一定程度上影响了你的感情。2019年有正官星透出，所以是有缘分的，不过亥水冲克了巳火，增加了原局之中的寒气，也不是好的年份。2020庚子年为桃花年份，所以是很利于谈感情的。2021辛丑年有官印相生，是可以走进婚姻的。
          事业方面：由于印能生自己，所以适合从事稳定的工作，要想自己的工作更好，你只能去多考取一些证件，提升自己，这样能够更好地应付自己的工作和生活，你的运势不强，好在原局不错，比较的流通，只要懂得满足，那么在一个稳定的平台上踏踏实实的工作下去，一生也是很顺利的。
          由于大运走的不好，八字也不是很利求财，所以在金钱上面不要有太大的野心。你命中有驿马加财的组合，所以适合外出赚钱，多多的走动、出差都是比较适合你的。
          大运分析：你于6岁上运，早年走的壬寅，癸卯都为为水木大运，都不是很好，加上年柱临空，所以出生平凡。
          你在26-36岁走的为甲辰大运，为墓运，你八字本就土多，是一个喜欢安静的人，不喜欢社交，遇见异性的机会很少，这样的大运会加重你这样的心理，所以要学会调整，才会有利于感情。
          你在36-66岁这三十年走的都是火土大运，尤其是以火运为主，你八字较寒，是可以火的，但是太多则会损印，所以要多注意健康方面的问题，大运有财来损印，很容易为了物质做出不好的决定来，所以要学会看淡金钱。
          至于你晚年的大运都是金运，可以生你，是非常不错的，所以晚年生活是非常好的。
          你命弱运弱，加上正官当令，所以在婚姻里面要懂得示弱，多给丈夫一切权利，这样家庭才能够和睦，女人要像水，而且你也是水命，所以要跟水学习，必然会有所收获。
          你想去考一些证书，我是很支持的，其实如果你的原来的家庭能够好一点，那么根据你的八字，你是可以获得高学历的，你的命运也会有非常大的不同，不过从现在开始努力也不晚，你八字属金，所以做财务还是很适合你自己的，多学一些这方面的知识，对你大有好处。
          `
  }]
}

export default {
  巳时
}