const 午时 = {
  公历: [{
    甲: '1988-10-26 11:35:00'
  }],
  农历: [{
    甲: '1988年九月十六日午时'
  }],
  十神: '偏财   枭神   日元   七杀',
  天干: '戊(土) 壬(水) 甲(水) 庚(金)',
  地支: '辰(土) 戌(土) 寅(木) 午(火)',
  遁藏: '偏财   偏财   比肩   伤官',
  大运: '癸亥，甲子，乙丑，丙寅，丁卯，戊辰，己巳，庚午，辛未，5岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3068.html',
    命主甲: `我家境非常一般，全家至今没有房子。出生就被带到上海。自幼习画，儿时一开始成绩较好，但是因缘际会开始玩电子游戏所以逐渐下降。
          24岁奋斗意识觉醒，出门上班，靠自学考上了艺术类硕士，但因需要自己解决吃住开支，我兼职做设计工作，这种高强度脑力工作严重影响了学业，导师也批评我不务正业的作风，好在我专业还凑合，2018年跌跌撞撞毕了业，恰恰在当年，落户政策变动，
          2018年初，因学业收获寥寥，国企的实习也压力太大，同事也会有欺负，因此负气不愿再回去，女朋友也离开了我，努力锻炼身体却导致多处关节损伤，
          在这样内忧外患的背景下，我机缘巧合进入比特币投机市场，操作半年，连贷带借小30万全部亏损，当时的我如同失了心智一般，被一个“朋友”忽悠到了一家极差的公司，我先是没日没夜做设计，手指也因为点鼠标太多受到了损伤，
          然后这位“朋友”以生意应急的名义让我再次帮贷了10几万，实则不打算还了，这件事的官司20年底刚进入执行阶段，目前已经执行失败，进入无限期中止状态。
          我之前还努力健身，认为身体是革命本钱，结果运动过度，双手双腿的关节全部遭到损伤，19年我的左手进行了手术修复，随后拖着脆弱的精神和伤病的躯体再次开始工作，好在同事老板对我都比较宽容（我也很认真在为他们工作），家人也还健在，我并没有做太多想不开的事情。
          我一度是个阳光正直的男青年，会打抱不平，会坚持正义，几年前体格强壮，心态乐观，在坐车时曾多次亲手拦下过原本要打架的人，遇到插队且不听劝的无赖，只是轻轻一扔就能把人剔出队伍。
          自打我连连失败，现在心态甚至有点黑暗化，觉得过去的自己是个愚蠢的愣头。开始会觉得要做一个坏人才能存活在这样的社会上。我深知这是一种倒错，但是难以自控……
          `,
    珠玑: `八字分析：甲木生在戌月，天干透戊，为偏财格。甲木之人一般高大强壮，尤其是甲寅地支坐禄，寅午戌合伤官秀气透出。但辰戌冲，偏财很旺，又受伤官生，日主甲木耗气严重。偏财格喜印星，八字一点癸水墓于辰中，毫无生气，用神虽有若无，所以这里的偏财不是发财，往往是欠债和意外失财。
          事业分析：一般来说偏财喜透不喜藏，年干戊土偏财高透，为人是比较慷慨的一个人，重义轻财，乐观开朗，这样的特质容易受到别人欢迎，人际关系是还可以的，加上甲木日出生，甲木坐寅木之上，也比较正直仗义的一个人。
          但戊土偏财透出，戌土偏财当令，地支戌土被辰土冲，偏财更旺，也容易物欲比较强，喜欢享受，加上月干壬水印星被戌土和戊土财星制，财星克印，更是要注意的，要注意因为外界的物质享乐诱惑，导致贪图享受，而不务正业，这是要注意的。
          命局全为阳的干支，同时偏财，七杀，伤官等偏星较多，地支又有辰戌冲，内心是比较不安分，不容易满足的，想要求的大的发展，急于求成，也导致不能踏踏实实的去做事情，看不到成果就会想要放弃，去试试其他的，这样的心态对事业发展有些不利。
          伤官生偏财，也是喜欢冒险，投资之类，加之日坐寅木为驿马，喜动不喜静，按部就班的上班不太适合，久了容易烦躁适应不了。
          甲木日主在地支有根，日坐寅木为驿马，为人是比较勤快的，地支寅午戌三合，寅木禄神来合戌土偏财，禄神合财一般也比较劳碌，需要勤劳努力付出，亲力亲为，付出很多劳动力，才可获得钱财，属于一份付出一分收获，辛苦求财的命局。
          甲木坐寅木之上，寅木比肩帮身，寅木为禄神，禄神和驿马相逢，日坐禄马，还是有一定福气的，也可以得到贵人相助，衣禄无忧，只是大的财富难求，事业求财不能太急躁任性。
          命局偏星较多，壬水枭神和庚金七杀星贴身，适合从事冷门和偏门的专业和行业，辰土和戌土临华盖，时支午火伤官临文昌贵人，从事艺术相关专业和行业是适合你的，可以通过自己技术才华来求财。
          八字为偏财格，日坐寅木为禄马，寅木禄神来合财表示可以依靠合作团队或公司平台来求财，适合辅佐别人，不适合自己单干，大运走水木运来助身的时候可以得财，切忌过于贪财，急于求成而带来麻烦事，要懂得知足常乐。
          婚姻分析：八字偏财格，年月戊土戌土是偏财，年柱为早年，也可以代表感情出现的早，或者说情窦开的比较早，容易有早恋的事情，八字财星制印，也容易因为感情分心而影响到到学业。
          婚姻宫是寅木禄神，寅木为用神，未来另一半较为贤惠，同时寅木临驿马，也代表人比较勤快，可以作为贤内助，对你事业有帮助。地支寅午戌三合，戌土偏财被合入，可以有一段较稳定的婚姻，但华盖重重，临女孤鸾煞，婚姻会来的比较晚。
          2022壬寅年，行印比，水木助身，地支寅木引动寅午戌三合，有机会可以遇到缘分，好好把握。
          健康分析：八字身弱，庚金七杀贴身，见午火伤官，壬水印星被制，容易身体落下伤病身体上有小毛病也算应验这方面，可以为你挡去一些大的灾祸。
          日支寅木为甲木日主之根，无根怕有根，有根怕根损，地支寅午戌三合，地支不见水来护根，命局火土相生土重木折，寅木为筋骨和四肢，禄神也代表身体，容易有筋骨和四肢方面的健康问题，而且寅木临四废，容易筋骨伤病，甚至伤残，影响正常生活，要特别注意为好。
          大运分析：25岁-34岁走的是乙丑大运，此大运地支丑土被天干乙木盖头，为劫财克财的大运，有他人帮助自己的同时，也有夺财之象，容易破财遭遇金钱上的损失，同时乙木和时干的庚金贪合，没有实质助力。甲木为大树，乙木为藤萝帮身的同时，也在缠绕甲木，有拖累的意思，在与人金钱合作来往的时候，要特别注意下。
          35岁-44岁走的是丙寅大运，此大运天干丙火食神高透，甲木喜向阳，丙火有调侯之功，可以有机会展现才华。地支寅木来帮身，引动命局寅午戌三合，事业上有机会遇到贵人帮助，但禄神合财，是辛苦求财大运。
          45岁-54岁走的是丁卯大运，此大运天干丁火伤官星高透，丁壬相合，壬水印星被合绊，此大运最重要的是注意健康问题，寿元星被合拌，容易在身体健康上出问题，又没有印星来护身，要注意筋骨问题复发或加重。卯木虽助身，但卯辰相害，辰土财星受损，要注意提防小人干扰阻挠。
          55岁-64岁走的是戊辰大运，此大运干支一气为偏财，财星较旺，但身弱不担财，求财辛苦忙碌付出多，晚年财运情况一般，辰土引动地支辰戌相冲，钱财上开支花销较大，土被冲旺，要注意脾胃方面疾病，同时切忌贪财惹灾，导致破财。
          你为人还是比较正直正义的，只是现实的经济压力下，让你对身边的人和事产生了偏见和负面情绪，不要因此而放弃自己的善良，别人对你怎样，是他的因果，你对别人怎样，是你的修行。
          `
  }]
}

export default {
  午时
}