const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1988年九月二十六日卯时'
  }],
  十神: '偏财   枭神   日元   伤官',
  天干: '戊(土) 壬(水) 甲(木) 丁(火)',
  地支: '辰(土) 戌(土) 子(水) 卯(木)',
  遁藏: '偏财   偏财   正印   劫财',
  大运: '癸亥，甲子，乙丑，丙寅，丁卯，戊辰，己巳，庚午，辛未，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/451.html',
    命主甲: `是家里的独生子，读书从小学、中学、大学、直至28岁都一帆风顺，学的是医学，国家免费培养，工作由国家统一分配，没有自由选择的权利。
          毕业时老师安排我搞科研，我没听从老师的安排，执意要当一名救死扶伤的临床医生，因此让我的人生跌到了谷底。
          我被分配到一小诊所工作，经历了几年痛苦的煎熬，精力充沛的时光也被耗费，去年终于进了比较理想的医院工作。同龄人有工作经验，我却是个生手，处于边工作边学习的状态，感觉要实现人生的目标遥遥无期，我十分迷茫不知将来的路怎么走。
          三十二岁的人了，父母很着急我的婚姻之事，我事业未走上正轨，哪有资格考虑个人问题，更无力承担结婚生子的责任。曾有一位我崇拜的同学对我也有好感，但从中学到现在她的能力都在我之上，我拼命追赶仍然有一段矩离。
          她是个学习狂，工作狂，也不考虑个人问题，至今仍然单身，我想追她又没那份自信，不追又担心花落别家。
          `,
    珠玑: `八字分析：甲木日主出生在戌月，戌中戊、丁皆透出，定为偏财格，伤官生财。偏财格、伤官重，这就需要日主有一定的能力去得到，也就是要看身强还是身弱。甲木生在戌月显然是不强的，幸好时支卯木为日主的阳刃，也是托身之处。
          偏财格需要配印，加强自身取财的能力，好在甲木自坐子水，年支又有水库，但天干印透出受克，地支子水受卯型土克也受制。整体来看，地支刑、冲、合、害凑齐了，注定一生是波折不断的。
          从调侯的角度来看，《滴天髓》言：甲木参天，脱胎要火。春不容金，秋不容土。火炽乘龙，水宕骑虎。地润天和，植立千古。甲木为大树之木，戌月已进入秋末，寒气渐长，木在秋季枝叶凋零，根气收敛，喜见丙火来调侯，喜见辰土来扎根，也喜见水来滋养甲木的根。
          从原局来看，月令戌土为燥土，年支辰土离自己较远，难以扎根。时干透出丁火，不见丙火。虽有壬水和子水贴身为用，但为无源之水，故而格局层次一般。
          事业分析：官杀星藏而不显，喜欢自由，不喜被束缚，从事自由行业会心情较为舒畅，也较为得心应手。
          天干丁壬相合，地支辰戌相冲，辰土中暗藏的癸水去克了戌土中暗藏的丁火，为印克食伤，思维不够灵活，容易一根筋，听不进去别人的建议，不撞南墙不回头，这个性格适合去钻研一个领域求财，一些人际关系很强的工作不太适合。
          八字财星得令较旺，身弱难以担财，时支卯木和月令戌土卯戌相合，但由于地支子卯相刑，卯木被丁火泄身，卯木无力去合财，劫财去合财一般求财非常辛苦，也体现为身体上的劳累。偏财较旺的人求财的欲望很大，物质上不容易满足，尤其不满足于工资财，喜欢去追求快财。
          财星在年月为远方之财，财星不在日时，财不入主位，赚到的钱大部分都是别人的钱，自己辛苦却难以得财。
          地支辰戌相冲、卯辰穿害，也代表为外出求财之命。八字偏神多于正神，说明是不满足于稳定求财的一个人。
          偏印贴身为用，学习能力是不错的，是一个肯钻研的人，偏印代表一些偏门学术和技能，能有一技之长，靠此谋生求发展是非常适合，学医是适合你的。但给你的建议是加强学习，最好能返回学校去继续钻研医学，取得更高的学历对于你的事业发展非常有利的。
          你的命格印星为用神，取得文凭则加强印星用神，对你的帮助很大。现在的大医院医师都很看重学历，博士毕业才会有更高的收入和地位。你现在进入了医院上班，可以去在职读研和读博的，医院一般也比较支持，有的医院还会有资金赞助，你可以考虑下。
          婚姻分析：日支子水为婚姻宫，子水和时支卯木子卯相刑，卯木为阳刃，婚姻宫受损，说明夫妻感情不和，矛盾较多，婚姻变动之象。
          日主甲木被偏印和食伤包身，性格有的时候自私，为自己考虑得多，容易对他人不满，感情方面不容易被另一半喜欢，对方难以感到你的关心和体谅，这是不利婚姻的。
          你的八字财星较旺，年柱和月令为偏财星，早年难以遇到正缘，或者遇到缘分但难以长久，多为露水情缘。年柱和月柱天克地冲，尤其是财星相冲，代表感情不稳定，为晚婚之命，也只有晚婚才为吉。
          六亲分析：你的八字有不利母的信息，月干壬水和日支子水失令，没有官杀星来生印，壬水和子水见辰土则入墓，为印星入墓，原局天干戊土去克了壬水，地支戌土去克了子水，也才财星破印，故而母亲身体不好，运势不吉。财星破印也代表父母感情不好，父亲运势也不太好。
          日主甲木被枭神贴身为用，且早年走的是印星大运和印比大运，早年可以得到父母疼爱，印星为用代表学习，走印比大运则早年考学运很好，学习成绩还不错。印多包身的人依赖性很强，能得到身边人的疼爱。
          男命以官杀代表子女，你的命局官杀藏而不显，辛金正官星藏于月支戌土之中，正官受损不吉。时柱为子女宫，不见四大贵人，卯木用神生了丁火忌神，子女缘分较弱。
          且卯木为阳刃，在时柱则子女星不吉，结合大运来看，一路官杀星也不显，当下走的丙寅、丁卯大运都是克官杀的大运，要孩子是不顺利的，注意先调理。
          大运分析：32岁-41岁走的是丙寅大运，此大运地支寅卯辰三会木局，合来解冲，卯木用神得到解救。大运来助身则可以担财，且天干丙火也为调侯用神，好好把握是可以在事业上有番作为，财运也不错，可以赚到钱。不过寅木为驿马，逢驿马大运则也为奔波求财，求财较为辛苦。
          今年为辛丑年，地支子丑相合，财星合入，则有机会遇到缘分。明年为壬寅年，天干丁壬相合，地支寅卯辰三会木局，也为天合地合，比劫帮身可以担财，这两年好好把握，可以定下终生大事。
          42岁-51岁走的是丁卯大运，此大运天干丁火去合了壬水枭神，地支卯木和日支子水相刑，和年支辰土穿害，用神受损，婚姻也害上加害，运势不好。事业上会有很多不顺心的事，家庭矛盾也较多，不引起警惕的话很容易离婚。
          52岁-61岁走的是戊辰大运，此大运为干支一气财星大运，天干戊土去克了壬水，地支辰土去克了子水，和时支卯木构成卯辰穿害，也是用神受损的大运，在健康上要非常注意，身弱财旺不担财，这个大运求财会辛苦，财运也不好。
          后面走的己巳大运，和庚午大运也一般，己巳大运旺了财星，天干甲己相合，身弱难以将财星合入，求财辛苦。庚午大运为戳脚大运，且和原局天克地冲，则凡事多为不顺。
          你的八字事业上选择求医是不错的，现在的大运走得还不错，进入新单位要端正心态，重整行装再出发，最好是去在职提升下学历，对你的事业发展有利。
          而后面的大运走势一般，现在不好好把握，以后想再去争取会很困难，好好规划下，依靠你现在大运去规划好，打下的基础，那样更有利。
          `
  }]
}

export default {
  卯时
}