const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1985年十二月初七辰时'
  }],
  十神: '正财   正印   日元   比肩',
  天干: '乙(木) 己(土) 庚(金) 庚(金)',
  地支: '丑(土) 丑(土) 申(金) 辰(土)',
  遁藏: '正印   正印   比肩   枭神',
  大运: '庚寅，辛卯，壬辰，癸巳，甲午，乙未，丙申，丁酉，戊戌，7岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/454.html',
    命主甲: `广西北海乡下的。从小家境贫穷，也没读什以书。结婚十来年，忙忙碌碌也没能改变时运。打过工，开过小档，摆过地摊，小钱从无到有，从有到无，几经兜转后，又从有到负（因为我交友不慎，导至被骗，负债累累），感觉压力好大，上有老下有小的。
          前路迷茫，不知什么时候才能好转，走出困境。情绪时常在正负两端游走，心情常常低落，难以调整。
          `,
    珠玑: `八字分析：庚金日主生在丑月，天干己土透出，为正印格八字。逢印看官，原局全无一点火星，官杀全无对婚姻和事业都是有影响的。无官杀看食伤，原局正偏印太旺，虽生在冬天，水被土克得太厉害导致财运也不佳。乙木财星坐丑本有点用，但被比肩庚金合去，用神无力，全看大运了。
          庚金为矿石金，喜丁火来炼金方能成器，但原局无火来炼金，且不见食伤来泄秀，格局层次一般。
          八字土多为病，印星得令旺而无制，原局不见食伤，人不算聪明，命里和学业文凭无缘。
          日坐禄神，金旺而无制，庚金为阳金，性格比较好强和直率，不会轻易服输，人比较固执己见，也容易一根筋，钻牛角，不利人际交往，做小生意也需要和客户打交道的能力，这样的性格做生意的话是不利的。
          年干乙木正财被正印包身反克，这个财为虚透之财，没有食伤来生财，年柱空亡也为财星空亡，财星很弱，财运不好，不聚财，财来财去之命。
          身旺财弱求财的机会不多，遇到机遇往往也很难把握住，求财会辛苦，而且原局比肩较旺，日坐禄神，禄神代表身体，也代表求财辛苦，身体会非常劳累。
          时柱庚辰纳音白腊金去克了日柱纳音石榴木，木为财星，纳音之财为真财，也说明破财之象非常明显。
          八字比肩较多且旺为忌神，也容易被身边的朋友连累，欺骗，天干两个庚金去合乙木，有争夺之象，为比肩夺财，很容易因为朋友而破财，在交友上，与朋友钱财来往上要特别注意。另外也不适合合作求财，容易反目成仇。
          你的八字喜食伤泄秀为用，是可以从事餐饮行业，八字格局层次不高，加上大运走得也不好，财运也不济，且八字为日禄格，更多是靠勤劳致富，也就是多付出努力，依靠自己的双手创造财富，适合做点小生意，投资不大，风险不高，摆个小摊是可以的。
          你的八字临三个华盖，内心较为孤僻，加上印星太旺无制，有时候容易想得多，杂乱，悲观，厌世，想不开，会非常抑郁，不容易排解负面情绪。
          加上八字缺火，也说明人不够阳光乐观，比较阴郁，食伤不显，言语口才较为笨拙，不善于与人沟通，这些是要去调整的，做小生意需要亲力亲为，通过自己的行动，语言去感染客户，如果自己缺乏热诚活力，也容易影响到你的客户，进而影响到生意。
          而在婚姻中久了也容易沉闷，久了难以感到快乐，不利于婚姻的稳定和圆满。
          原局不见官杀，就连暗藏的官杀星也没有，官杀代表丈夫，夫缘较弱，和丈夫缘分不深。不见官杀星则以日支为夫，日支申金为比肩星忌神，丈夫能力不强，家庭条件一般，对自己帮助不大。
          日支申金比肩为忌神，也说明丈夫性格脾气不太好，夫妻感情较差，矛盾较大，争吵很多，容易产生纠纷。
          同时你的性格在婚姻中不喜欢低头的人，比较刚硬，即使遇到自己的问题，也不会轻易认错，等着丈夫向你服软认错，久而久之矛盾会越来越大，隔阂越深，难以收场。
          你的八字比肩星较旺，有时会看问题较为片面，容易走极端，喜欢抓住问题不放，甚至容易胡搅蛮缠，不利婚姻的稳固。
          八字比肩夺财，且官杀不显，是不利夫的，因为比肩克财，而财为夫星元神，克掉夫星元神，夫星枯败死绝，没有生气，暗示丈夫的运势也不太好，财运也不好。比肩有争夺的意思，故而要注意丈夫的异性关系，容易有第三者插足。
          大运分析：27岁-36岁走的是壬辰大运，此大运为印克食伤的大运。今年为此大运最后一年。天干壬水被地支辰土戳脚，原局食伤不显，大运中出现食伤则为印克食伤，食伤也代表想法，心情，被克则这个大运会比较压抑，烦闷，心情抑郁难以排解，要多注意调节，否则会影响到健康，但壬水虚透天干，也能够有一点力量去生财，还是能赚到一点钱，只是不容易留存。
          37岁-46岁走的是癸巳大运，此大运为伤官克官的大运，女命逢此大运非常不利婚姻，会对丈夫非常不满，心生抱怨，家庭矛盾争吵会很多，容易离婚。地支巳申相合，动了婚姻宫，也为婚姻变动之象，这是要多注意的。天干癸水透出被月干己土所克，烦恼不少，水被克则注意肾脏泌尿系统方面疾病。癸水受损但好在能去生一点财，但财星还是虚透无力，稳定经营求财些小财。
          47岁-56岁走的是甲午大运，此大运为财官相生的大运，天干岁透出甲木疏土为吉，但甲己相合，甲木被合拌，这个财难以被自己得到，辛苦赚钱，却花销多，难以进自己口袋。地支午火去生了印星，且丑午穿害，土更旺埋金不吉。
          57岁-66岁走的乙未大运，这步大运为财星克印的大运，乙木盖头未土，乙木虚透无力，又被庚金争合。地支丑未相冲，又把土冲旺了，要注意身体脾胃，皮肤方面疾病。也代表小财能有，但切记不能合作求财，否则容易破财。
          后面的丙申大运，丁酉大运，均为火金大运，天干盖头地支，火在天干去生了土不吉，地支金来助身也不吉，晚年则多注意身体，尤其是肾脏，脾胃。
          “命里有时终须有，命里无时莫强求”人生有些事情是注定的，有的事情又不是注定的。
          正所谓大富在命，小富在勤，一个人的大富大贵命中有定，不是单纯通过努力就可以获得，而小财可以通过自己去勤奋努力获得，你比别人多一分付出，就多一分收获，可以让自己过的更好。
          `
  }]
}

export default {
  辰时
}