const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正官   正财   日元   偏财',
  天干: '壬(水) 庚(金) 丁(火) 辛(金)',
  地支: '申(金) 戌(土) 巳(火) 亥(水)',
  遁藏: '正财   伤官   劫财   正官',
  大运: '辛亥 壬子 癸丑 甲寅 乙卯 丙辰',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/65.html',
    命主甲: ``,
    珠玑: `此造出生日的日干为丁火，属丁火命。丁火为灯烛之火，亦可做炉火，冶炼万物制成金银铜铁器皿。生在秋天九月，戌土当令，丁火之气尽泄于土，火临墓地。也就是说一生出来就日干身弱，土旺。这是首先抓住的主要特征，从这点上入手，再推向其余四柱。
          戌月虽土旺，然天干未见明土，反而透出戌中辛金，其势为伤官生偏财。无奈财官太重，日元之根已火又被亥水冲动，根基不稳，所以需要木火印比帮身为用，犹以见甲木有利，既可疏戌中重土，又可生助日干丁火，一举二得。
          然查遍四柱，不见有甲木，只见日主自坐巳火为根，其余皆金、水（三金二水）。即丁火日主既不得时，也不得地，又不得势，当然属身弱了。
          于是取木、火为喜用神，忌神是土、金、水。这个八字不算难推，适合初学者入门。也就是说日后逢木、火的大运和流年有利，遇土、金、水的大运和流年不利。
          虽然从八字中的五行对比确定了日主属弱，但还要看四柱干支的生克制化和刑冲会合的关系如何，有没有改变了上述的结果，例如使得日主转弱反强，或使原来强的日主反成弱。
          现看到地支有一对巳亥相冲。命中已经金生水旺，火弱，再加上五行四时的关系：秋天火囚、金旺、水相、木死，故此一冲，水胜火败。此造以巳火为用神，是为用神受伤，缺木调解（水生木生火），故格局不高。
          命中财、官多，三财（金），二官（水），一发挥（土），即此人很想发财和当官，追求名利之心很强：财多而心志必欲贪之，官旺心事必欲求之。然眼高手低，即使偶行好运，纵有所得，时运一过，恐也得而复失。皆因日主弱，过重的财官必承担不起，若强求之，反得其祸。
          打个比喻，此人生得瘦弱矮小，却想去挑比他自己还重的两大箱金银财宝，即使能勉强担得起来，并走了二三步，但终究不能走完人生的全程，就会被财宝压垮那样。
          现在再来看下他什么时候能担起命中的两大箱金银财宝，前面三十年水运，水火不相容，是忌运，出身寒微，早年艰难。
          然一到甲寅运，上木下木，且甲木是参天大树，丁火最宜见它相生，火势源源不断。命中缺木，现在行运遇上，真是枯木逢春再生荣。此十年好运，得机遇经商赚几百万，也就是能挑得起两大箱金银财宝，并能走二三步的时候。
          唯一到乙木运，乙木为花草灌木，生起丁火来当然不及甲木参天大树。然更不幸的是，乙木见命中庚金，便会起化学作用，乙庚合化金（因生在秋天，且命中金多，化金可成）。
          即连一点花草灌木也化成金，从有助到无助。适逢在此乙木运中，又遇到庚金、申金，辛金、酉金流年，更增加了金银财宝的重担，终于连人带担摔倒在地上，前运所赚的钱全赔光，最后只得倒闭。
          可见，财虽可养命，官虽可荣身，但必先要日主旺相，方能任其财官。若太过或不及，皆为财神不真，纵然得到，亦复耗散，终不能富贵，天下此等格局最多。
          `
  }]
}

export default {
  亥时
}