const 卯时 = {
  公历: [{
    甲: '1999-12-21 06:00:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '食神   劫财   日元   七杀',
  天干: '己(土) 丙(火) 丁(火) 癸(水)',
  地支: '卯(木) 子(水) 未(土) 卯(木)',
  遁藏: '枭神   七杀   食神   枭神',
  大运: '丁丑，戊寅，己卯，庚辰，辛巳，壬午，癸未，甲申，乙酉，7岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/526.html',
    命主甲: `家庭概括：鄙女是家中独女，幼年常由爷爷奶奶陪伴相处，2007年爷爷因肺癌过世，2012年奶奶因突发心血管疾病过世，爸爸是父系家中唯一男子（上有三位姐姐下有一妹），因而鄙女成为父系血缘里唯一后代。性格随爸，比较急躁，但高中以后变得稍为收敛，是情绪化人格，感性过量大于理性。从小被认为天资聪颖，尤其在文方面有自我天赋。
          学业：直到高一分科前算为顺利稳妥，优等生行列，但从小学六年级始出现偏科趋势，此后一直延续，数学较落后，到了高中水平划分深化偏科显示更加明显。2015年高一下学期分科后有所改善，日常成绩一直位于前茅，但初遇高考并不理想，复读一年，依旧没有发挥日常水平，上了普通二本学校。
          专业并没有坚定的个人目标，在家里人认知的影响下，选择法学。现在处于考研的转折期，在阴差阳错下选定目标是北京一所高等院校，备考状态并不在线，心态与本年发生事件有关，心灵所感个人磁场出现问题。感情部分会有解释。
          感情：鄙女严重情绪化，骨子里是理想主义，小学还会与异性有多来往，初中以后桃花运走低，高中因分科的缘故与异性少接触，对个别男生产生过好感但都不了了之。迄今最为深念的是2017年相识的高中同学，和他历经四年的纠葛，我们断断续续保持着联系，感情方面我的心思三年多来也只在他一人身上，我们没有在一起，他属于性格懦弱，有话不会张口详细表达的人，我因为他在心里定位特殊性，好多话也不敢贸然开口。
          我们在2019年3月，因为他的一次食言和不告而别断了联，2020疫情开始，他与我恢复联系，但最终也没有发展成为情侣。在今年三月份，我跟他最后一次见面以后，冲他说一切，并且忍痛表明要与他决裂，心中很多不舍，但由于他在这段关系中的不真诚，我决定斩断这段不健康的关系，今年5月份他来重新加了好友，我语气冷漠，但并没转圜意思。他就退了。
          在跟他相识过程中有许多因缘巧合，觉得奇妙，大多已经记不太清，记得一二，我与他高考分数相同（他理我文），家离得很近，冥冥中认为与他之间有宿命的牵扯，但不得善果，我们如今，已然彻底断联，但是忍不住主动了解他的所动，心情还会据我了解的信息触动。
          在他之后与驾校认识的一个男孩有了短暂的露水情缘，但难敌本心，该人给我的感觉实在不合适，拒绝了他的表示，打断了与他在一起的念头。目前为止没有谈过一段真正的恋爱。
          值得一提的是一件离谱的事，我姑家女儿，也就是我姐姐，她父亲那边的一个外甥女，与我没有血缘关系，早年相识，在去年高考毕业以后，跟我联系开始变得密切，慢慢我发觉她对我感情非同一般。这里我指的是，异常情感关系，我是理解同性恋的存在，并主张恋爱自由无关性别的。但我本人的性取向单一，男。
          今年她的感情表达越发明显，我察觉不对劲便开始疏远，疑惑每次与她有所联系运势都会变差，她曾在大观音寺为我求过学业符，近期发现她一直在各种社交网络平台视我的动态，我感觉不适，意外发现今年年初她为我转发过教资面试通过的锦鲤，事实是今年两次面试都没有通过，（没有忽略个人主观努力）只是觉得期间个人状态甚是离谱。
          现在细想，害怕是因为之前她求的学业符影响，不否认个人心态，但是担忧她人本身对我而言是不是有相克的影响。如果真有关系，还望求先生浅说破解之法。
          财运：家境普通，但日常开销会刻意节俭，不乱消费投资，但没有理财头脑，不懂得规划财富，只会囤得财富，会利用一些机会赚取小金。大致理财规划并无认识。
          身体：身体状态近年觉得愈发恍惚，经常陷入梦魇，长时间睡眠后起来也觉得浑身无力，做事没有目标与心劲，心淡力不足，个人能量虚弱，不在状态。
          `,
    珠玑: `八字分析：丁火日主生在子月，干透癸水，为七杀格。食神制杀，偏印化杀，出现制化两立的情况。偏印夺食的时候，头脑容易不清晰。偏印聪明，早年一路印地，化杀有力，所以能取得不错的学历。婚姻感情就不那么美好了，子未相穿，夫宫受穿又被克，势必是不太好受。女命偏印、七杀、劫财全，于婚姻而言也是不利的信息。
          事业分析：丁火是灯光之火，在黑暗的时候，才能发挥最大的光亮，体现出丁火的价值，但丁火在卯时，正好是太阳刚出来的时候，同时月干丙火透出，丙火代表是太阳，太阳出来掩盖了丁火的光芒，叫丙夺丁辉，也不是太好，丙火坐子水被截脚，年支和时支卯木枭神为用，但被子水相刑，卯木空亡无力，格局层次一般。
          八字为七杀格，性格上体现为压力较大，思虑重重，但好在有卯木印星通关，杀印相生，印星化杀为权，不至于太凶，但原局杀印并不流通入日主，难以得到这个杀和印。
          八字有杀印相生的组合，比较有野心，欲望较大，不容易满足，不安于现状，做事有魄力和胆量，这些均有利于学业和事业的发展，但也比较冲动，处事不冷静，这个方面要注意。
          八字杀印相生也利文化，是一个比较爱学习的人，在文学方面有特长，也容易出秀丽文章。杀印相生也利武职，学习法学专业是可以的，以后从事相关职业会有所发展，也可以选择一些偏门专业。
          年柱己土食神被地支卯木截脚，日支未土食神被时支卯木所制，构成枭神夺食，有才华受阻，思想受限之象，也代表学习难以专注，三心二意，不利学业的发展。
          八字身弱以印星为用，但子卯相刑，卯木受损，在学业上有阻碍，难以取得较为理想的学业和学历，枭神为用一般代表二本院校，艺术院校，民间大学技校等，印星不透天干，也暗示学校和学历会打折扣，所以多考取这类院校。
          你现在走的戊寅大运，天干戊土被地支寅木截脚，寅木正印出现，但印星不透干，只目标不宜过高。2022壬寅年，2023癸卯年，官杀去生印星，印星填实，有机会考上，要好好把握。
          婚姻分析：八字有枭神夺食的组合，加上枭神旺，容易郁闷想不开，喜欢胡思乱想，心事重重的，对于一些事情也会纠结，犹疑不决，反复不定，容易有抑郁症，另外也比较疑心较重，有精神洁癖，理想完美主义，很难从心里接受，和相信一个人，稍微有些不如意的地方，都会被排除掉，不利于感情的落实和稳定。
          八字为七杀格，食神难以制杀，性格脾气不太好，比较固执，容易和另一半发生冲突矛盾，这是要注意的。八字身弱喜劫财，这种命格即使非同性恋，也容易招惹同性情愫之人。
          丁未日出生为阴差阳错日，临太极贵人和华盖星，为不利婚姻的体现，也表示为晚婚之命，不宜早婚。月令子水为桃花，临红鸾，子未相害，婚姻宫未土受损不吉，容易因为墙外桃花影响你的婚姻，这是要注意的。
          婚姻宫为未土食神，食神是克官杀星的，命局未土制了子水七杀星，且子未相害，夫星难入夫宫，婚姻不易落实，也暗示婚后很容易对丈夫不满挑剔，发生口角矛盾。
          2022壬寅年，天干壬水正官星高透，地支寅木印星助身，丁壬相合，正官合身，则会遇到缘分，要好好把握。
          大运分析：17岁-26岁走的是戊寅大运，天干戊土被地支寅木截脚，寅木正印助身则有利考学，但和命局印不透，能考取比较一般的院校，重点院校较难，要降低目标才可以。天干戊癸相合，伤官制杀，感情较为坎坷，容易在感情上发生冲突矛盾，一般男性难入法眼，这是要注意的。
          27岁-36岁走的是己卯大运，此大运天干己土被地支卯木截脚，为枭神夺食的大运，心情会比较郁闷，多忧少乐，也容易思虑重重，有些不好的想法，要注意调整心态，继续追求学业的话较为不利，难以发挥出自己的才华，不能去投资求财，很容易破财。
          37岁-46岁走的是庚辰大运，此大运为伤官生财的大运，求财的欲望较强，但身弱不担财，求财非常辛苦，花销较大，不聚财，天干庚金财去滋杀，丈夫运势不差，地支卯辰相害，卯木用神受损不吉，事业上阻碍较多，要注意肝胆，经络方面疾病。
          辛巳大运，天干辛金被地支巳火截脚，辛巳暗合，且丙辛相合，有劫财夺财之象，也很容易破财，不能去投资做生意。
          壬午大运，和命局日柱天合地合，午火为日主的禄神，禄神被合入，晚年吉祥，财运不差，可以安享晚年。
          你的八字七杀旺，虽然有枭神化七杀，没有正印化七杀这么彻底，杀枭在一起也容易敏感，多疑，加上枭神夺食，会比较的疑神疑鬼，怀着敌对心理去看待身边人，很难去真正的相信身边人。
          别人一句话，一个动作，都会让你浮想联翩，即使看起来波澜不惊，内心可能已经是小剧场播放，对自己是一种很大的消耗和心理负担，久而久之造成心里萎靡，影响精神状态，也影响到身体健康。
          你的八字有一定的佛道有缘分， 也有易学天赋，平常可以去接触一些这方面，把想的多的负能量转化成一种正能量的修行，对你的思想，精神身体状态，都会有很好的帮助。
          `
  }]
}

export default {
  卯时
}