const 巳时 = {
  公历: [{
    甲: '1994-10-24 09:30:00'
  }],
  农历: [{
    甲: '一九九四年九月二十巳时'
  }],
  十神: '伤官   伤官   日元   偏财',
  天干: '甲(木) 甲(木) 癸(水) 丁(火)',
  地支: '戌(土) 戌(土) 未(土) 巳(火)',
  遁藏: '正官   正官   七杀   正财',
  大运: '乙亥，丙子，丁丑，戊寅，己卯，庚辰，辛巳，壬午，癸未，6岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3330.html',
    命主甲: `学生的成长经历可谓是坎坷中不乏平稳，从小到大志在经商。15岁辍学跟随家人学习经商，有过很多的创新观念，可惜当时资本不足，均无缘实现。25岁南下广东，接触到了房地产业的最后一波红利，虽然辛苦但也知足。只是当今房地产业日渐衰迷，学生遂有改行经营的想法。
          另外，我近两年总担心自己身体状况不好，频繁的间断性耳鸣，求医无效，实在让人困扰，
          `,
    珠玑: `八字分析：癸水日主生在戌月，为正官格，地支一已一未一戌，不是火就是燥土，天干丁火，癸水无根气，两个甲木也是虚浮无根，被丁火化泄。八字气势全在火土，癸水宜从官杀为吉。
          事业分析：八字从官杀，喜财来生官杀，时柱丁巳干支一气为财星为吉，但八字丁火偏财和巳火正财同见，戌土正官和未土七杀同见，杂而不贵，五行之气不纯，八字从官杀，也不喜见太过食伤，年柱和月柱甲戌，都是伤官克官的组合，也影响了格局层次，故你提到的组合均没有，虽然从格，但贵气减了一些。
          结合大运走势来看，早年走的是乙亥，丙子大运，为北方水运，比劫来助身，癸水日主极弱，若不受生，大运均反背较为不吉。现在走的是丁丑大运，为财杀相生的大运，顺从弱势为吉。后面走的是东方木运，虽然大运不破格，但食伤和官杀相战为不吉，不过地支有财星通关，为吉的一面，接下来的大运天干见金水均破格，故格局层次不高，波折和起伏较多。
          八字甲木伤官高透，伏吟天干，野心和欲望较大，内心较不安分，非常要强好面子的一个人，也比较任性傲慢，不会轻易服输，也不愿妥协，做事有时候容易冲动，伤官高透也主开拓创新，不喜墨守陈规，做一些按部就班的工作，且八字正财偏同见，故志在从商，在金钱上不易满足。
          年月甲戌伏吟，均为伤官克官的组合，内心较为叛逆的一个人，比较喜欢自由，不喜欢太多框框套套的事情，也喜欢打破常规，不按规矩出牌，而工作上也容易和领导关系不好，对工作不满，容易招惹官非口舌，命理有“八字伤官见了官，命主常走牢狱边”的说法，容易因为不受约束，以及祸从口出，招惹是非灾祸，这方面是要注意的。
          八字从官杀，早年走的是乙亥，丙子大运，大运反背且不见印星，故学业易荒废，很难在学业上有所建树。一般来说从官杀之格，若官杀较为纯正，或者为去杀留官，去官留杀的组合，又有财星来滋养官杀，不见伤官见官，大运不反背，那就是上格，走仕途是非常有前途的，你的八字虽然从格，但杂而难贵，加上大运走的不是非常好，要适当降低欲望，接受平凡。
          从你经历来看，15岁辍学，25岁南下广东，均为交运之时，故以后岁逢交运，要防大的变动，不过，2019年后转丁丑大运，运行火土，可以顺从弱势，故可赶上房地产的红利，也可以赚到钱，这步大运要好好把握，想转行可以考虑去做一些销售，对外跑业务，设计策划生产，企业管理，土建装潢互联网方面的工作。
          时柱丁巳干支一气为财星，财入门户，可以得到这个财，但运势不破格的时候才会轻松得财，也有意外之财，大运一旦反背，求财会非常辛苦，财运也会走低。丁巳正偏财同见，临驿马，为驿马带财，很适合求动财，做一些走动奔波较多的工作为好。
          年月戌土为财库，财库多而不富，即使顺从弱势也难见大财，或大财来了自己也很难守得住。财临驿马，也适合外出发展，出生地的南方，东北方，西南方比较旺你，可以考虑选择继续南下，但56岁后大运反背，能回家乡发展，或去出生地的西方，北方，西北方发展较好。
          你现在走的是丁丑大运，未来转戊寅，己卯大运，均顺从弱势，可以尝试自己去做事业，不过贵人运也不差，有贵人相助也不要拒绝，但56岁后大运破格，能跟着别人做是最佳选择。这三步大运是你事业发展的黄金期，要抓住机遇，总体财运在中产左右的水平，不过56岁后大运反背，财富等级又会降下来。
          婚姻分析：八字从官杀，五行之气较为极端，又甲木伤官高透伏吟，性格有傲慢任性好面子的一面，在感情方面要调整心态，多放低身段，主动追求为好，时柱丁巳正偏财同见，在对待感情上容易心有不专，不够坚定，这是要注意的。
          癸未日出生，临寡宿，月令戌土临华盖，时柱临太极贵人，加上丁巳财星在时柱，姻缘来得较晚，年月戌土伏吟，丁巳见戌土也有入墓之象，为妻星入墓，也代表姻缘较弱，不利婚姻的顺利落实，故多主动接触异性，经人介绍为好。
          未来妻子性格较为强势，脾气不太好，不过人比较聪明伶俐，多为外地人，年龄多比你小，家庭条件不差，个人能力不错，比较能干，对你有一定助益。你八字官杀当令较旺，子女缘分不差，无需担心。
          你现在走的是丁丑大运，地支丑未相冲，婚姻宫逢冲，有望遇到并结婚。2025乙巳年，地支巳火妻星到位，红鸾星入命，有望遇到，2026丙午年，丙火正财高透，地支巳午未三会，会动婚姻宫，有结婚的运气。
          健康分析：八字从官杀，五行之气较为极端，且会随着运势的转换而喜忌转换，身体健康也容易反反复复，大运一旦破格，八字官杀旺而攻身，又无印星来通关，要注意压力过大、睡眠不好、破相留疤、意外伤害等事，平时要注意劳逸结合，不可太过劳累。
          命书讲到：金弱水浅土重重，不是痴哑就耳聋。从你的八字来看，耳朵在内为肾，在外为耳，故很容易有肾脏或耳朵方面问题，不可不察。八字火土较旺，也要注意脾胃，皮肤方面问题，八字不见金，要注意肺部，肠道方面问题。
          大运分析：26岁-35岁走的是丁丑大运，此大运为财杀相生的大运，八字从官杀，顺从弱势为吉，代表事业运和财运总体较为不错，事业有发展的机会，也有一定财运，可以赚到钱，要好好把握。但地支丑戌未三刑，加上八字有伤官见官的组合，也不可步子迈得太大，要注意官非口舌之事，钱财上花销也是比较大的。
          地支丑未相冲，婚姻宫逢冲，有遇到正缘并结婚的运气。地支三刑带冲，土旺克水，要注意肾脏，耳朵，脾胃方面问题，尤其金水流年要注意。
          36岁-45岁走的是戊寅大运，此大运天干戊土被地支寅木截脚，为伤官克官的大运，大运顺从弱势为吉，天干戊癸相合，正官合身，但地支寅木来疏土，伤官克官，也要注意官非口舌之事，不可做一些高风险的，违规的的事，地支巳火来通关寅木，伤官生财，财运不差，但寅巳相害，也要注意钱财破耗。
          46岁-55岁走的是己卯大运，此大运天干己土被地支卯木截脚，为食神制杀的大运，大运顺从弱势为吉，地支卯戌相合，戌土官星被合克，事业易有变动，好在天干甲己相合，甲木伤官被合拌，故事业运不差，可以取得一定发展，财运也较好。
          56岁-65岁走的是庚辰大运，此大运为官印相生的大运，天干庚金印星透出来生扶日主，若不受生，大运反背，身弱难以胜财官，事业上和求财压力较大，非常辛苦劳累，收获较为有限，可以考虑跟着别人做，回乡发展，能退则退，知足常乐为好。地支辰戌相冲，把土冲旺，土旺克水，要注意肾脏，耳朵方面问题。
          `
  }]
}

export default {
  巳时
}