const 戌时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1984年正月初一戌时'
  }],
  十神: '正官   正印   日元   食神',
  天干: '癸(水) 乙(木) 丙(火) 戊(土)',
  地支: '亥(水) 丑(土) 寅(木) 戌(土)',
  遁藏: '七杀   伤官   枭神   食神',
  大运: '丙寅，丁卯，戊辰，己巳，庚午，辛未，壬申，癸酉，甲戌，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3072.html',
    命主甲: `出生在北方农村，但从小勤奋好学，高考考上211大学，毕业在北京工作两年。结婚后2010年随老公来广东做生意。这十多年育有一子一女，由于照顾孩子没有出去工作，就给老公帮帮忙。
          可是生意做的不怎么样，老公也没什么上进心，爱玩不顾家，身体还不好。我每天都想着能做点什么，让生活好起来，可是出去工作孩子没人管，不工作又觉得生活没有希望，老公靠不住。女儿学习特别差，基本不学什么，很是费心。
          真的是搬起砖就无法拥抱孩子，拥抱孩子就无力搬砖。好无奈，好无力！
          `,
    珠玑: `八字分析：丙火生丑月，为伤官格，时柱为食神，食伤混杂精力不太专注。丑戌相刑，土越旺，食伤泄气过重。好在，丙火自坐寅木长生，寅亥合木，癸水生木，官印相生，丙火便有了生机。
          事业分析：年柱空亡，癸亥干支一气为官杀，官杀混杂，年柱可以代表早年，出生家庭父母，出生不太好，年少时原生家庭条件一般，也代表家里对自己帮助不大，不过好在早年走的是丙寅大运，和丁卯大运，为印比助身的大运，早年大运走的比较好，利于学业考试，可以依靠自己的努力取得不错的成绩。
          丙火日主被乙木和寅木印星贴身，印星为用神，可以得到家人的关爱，个人品德较好，比较仁慈善良的一个人，加上丙火生于丑月，为寒冬之太阳，比较乐观向上，阳光积极，有奉献精神。
          丑土伤官星得令较旺，有印星，构成伤官配印，为人是聪明伶俐的一个人，加上丙火日主被寅木和乙木印星贴身，寅木临学堂，有学习天分，热爱学习，学习能力较强的一个人。
          八字亥水和戌土空亡，年柱和时柱逢空，同时时干戊土食神高透贴身，年柱癸亥官杀混杂，为人比较聪明，智商不低，但也容易想这想那，想法杂乱，给自己造成一些不必要的烦恼，空亡多本身也有悟性强的意思，空亡多也代很适合“务虚”的行业，不适合“务实”的行业，加上伤官配印的组合，是从事心理咨询方面工作的。
          年干癸水正官透出，可代表工作事业，也可代表名气，天干戊癸相合，食神合官，食神代表想法，口才，技术技能等，可以依靠业务技能获得一定的名气，食神透出也代表咨询行业比较适合，做心理咨询这方面可以坚持做下去。
          不过八字年柱癸亥官杀混杂，丙火日主被乙木正印和寅木偏印贴身，有时候做事三分钟热度，坚持不下去，工作容易变动较多，不太稳定，也是有副业之象，可以身兼多职。而丙火日主被印星贴身，能上班求财是最好的，依靠大一点的平台求财。
          子女分析：时柱戊戌干支一气为食神，代表女儿，八字身弱，戊戌为忌，地支丑戌相刑，女儿学习不够专一，学习成效不好，较为贪玩淘气，未来发展一般。
          大运分析：31岁-40岁走的是己巳大运，此大运天干己土伤官透出，己土伤官来克癸水正官，伤官克官，同时地支巳亥相冲，巳火驿马冲了七杀，压力较大，想法较多，同时寅巳相害，寅木印星受损不吉，事业财运不好，同时寅木婚姻宫受损，婚姻环境也不太好，要注意丈夫身体健康。
          41岁-50岁走的是庚午大运，此大运天干庚金被地支午火截脚，为劫财制财的大运，天干乙庚相合，乙木正印被合克不吉，财星破印，丑午相害，丑土财库受损，不适合再和丈夫一起做生意，容易遭受大的损失，能去大一点的平台，依靠专业技能稳定求财比较好。
          51岁-60岁走的是辛未大运，此大运为伤官生财的大运，天干丙辛相合，正财合身，事业趋于稳定，可以安稳上班求财，地支丑未相冲，财库被冲开，也可以得到这个财，但地支丑戌未三刑，财库也被刑伤，开支花销比较大，要注意理财。
          你的八字做心理咨询这方面是适合的，可以去找这方面的工作，也可以做相关的自媒体，都是可以，也算是有一技傍身，可以通过这方面来求财。
          只是你的八字容易想得多，想法杂乱，想这想那，光想不做，缺乏行动力，没有恒心，这是做事的大忌，不管做什么，只想不做，都不可能有收获，且会给自己造成一些不必要的烦恼。
          之前因为要养育孩子，照顾家庭，让你没办法腾出手去搬砖，现在孩子长大了，大部分生活能够自理，完全可以去做一些自己想做的事情，关键是要迈出行动，脚踏实地，坚持下去，自然会有积累收获。
          `
  }]
}

export default {
  戌时
}