const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1983年十二月十五日18点'
  }],
  十神: '伤官   正财   日元   正财',
  天干: '癸(水) 乙(木) 庚(金) 乙(木)',
  地支: '亥(水) 丑(土) 戌(土) 酉(金)',
  遁藏: '食神   正印   枭神   劫财',
  大运: '丙寅，丁卯，戊辰，己巳，庚午，辛未，壬申，癸酉，甲戌，7岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3337.html',
    命主甲: `广东韶关人，从小家里贫困，父有残疾，母有高血压，家有一妹一弟，读书成绩中等，家里实在负担不起三姐妹的学费，初二就辍学去佛山进工厂打工，幸得自己勤劳肯干，颇得老板赏识。
          2018年与一甲木男结婚，2019年育一儿子，婚后丈夫变了一个人，不工作不挣钱天天赌博没责任没担当，我要工作养家带孩子，最终把自己熬成黄脸婆，身体都熬坏了，父母看不下去让我离婚，我不甘心怎么就看错人了，一直坚持，最终没能熬过七年之痒，
          2016年十月我提出了离婚，离婚半年后丈夫知道错了，痛改前非，自己接装修工程来做还开了个便利店，一直求复合，但我已经没有了再复合的想法。
          离婚后我努力改变自己，努力工作报了培训班，看书，护肤，锻炼，我要变回原来的自己，然而2018年一场皮肤病把我打回原形，我以为我要死了，接受不了自己患病的事实，还得了抑郁症，看了心理医生，坚持治疗了半年，吃抗抑郁药，病情总算稳定下来。
          2020年，父母不忍心我一个人流浪在外，希望我回老家找个人嫁了，坳不过就回了老家韶关工作，在一家连锁便利店当个收银员，
          这辈子最遗憾的是读书，书没读好，嫁人，人没嫁对，孩子，没顾周到，挣钱，钱没挣到，没有成为父母眼中的娇子，没能成为谁的偏爱和例外！更没有过成自己喜欢的样子！单是活着就已经拼尽全力，生活和感情波折坎坷不断
          `,
    珠玑: `八字分析：庚金日主生在丑月，为正印格，日主坐偏印，丑戌相刑土旺，日坐魁罡时带阳刃为白虎，是个好强不服输之人。
          结合大运走势来看，早年走的是东方木运，运势较为一般，后转戊辰大运，天干戊癸相合，癸水伤官被合克，地支把土冲旺，运势较为低迷，现在走的己巳大运，也非好运，中晚年行庚午大运，辛未大运，运势一般偏差，格局层次较为一般，坎坷阻碍较多。
          事业分析：庚戌日出生临魁罡贵人，加上时支酉金为羊刃，个性是比较固执的，脾气有些倔强，比较认死理的一个人，一旦自己认准的事，别人很难改变，为人也非常要强，不会轻易妥协服输，不过做事也比较有魄力一些，做事果断，行动力和执行力不弱，可以吃苦耐劳，操持能干，事业心强。
          天干癸水来生乙木，为伤官生财的组合，内心是野心和欲望较大的一个人，不容易满足，八字不见官杀，又有伤官和魁罡，地支丑戌相刑，做事比较胆大，也体现为不太服管的一个人，内心比较向往自由，也容易急躁冲动。癸水伤官高透，比较任性，容易傲慢，要注意人际关系。
          八字天干癸水伤官高透为用神，癸水伤官来生乙木财星，为伤官生财的组合，乙庚相合，正财合身，可以得到这个财，伤官代表和讲话、语言、口才等有关的工作事业，便利店收银员不能充分施展你的才华，这类工作比较固定，对个人事业发展，以及个人能力，没有一些可以积累和提升的，可以考虑咨询销售培训相关行业。
          年柱癸亥干支一气为食伤，癸水伤官高透，魁罡日出生，内心是不会安分的，总想着自己去做点事情，成就自己的事业，你有开店的想法是可以的，八字印星当令较旺，月柱财星制印，印星贴身，有店铺的意象，伤官高透，有一定管理能力，魁罡格，人有一定威仪，有当店长的能力。
          天干乙庚相合，庚金去合两个乙木财星，财星高透，虽有些财透不藏，花销较大，破耗较多，但女命财透也可彰显贵气，时柱乙酉，乙木被酉金截脚，为劫财制财的组合，所以不适合和他人合伙，开店的话自己做为好，也要注意和利益相关者之间的金钱往来，也不适合去做成本过高的行业，小成本轻资产为好。
          地支丑戌相刑，丑土暗藏的癸水伤官来制戌土暗藏的丁火官星，官星受损，为伤官克官的组合，故凡事也要谨慎低调为好，胆大的性格要适当收敛，尤其一些高风险的，违规的事情不要去做，避免是非官非菊粉之事。
          婚姻分析：八字庚戌日出生为魁罡日，临寡宿和天罗地网，地支丑戌相刑，有伤官克官，故不利婚姻，又日支婚姻宫为戌土枭神忌神，酉戌相害，也为不利婚姻的体现，加上自身性格要强刚烈，容易与夫不和，且会因为性格太过强势，会让夫感到压抑，这是要注意的。
          命书曰：“庚戌见乙酉最忌，为白虎魁罡。”确有刑夫克子之说，是因为戌土为官杀库，暗藏丁火官星，可以代表丈夫，而酉金在子女宫为羊刃，二者相害，戌土中暗藏的丁火官星被羊刃所伤，子女宫也有损，且羊刃在子女宫，所以这样的组合，存在对丈夫和子女不利不利的信息，严重的话就是丈夫或小孩有健康之虞，对于你来说，已经离婚了，也相当于应验化解了这部分不利的信息。
          你八字丁火官星在戌土之中藏而不显，为夫星入墓，故未来丈夫个子不高，长相一般，气质平庸，条件一般，比较平凡，婚后很容易身体健康不好，能找一个各方面条件一般的，有利于婚姻稳定，和丈夫健康。
          你庚戌日柱，以食伤代表子女，年柱癸亥干支一气为食伤，亥水暗藏壬水，子女星三位，一儿两女之命，想要孩子可以考虑，但大龄也是个问题。针对你的命局组合来说，可以随身佩戴一个开过光的绿檀木材质的生肖兔饰品，取卯戌相合，可以改善白虎魁罡带来的不利。
          你之前走的戊辰大运非好运，辰戌相冲，婚姻很容易有变动，现在走的是己巳大运，未来走的庚午大运，对婚姻运势而言基本没有太大不利，但要注意丈夫身体。57岁后进入辛未大运，地支丑戌未三刑，这步大运要特别注意丈夫身体和家庭不和之事。
          健康分析：八字不见火，戌土暗藏丁火，但丑戌相刑，酉戌相害，丁火受损，要注意心脑血管，血液方面问题，地支土相刑，很容易有脾胃方面问题，胃病或消化系统容易不好，患胃神经官能症也在预料之中，地支土旺制水，亥水食神代表思想，临天罗地网，容易有心理方面问题，
          要注意调节心情，尤其是上一步大运戊辰大运，很容易引发抑郁症，是要注意的，凡事不要闷在心里，多和人倾诉，多出去走走散散心，凡事要想开一些。
          在睡觉的床头挂一个木葫芦，里面装五色线、灵芝、独活、你的八字、朱砂、路路通。选择天医日到东方找8根柳树枝，分别挂在房屋东北方和西南方，对身体健康有一些帮助。
          大运分析：27岁—36岁走的是戊辰大运，天干戊癸相合，癸水伤官被合克，事业运受阻，财运不佳，赚到的钱有限，花销较大，地支辰戌相冲，伤官见官，容易遭遇官非口舌，你在这步大运离婚应了官非之事，接下来也要多加注意。
          37岁—46岁走的是己巳大运，天干己土来制癸水伤官，也非好运，但好在非合克，故比起上步大运运势有所起色，巳火七杀临驿马，奔波走动较多，求财辛苦，巳酉丑三合，丑土印星被合动，也可以开店。
          47岁—66岁走的是庚午大运，和辛未大运，天干庚辛金比劫高透，但旺了癸水伤官，伤官来生财，这两步大运财运有所提升，可以赚到钱，但庚午大运，乙庚相合，比肩夺财，要注意和同辈之人金钱往来，辛未大运也要注意，且丑戌未三刑，要注意官非口舌之事。
          `
  }]
}

export default {
  酉时
}