const 子时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '食神   枭神   日元   伤官',
  天干: '丁(火) 癸(水) 乙(木) 丙(火)',
  地支: '丑(土) 卯(木) 巳(火) 子(水)',
  遁藏: '偏财   比肩   伤官   枭神',
  大运: '大运：10壬寅、20辛丑、30庚子、40己亥、50戊戌、60丁酉、70丙申',
  批注: [{
    作者: '命理百科',
    出处: 'https://www.qiushibang.com/a/13576.html',
    命主甲: `这是千里命稿当中的命例，为民国时期外交家颜惠庆的八字。这是别人拿着颜惠庆的八字找韦千里来论断的，可信度较高。
          `,
    珠玑: `八字分析：命主生于卯月，为禄旺之月，时上子水生身，月上癸水生身，身旺之命，年上丁火被癸水所克，发挥作用不大，幸好有时上丙火泄秀，年支丑土耗身，最妙丙火通根于日支巳火，泄秀有力，丑土有丙丁火土，也是有来源而力量不绝，八字五行平衡，丁火帝旺在巳，癸水之禄在子，乙木之禄在卯，丙火之禄在巳，天干均通根于地支而有力，东西南北运皆可，宜为富贵长久之八字也。
          大运及流年分析：命主出生于上海一传教士家庭。
          1895年，大运壬寅，流年乙未，未与年支丑相冲，冲则动也，毕业于上海同文馆，后留学美国弗吉尼亚大学。
          1900年，大运辛丑，流年庚子，丙火伤官合杀，乙庚相合，子丑相冲，从弗吉尼亚大学毕业回到上海，成为圣约翰大学最年轻的华籍教授。
          1908年，大运庚子，流年戊申，随驻美公使伍廷芳使美，领二等参赞衔，负责使馆的英文文案和留学生事务。
          1909，大运庚子，流年己酉，官印相生，受清廷外务部征召回国任主事，并出任清华学堂总办。
          1910年，大运庚子，流年庚戌，财旺生官，获授翰林院编修。不久，擢升为外务部参议。辛亥革命爆发前，已升任外务部左丞，开始进入中国外交界“领导核心”。
          1912年，大运庚子，流年壬水，官印相生，伤官佩印，出任民国外交部次长，
          1913年1月，出任驻德国全权公使，其后又兼任驻丹麦公使和驻瑞典公使。
          1920年，大运己亥，流年庚申，印旺官旺，辞去三国公使回国，署理靳云鹏内阁的外交总长。
          1921年，大运己亥，流年辛酉，杀印相生，署理国务总理。
          1922年6月12日，大运己亥，流年壬戌，戌土财星坏印，又戌卯相合，合去乙木强根，虽然担任黎元洪政府的国务总理兼外交总长，但是因屡遭国会刁难，不得不于 7月29日内阁全体辞职。
          1926年，大运戊戌，流年丙寅，财星旺而坏印，伤官力量过旺，5月，在 吴佩孚 支持下再度组阁，因“光杆内阁”无阁员入阁，6月20日，被迫下台。1931年，“九·一八”事变后，大运戊戌，流年辛未，财杀相生，10月，出任国民政府外交特种委员会委员，主要负责对美交涉。11月，被任命为驻美公使，抵美后不久又被任命为中国出席 国联 行政院会议首席代表和中国驻国联代表团团长。
          1932年大运戊戌，流年壬申年，官印相生，作为中国首席代表出席国际裁军会议，在其努力下，中苏两国正式复交。1933年，大运戊戌，流年癸酉，杀印相生，被任命为中国驻苏大使。
          1936年3月，大运丁酉，流年丙子，子卯相刑，命主坚辞驻苏大使职，获准。
          1937年，大运丁酉，流年丁丑，丑酉半合金局，卢沟桥事变后，举家南迁上海，在“八·一三”淞沪抗战期间主持上海的难民救济与伤兵救护工作，并出任上海国际救济委员会主席、上海防痨协会会长等职。
          1938年1月，大运丁酉，流年戊寅，羊刃架杀，当选为国际反侵略大会中国分会名誉主席团成员，6 月，当选国民政府第一届国民参政会参政员。8月，出席于美国维多利亚港举行的太平洋国交讨论会，在会上谴责日军暴行，并就国际安全展开研讨。会后，继续留美协助胡适拓展对美外交，一度获得蒋介石赏识，邀其出任外交部长，婉拒。
          1940年，大运丁酉，流年庚辰，官杀混杂，3月15日，返抵香港。不久太平洋战争爆发，香港沦陷，与陈友仁等人遭日军软禁，亦被日军押返上海，自此闭门不出，拒不与汪伪政府合作。
          1946年，转为丙申大运，流年丙戌，选为“联合国善后救济总署远东区域委员会”主席。国民党行宪政府成立时，蒋介石曾竭力拉拢颜惠庆担任立法院长，被拒绝。
          1949年2月，毅然留在上海，迎接解放。新中国成立后，出任中国人民政治协商会议委员、中央政府政务院委员、华东军政委员会副主席、中央人民政府政治法律委员会委员和中苏友好协会会长等重要职务，为新中国的建设做出了贡献。
          1950年5月24日，大运丙申，流年庚寅，寅申相冲，因病于上海逝世，享年73岁。
          `
  }]
}

export default {
  子时
}