const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   劫财   日元   食神',
  天干: '甲(木) 甲(木) 乙(木) 丁(火)',
  地支: '戌(土) 戌(土) 亥(水) 丑(土)',
  遁藏: '正财   正财   正印   偏财',
  大运: '癸酉，壬申，辛未，庚午，己巳，戊辰，丁卯，丙寅，4岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/316.html',
    命主甲: `出生地晋北，我自认从小学习不差，可是每到大考中考高考成绩都是不尽人意，总是让人大跌眼镜，虽然如今毕业好几年了，也认识到不能一直执念于过往的，人的运气不可能一直差，
          可是我毕业后第一份工作，公司一直没有业务，也不给我转正，后来辞职待业考研又失败了，去年又找了工作，公司又是效益不好加上疫情影响，我已经被拖欠工资大半年了，
          2020.07月这个月月初再三纠结下裸辞了，因为我担心越拖越多，偏偏我是家里行大，自从有了我弟我家家庭情况不如从前，我也感受到了深深的重男轻女，有时候又会安慰自己可能是自己太狭隘了。
          疫情下我也感受到一份稳定工作的重要，在大城市的小企业总感觉是漂泊者，风雨飘摇，工作不稳定，总感觉缺一点儿什么，对于我自己和我家我感觉稳定工作太重要了，我现在辞职了，想考公务员。
          `,
    珠玑: `八字分析：乙木日主生在戌月失令，戌月土旺，金退气而水进气，而月令本气为土耗日主的力量，同时年支也为戌土，增强了土的力量，而日支为亥水可生日主，但八字年支，月支，时支都为土耗日主，且地支土旺克日主水，所以亥水生助日主的力量也会打折扣。
          虽然年干，月干是甲木帮身，对乙木日主有一定的帮助作用，但是八字五行木在地支无强根，帮扶力量不强，所以乙木日主偏弱，喜生助的水木五行为用神，火土金五行为忌神。
          事业分析：八字中年干，月干为甲木劫财帮身，对八字日主是有所帮助 ，能获得一些人的帮助，但甲木劫财在地支无强根，虽然日支亥水本藏甲木之根，但地支土旺克亥水，所以比劫帮扶力量也不大。而日支亥水正印生助日主，也代表很多时候需要靠自己个人努力，亲力亲为，才有发展进步。
          八字日主整体偏弱，难担起大的钱财和财富，加上有财克印的组合，在事业上会比较的艰辛，不太顺，也容易对工作不太满，获得的待遇也不算太好，容易导致事业不稳定。
          从大运走势来看，后面一路走的是官杀，正偏财到食伤忌神大运，大运帮助不大， 会比较辛苦忙碌，整体格局层次不太高，属于普通的八字组合。
          你的八字财旺喜比劫帮身，也喜印来生助日主，适合往行政，人力资源，助理及医药卫生，健康养生健身，文职文档数据管理方面发展。而八字印星被克，财官星都为忌神，忌神力量强没有得到好的制话，没有什么公务员的信息。
          你八字日主偏弱，喜印比，印星代表学业，日支亥水为正印生助日主，代表你还算聪明对学业运有些帮助。只是八字地支财旺克印，印星被克，对你的学业有不利影响，容易有些发挥不稳定。
          加上八字劫财在年干，月干，早年两部大运虽然为正偏印大运，生助了日主，但同时也生助了劫财，也代表你学业方面的竞争大，总容易落后于别人，属于学业有利有弊的运气，且有时发挥不出应有的水平，对你学习考试是不太好。
          你今年走的是官印相生的运气，且大运为辛未大运，八字官杀混杂，地支财克印，所以今年的学业运是不理想，难考上公务员。一定要考的话，只有在2022年，2023年，印比劫相生，印禄相生时，相对好些。
          健康分析：你八字最旺的五行为土，其次到木，再到火，相对较弱的五行为金和水。而八字丁火做丑土湿土被泄，且戌土为丁火的墓库。
          而八字土克水，火被泄入戌墓，而木盖头土，地支燥土，湿土克水，所以你的身体健康方面要注意预防些气血不足，肾水系统，妇科，皮肤病，晚年心脑血管方面问题，特别是在八字火土旺克水，金旺冲克木的流年大运时多注意下，特别在未来的2026年，2030年，2036年，2039年，2040年，2048年，2060年和2066年，2069年时多注意下。
          大运分析：24岁-33岁走的是辛未大运，此大运七杀得财生，七杀克比劫，地支丑未戌三刑，且财克印，属于忌神大运克喜用神的组合，所以此大运你的压力是比较大的，也容易对工作不满。同时会比较的忙碌，且容易招惹小人，事业比较被动，且发展收获不大，支出花销却不少，整体大运不佳。
          34岁-43岁走的是庚午大运，此大运正官与八字乙庚合，克耗日主，地支食神力量增强，食神生财，财星力量增加而去克印星。代表事业还是有相应的压力，同时自己也容易有些心浮气躁，想要做些新东西，但大运食神生财，财星力量增加，身弱不担财，可以说这个大运没有太大的收益，宜谨慎求稳，心思太大太杂，瞎折腾容易破财。
          己巳大运与日柱天克地冲，八字甲己合，地支巳亥冲，驿马相冲，对事业也不是太有利，且属于辛苦忙碌，外出奔波走动，辛苦求财发展的运气。
          戊辰大运与年月柱天克地冲，财星更旺，地支财克印，你的压力也是较大的，且同样有些不满，烦躁不安的情绪波动，情绪状态不太好，忙碌付出多，但收获一般，发展进步不是太大。
          你的八字虽然透出两个甲木劫财帮身，但是在地支无根，所以帮扶力度不大，且虽然日支为亥水，但亥水被旺土克制，对工作的不顺心容易导致你心烦气躁不满，而影响到工作。但比劫在原局没有明显被冲克，踏实用心努力的话，也能些收获，只大运走的不太好，发展不是很大，整体八字格局层次比较普通。适合求稳发展，尽量提高自己的专业能力，往大平台靠拢。
          `
  }]
}

export default {
  丑时
}