const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1992年八月十三日午时'
  }],
  十神: '偏财   劫财   日元   比肩',
  天干: '壬(水) 己(土) 戊(土) 戊(土)',
  地支: '申(金) 酉(金) 子(水) 午(火)',
  遁藏: '食神   伤官   正财   正印',
  大运: '戊申，丁未，丙午，乙巳，甲辰，癸卯，壬寅，辛丑，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/388.html',
    命主甲: `非常迷茫，好像学业、事业一步步都还比较顺利，属于靠自己就获得了一个还不错的结果，但是在感情方面一直不顺，遇到的都是烂桃花，不是别人已经有喜欢的人了，就是我根本不会喜欢的男生喜欢我，现在真的太苦恼了。
          从小到大，可能是由于父亲在教育上的缺位，我一直感觉我不会与异性交流交往。我外在形象、学历、家境都还不错，但截止到现在我并没有谈过真正意义上的恋爱，可能更多的止步于与异性短暂的暧昧，感觉无法与异性建立亲密的关系。
          现在一转眼已经到了谈婚论嫁的年龄，但奈何自己圈子太小，很难遇到合适的人，而父母介绍的2个相亲对象，没有见过面就已经有完全无法接受的点。
          太迷茫了，太发愁了，经常因为这事愁得睡不着觉，住在家里也是与家里人矛盾不少。其实我内心也很希望能早点结婚，我的父母在他们那个年代也是结婚比较迟的，目前已经全部退休，我也希望能早些生个孩子满足他们的心愿。
          身边也有朋友很顺利的与相亲对象认识两三个月就结婚了，我有时候也想随便凑合了，但目前还没有那样的勇气。
          `,
    珠玑: `八字分析：戊土生在酉月，为典型的伤官格八字，女性伤官格八字如果搭配不好，最是不利于婚姻。你八字食伤旺，所以恋爱和结婚的欲望是很强烈的，同时偏财壬水得强根子水，也一定程度上化泄了伤官的力量。
          时辰午火正印可以制伤官，但中间却隔了子水财星，因此这里的正财子水是起了坏作用的。因原局无木，劫财也有一定程度的影响，都是不利于婚姻的因素。子午冲，婚姻宫不稳定，即便结了婚也要注意夫妻感情的维护。
          事业分析：八字青少年时期食神生财，秀气发露，所以学业有成。一到酉限，伤官的破坏性就开始真正展露了，之后财印相冲，大运来看也有不稳定的因素，自己要多沉住气，多学习积累，做到厚积而薄发了。日支虽然坐财星，但是没有起到好的作用，冲了印星，说明容易有破耗支出，留不住财，容易破耗破财。
          八字身弱，食伤旺生财，印星被财星冲克，也代表容易缺乏周密计划，容易急躁，急于求成，考虑不周而破财。
          结合你的大运来看，八字开始走印运，属于好运走的早，对你事业财运发展有帮助。但后面的大运组合不太好，容易有些不稳定，财来财去，故中年后宜谨慎保守发展比较好，整体的格局层次小康水平。
          婚姻分析：你说总是烂桃花多，自己喜欢的名花有主了，或是能在一起的又不喜欢，主要是因为你的八字月令为酉金伤官，同时年支为申金食伤，八字食伤旺，食伤对女命来说是克婚姻的，是一种天然的排斥，一方面择偶方面有一定要求，另外一方面也代表生活中难遇到自己满意的对象。
          同时对女命来说，官杀代表女人的丈夫，你的八字当中没有官杀，异性缘分浅薄，同时子水财星冲克午火印星，八字没有五行木官杀来通关印星，也导致婚姻会多波折，谈而少成。在对待感情上也容易不自觉的摆出高姿态，使人难以接近，对感情比较谨慎，难喜欢上别人。
          你的八字无官杀，婚姻期多会在大运或流年上出现官杀合动与合入婚姻宫为应婚之期，你前面走的大运都无官杀出现，流年出现官杀也是比较弱的，大多也是假象征，只是露水桃花。
          现在走的是丙午大运，依旧没有出现官杀，而且丙午干支火旺，是泄耗官杀星的，不利谈婚配，八字原局本身没有官杀，大运又是泄耗官杀力量，也说明这个大运里桃花很弱，遇到的也多是自己难满意的。
          下一个大运是乙巳大运，乙木为正官出现于大运，意味着谈婚论嫁的时候到了，乙木正官出现在大运只是丈夫星即将来临，还要流年引发，当流年官杀出现的时候就是真正的婚期，2024甲辰年官杀透天干，支申子辰合入合动了日主婚姻宫，有结婚的好运。
          金水偏于旺地，又无木官杀出现来通关流通，在择偶上如果对象八字木旺则比较好，金水偏旺的话则不太好。
          对象圆脸，肤色不算白也不太黑，身高一般般，大概在175左右，眼睛微大些，也比较的有神，鼻尖肉多，耳朵略大，贴脑不显，眉毛有些浓，手掌厚实，整个人看起来比较的有精神，
          大运分析：21岁-30岁走丙午大运，干支都是印星，整体大运组合印星通天地，对你学习是有利的，但丙午与八字地支金水相冲，形成水火冲克的局面，为财破印破，会影响你的事业财运，且容易破财，伤财伤心，做事宜谨慎求稳为好。
          31岁-40岁走的是乙巳大运，此大运乙木正官透出，且壬水财星生扶，官者主管理，升迁之义，对你的事业求财是好的。而官星到位，也有利你的婚姻，同时巳火为印星拱合时支午火印星，是一步吉利的大运，但要注意不要得意忘形，事事得用心经营方可无忧。
          41岁-50岁走的是甲辰大运，此大运甲木透出与己土相合意要化土来助日主，但酉申金当令又泄土之气，只是有合而无化象征，地支申子辰三合化为财星水冲时支午火喜用神，
          代表这个大运有往不好的方向变动，午火为心，为血，申子辰三合财星水冲午影响了身心，此大运要注意养生调养身心，健康上有影响，忌辛辣酸食物，多食用易消化食物，确保脾胃之正气不受损。
          癸卯大运，戊癸合火助日主之势，但只是有象而无实的假象，因为申酉金当权司令，卯官杀星冲酉会引发子午冲，此大运走的不太好，子午卯酉见冲多主不吉，身体状态欠佳，事业财运也不太有利，要破点财消灾。
          壬寅大运，也是忌神运，地支金木冲克，虽然生生木可以助火，但整体也是不太理想的，总体而言晚运是不太理想。
          你的八字原局组合受冲破用神影响事业财运，不过你早年走的运势比较好，能够有所发展，只是中晚年运气不太好，不谨慎低调的话很容易破败，整体格局不太高，大致小康以上水平。
          而婚姻方面虽然官杀丈夫与子女迟见，但你命里是适合晚婚的，对你婚姻稳定也有帮助，好好经营可以白首谐老，而时柱戊午为用神，说明子女有出息，也可帮扶得到父母。
          `
  }]
}

export default {
  午时
}