const 申时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正官   劫财   日元   比肩',
  天干: '癸(水) 丁(火) 丙(火) 丙(火)',
  地支: '亥(水) 巳(火) 戌(土) 申(金)',
  遁藏: '七杀   比肩   食神   偏财',
  大运: '丙辰 乙卯 甲寅 癸丑 壬子 辛亥',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/138.html',
    命主甲: `建禄格行运不济出身清寒，财官即位自创事业功成名就
          `,
    珠玑: `本文的命造出生日的日干为丙火，所以属命丙火命，生夏天四月（巳火月），巳火为日主的“建禄”，形容为火之旺地。因为丙火在一年十二个月中，火最旺的有二个月，其一就是此夏天四月，巳火月，称为临官或建禄；
          另一个月是夏天五月，午火月，称为帝旺或阳刃，其气最旺。临官、建禄犹如人到壮年；而帝旺、阳刃就等于一个人的体力、智力及事业已发到极限的最高阶段。
          当然，这二句话是有前提的，就是在整个八字在配合之后，仍是日主身强的话，才是“财官喜透天”的。
          因为月令是八字中最强的一个地支，日主生在巳火月，亦是指日主一生下来就身旺，这时八字中只要再有两三个生助日主五行的，便可几乎确定日主属旺。
          根据正格论命“以中和为贵”的原则，旺则喜克或泄，而财星是日主所克之五行，官星是克制日主之物，财星能生官星，所以日主旺，就喜命中有财星和官星来消化日主的旺气，使其得中和。
          财为养命之源，官为荣身之物，是应用在身旺喜财官为用时，这时既能消化日主的旺气，又能养命养命，两相其利，何乐而不为呢？所以古人便总结出这二句命理之言了。身弱时则另当别论。
          此造既然是“建禄格”，现在就看下是否符合“财官喜透天”的条件了。先看天干，除了日主丙火自己处，尚有一丙火、一丁火加强日主的力量；日主丙火自坐戌燥土，戌为火之墓库，内藏戊辛丁，有丁火微根；
          因日主丙火生巳火月本身就身旺，现加上天干再有丙、丁火之助，地支有戌火库，便可确定日主在这个八字中属强，的确是喜见财官（金水）为用了。
          现查到年干癸水正官透出，值亥水强根可用，时支申金为财星，虽不透出天干，但申在地支为金之强根，更为可用。
          其实，这二句话中的“财官喜透天”，只不过是为好记忆而作的，如果八字中的财官真的只是透出天干，而地支不载，财官虚浮，有名无实，倒不如有地支而无天干，更为实用。那为什么又这么写呢，因此天干在外，透出为用，它是想表示的是喜财官为用的意思。但如果你说：“建禄生提月，喜财官为用”，就好像不够顺口，不够诗意的了。
          当然了，最好的是喜财官既透出天干，地支又有根。如两者不能全，宁可有地支，而无天干，因地支重于天干。犹如一棵树，地上枝叶全无，但留得树根在，来年春天可再生荣。但如树根已枯萎，树上纵有枝叶，但并不长留。
          可见，此造天干癸水官星透出，得亥水之根，又见申金强金可生助癸水，基本上符合了这两句话的要求，即丙火日主身旺，喜财官为用，命中财官皆有，可入合格的命造，一生名利可得，为主掌偏财的官员。大运仍喜金水，忌木火燥土。
          为什么只是说此造可入合格的命造，而不入上等命造呢？那就是看刑冲会合，喜用有无盖头截脚，喜用是否团结有力等因素了。
          此造喜用癸亥与月柱丁巳天克地冲，喜用受冲。不是说水克火，冲去忌神是好事吗？但此造火生夏天，夏月火旺水囚，局中亦火土之力强于金水，所以此处是火克水，虽杀敌一千，也自伤八百，这里的水虽受损，但也减少了忌神火的力量，不完全是坏事。唯年柱与月柱相冲，多主早年祖业破败，或父辈有刑克，或早年不佳，背井离乡等事。
          其二前面说过，喜用申金藏地支，金不透干，被丙火盖头，金气不免受伤。其三是喜用金、水离日主较远，帮助日主的力量不够直接。其四是申金在时支，癸亥水在年柱，金去生水相隔太远，这些都是造成不能成为上等格局，只能是中上格局的原因。
          好在其大运走向不错，青少年33岁前走东方木火助火泄水汽，出身清寒的农家，中学毕业便进厂当技工，后多次转换职业。直到33岁入北方癸丑水运后，才自创事业，其后几十年西北金水运相助，终于功就名成，创出一翻天地。
          `
  }]
}

export default {
  申时
}