const 子时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '食神   劫财   日元   七杀',
  天干: '庚(金) 己(土) 戊(土) 甲(木)',
  地支: '子(水) 丑(土) 申(金) 子(水)',
  遁藏: '正财   劫财   食神   正财',
  大运: '庚寅 辛卯 壬辰 癸巳 甲午 乙未',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/80.html',
    命主甲: `缺少阳光温暖`,
    珠玑: `此造出生日的日干为戊土，所以属戊土命，生十二月丑土当令之时，地支再见子丑合土，月干己土透出帮身，以为身旺，喜庚金食神透出，值根于申金泄秀为用，再见子水正财。身旺喜伤食生财，富贵自天来，以为是好命。殊不知此命在中年出意外，工作时触电身亡，岂不是命理无验吗？
          不是的，上述分析只是依据五行中生克扶抑的方法，这固然没有错，在平常的月份中，大多数命例都可以用这种方法推算出来。但这还不够，仅言生克，当然不足以尽其变，还须兼顾气候之需要。
          尤其是冬天和夏天出生的命，更牵涉到调候取用神的重要性。例如冬令不可无火，寒冬有太阳之暖照，方可免冰冻之苦。夏令不可无水，炎暑有雨水之凉气，方得消解其燥热，以获气候之适当中和。
          再具体来说，冬令的亥、子、丑三个月出生的命须取火调候，夏令的巳、午、未三个月出生的命须取水调候，这大寒和大暑前后的六个月出生的人，皆首先以调候为重，取能调候之神为用神，其余一概置缓论。除非能入“过于寒者，反以无暖为美；过于暖者，反以无寒为宜（例如炎上格）”等特别格局例外，但这种情况占命例不到十分之一。
          现根据此命生在十二月冬令，严寒冰冻，当然首先要应用上述的调候取用神法。十二月严寒土冻，调候为急，必用丙火为先。有火方能任用财、官。无火，食、伤、官、煞、财星皆无可用，故云：冬土以火为主要用神。现对照此命，刚好就是五行缺火。无火，则此命的所谓“食伤生财，富贵自天来”只是一句空话，皆无可用是也。
          具体分析起来看：月令丑为湿土，戊日生丑月，只是通根而不以旺言。更见子水在年支，子丑一合，已变成湿泥。再见地支申子半合水局，寒金冻水相继齐来，地支几乎成了结冰的池塘，绝无生气。
          天干虽有己土帮身，但己为阴土，缺了火，土再多也不过是一堆烂泥，烂泥扶不上壁（墙壁）。此时的食神生财（金生水），只是徒然增加了戊土的寒湿之性，使日元高亢之戊，变成湿泥，这时还敢说“食伤生财，富贵自天来”吗？显然不会是了。
          假如到处为止，只不过是一个缺少温暖，庸碌无为的寒苦命矣，还不至于凶死。更不利的是，此命生于晚子时，为甲子时（早子时是壬子），甲木为日主戊土的七杀，得地支子水相生，财生杀旺来攻身。时柱又为命局的终结处，指此命的结局不会吉祥。加上命中缺了火这个主要用神，格局层次低下，更显出这个七杀结局的凶性了。
          取用神为喜火、土，忌金、水、木。32至37岁的辰运，与命中申子合成水局（申子辰三合水局）。合者，机遇也。此命以水为财，我（戊土）克者为财，指有一发财或破财的机会。如水为喜用神，就为发财，为忌神则破财。故在此运中与他人合伙开餐馆不成，还被他人倒债而破大财。
          至癸水运，又是忌神，癸水生甲木七杀攻身。
          `
  }]
}

export default {
  子时
}