const 寅时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1992年九月二十六日寅时'
  }],
  十神: '食神   比肩   日元   枭神',
  天干: '壬(水) 庚(金) 庚(金) 戊(土)',
  地支: '申(金) 戌(土) 午(火) 寅(木)',
  遁藏: '比肩   枭神   正官   偏财',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/336.html',
    命主甲: `自从自己毕业后，感觉在工作上很不顺心，虽然貌似有很多机会，但是就像水中泡影，根本就抓不住，而我觉得自己已经独立了，所以这些烦恼很少同家人说起，但是我一直很压抑。
          男朋友对我也不如一开始那样的好了，两人经常的争吵，所以我内心还是很痛苦的。
          在24岁大学毕业以前都是非常顺利的，本来只能考个专科，可是因为高考那一年，发挥很好，考上了自己心仪的本科大学，这期间，我的父母对我很是呵护，生活、学习方方面面都是快快乐乐的。
          直到大学毕业以后进入了我的本命年，运势变得非常的曲折，工作方面，这几年一直非常的不如意，就像师傅所说的一样，变动是非常大的。
          本来家里人为我找到了一份很好的稳定工作，进去的时候费了很多的劲，但是我选择了辞职，后来有好几种工作摆在我面前，但都是因为各种原因被刷掉了，现在做着自己不喜欢的行业，真的是度日如年。
          `,
    珠玑: `八字分析：日干庚金生于戌月而得令，八字土金两旺，日干是不弱的人，故你为身旺之命。由于八字为食神泄秀之命，所以是一个特别不错的组合。而八字的申金和庚金来保护食神，所以一生不愁衣禄。八字有财来生官，也是一个很好的组合，正官得到了寅木的保护，所以是很有能量的。
          八字喜水木为用神，土金火为忌神，由于用神贴身，财官相随，所以一生衣食无忧，命格是非常好的。
          工作方面，由于你为偏印格的命，所以适合从事一些偏门性的工作。八字喜见财为用，所以在走财星大运时是最好的。由于日支坐于正官，所以你能有一份比较的工作，可以长期的从事下来，八字是比较适合上班的，由于财来生官，所以财运是很好的，只要不频繁的换工作，坚持下来是会有所发展的。
          你八字的食神状态是非常好的，金水泄秀也说明你长的很不错，气质超然，身材也是很好的，是聪明有气质的一个人，只要能够继续提升你的学历，那么以后也可以找一个各方面都不错的丈夫。年支有食神为用，所以从小也不会吃什么苦，早年生活很好，出身富裕，很是无忧无虑。
          由于八字中有合官之相，有印来透，有食神来配，所以你婚后的财运会更加的好，对未来不要太担心了，只要找一个适合自己的方向，慢慢坚持下来自然就会有回报的。
          婚姻方面，日支坐正官又为用神，又临天乙、福星贵人，所以你的婚姻是很不错的。丈夫非常各方面的条件非常的好。由于日支临财生官，所以你是比较旺夫的，你的丈夫将来必不会很平庸，会有官运，或者是有自己的事业。
          由于日支为夫宫临正官，所以你一生的桃花也是非常多的，尤其是在中年时期，而七杀在时支之上，所以你是一个比较有分寸的人，对家庭还是很有责任心的。
          2020庚子年，由于冲了正官，并且和大运相穿，所以感情方面有些不好。如果还没有进入婚姻，那么会面临分手，但是冲也代表婚动，所以明年如果结婚的话，可以避免。希望你能够好好的把握。
          大运分析：你在4-24岁走的为己酉和戊申大运，为土金大运，大运虚透，所以金起了作用，壬水没有受伤，所以运势还是不错的，加上年柱坐食神，所以小时候你的家庭条件很好，父母很是疼爱你。
          你在24-34岁走的为丁未大运，丁壬、午未相合，食神起不到大的作用，会影响你的事业和健康。另外日支逢合，说明不利婚姻，尤其是2020年是变动很大的年份，2021年和大运相冲，也是不利的，2022年冲了太岁，不过生了午火，所以还是不错的。2023年有伤官生财，所以财运很好。
          你在34-44岁走的为丙午大运，此大运官杀出现，所以不满现在的工作，会做一些副业，但是官杀主乱，所以还是要控制一下野心和欲望。
          这十年你在工作和感情生活善上会觉得生活非常乱，但你八字并不怕火，故而不能为凶。且大运利夫，所以丈夫发展的不错。
          所以女人八字最好要纯，因为生活会更加简单一些。
          后面的乙巳，甲辰，癸卯，壬寅大运都还算不错的，特别是晚年的大运走的非常的好，你后半生很是不错。
          你八字是非常旺的，是一个很好强和爱面子的人，所以建议你去学会控制自己的性格。工作方面，由于你的命中是有官运的，所以可以从事比较有前途的工作，比如说考公务员就很适合你，34岁以后的大运为官杀，所以也可以做些投资，副业都是很不错的。
          `
  }]
}

export default {
  寅时
}