const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   劫财   日元   伤官',
  天干: '辛(金) 丁(火) 丙(火) 己(土)',
  地支: '巳(火) 酉(金) 寅(木) 丑(土)',
  遁藏: '比肩   正财   枭神   伤官',
  大运: '丙申 乙未 甲午 癸巳 壬辰 辛卯',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/172.html',
    命主甲: `身强财旺食伤流通，东南木火助力成地方大富
          `,
    珠玑: `大富之命有许多种形式，其中最常见的是：财旺、身强、有食伤。财旺是指八字中财星得月令之旺气，或财星天透地载有力；身强是指日干在地支有强根，或得印、劫之助力。因为财为我克之物，所以财星与日干是对立的，例如日干是水，财必然是火，日干是火，财必然是金，等。两者之间有食伤（食神或伤官）来流通其气，富豪之命必成矣。
          此造出生日的日干为丙火，所以属丙火命。生八月酉金当旺之时，八月丙火，犹如日近黄昏，丙火至酉，死地也。这是指按十天干周行十二地支的生旺死绝表来说，丙火太阳行至酉金之位时，则火气尽而无余力了，可见一出生时，日主丙火就很衰弱了。
          月令酉金是日主丙火的财星（我克之物为财，财为我享用之物），财星得月令之旺气，即一出生，财星就很旺，且见天干有辛金正财透出，财旺已经是无疑的了。但日主丙火能否承受起如此重负呢，就看是否身强了？
          十分幸运，日主丙火自坐寅木，木当能生火，且旁边的丁火可助力，再见年支巳火为禄旺之根，的确亦是身强。这样，财旺、身强都符合了要求。
          最后看有没有食伤（食神或伤官）来通关了，也真的是看到了时柱是己丑土伤官，流通火金之气。这样就完成了：天干丙丁火生己丑土，己丑土生辛酉金。丙丁火在地支有寅、巳木火之根，己土地支有丑土、巳火为根，财星辛金地支有酉金强根。天干四字，每字都天复地载，八个字中，字字有用，无一浪费。
          上下贵乎情和，左右贵乎气协，天地顺遂而精粹，这都是能成为一个好命的根据。所以此命能发挥才能（火生土），赚到钱财（土生金）而成大富就不足为奇了。
          现在再进入下一步：取用神。既然此造财旺身也强，究竟是取助财？或帮身来作为用神？那就要分析八字中的财星和日主丙火哪一方的力量较大了？
          现在看到，财星一方，除了酉金正财得时势当令之助力外，还有一个巳酉丑三合金局，这样就大大加强了财星一方的力量，时干己土也泄弱丙丁火气而去生辛金。反之，丙火一方，由于年支巳火之禄旺之根，被合为金局，火力就大大地打了折扣，现只靠寅木顶力支撑，及月干丁火帮忙分担财力，才算不致太弱。
          双方衡量之下，财星金一方仍属较强，日主丙火一方属身弱，故取木、火帮身为喜用神，土、金、水为忌神。除少年时申金运不利外，其后六十年有东南木火大运的助力，成为地方一大富。
          `
  }]
}

export default {
  丑时
}