const 寅时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1994正月二十四日寅时'
  }],
  十神: '偏财   七杀   日元   枭神',
  天干: '甲(木) 丙(火) 庚(金) 戊(土)',
  地支: '戌(土) 寅(木) 寅(木) 寅(木)',
  遁藏: '枭神   偏财   偏财   偏财',
  大运: '乙丑，甲子，癸亥，壬戌，辛酉，庚申，己未，戊午，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/466.html',
    命主甲: `17年大学毕业在线下和线上辅导机构做教育工作大概2年，19年考上县里的高中教师编制，一直任班主任工作，但是感觉自己很累，也不怎么受领导重视。
          今年已经27岁了，还没有对象！正式工作2、3年了，前面陆陆续续有学校老师介绍对象，但是基本都是见了一面聊了几天就没联系了，为此我深受打击，我觉得我自身条件还不错，为什么不受相亲对象的欢迎？是我不主动还是不够优秀？
          这让我很不自信，也害怕相亲，更害怕相亲失败！关键是现在也没有老师跟我介绍对象了，不知道是什么原因？
          `,
    珠玑: `八字分析：庚金日主生于寅月，寅中甲、丙、戊全透，为财生杀、杀生印的组合，地支三个寅木偏财旺极，丙火七杀也旺，戊土偏印有根在年支但受克严重。你的八字从格局方面来讲，是个不错的格局，只是五行不平衡导致一定的偏枯，对层次有一定的影响。
          庚金喜炼，寅月也可以暖局，且泄财星保护印星，也有一定的帮助，所以丙火七杀只要不是太旺的话，是不忌讳的。
          事业分析：庚寅日柱，地支寅木偏财旺，同时甲木在年干透出，财星也代表一个人对金钱物质的欲望和追求，也说明自己钱财有比较强的追求之心，欲望大。
          庚金得印生，又有财生丙火七杀，庚金得丙火炼，又可以暖局，为人还是比较正派，刚毅，做事有自己原则的，而脾气也比较大，能力还是不错，有时让人感觉比较要强，而八字财克印，对现状的不满足，不满意的情绪也容易在工作生活中表现出来。
          虽然月干透出丙火七杀，但是七杀炼庚金日主的同时，也是克日主，也代表自己需要承受相应的压力，烦恼，阻碍。
          八字日主弱，财在地支乘旺，又财克印，也代表自己很容易对工作有不满情绪波动，容易计较，埋怨。
          天干甲木财星生丙火七杀，戊土印星在时干生日主，先七杀后偏印，事业上开始承受的压力比较大些，而印星在后，也代表自己通过坚持努力的话，困难阻碍可以得到解决，获得好的进步收获，劳动成果需要付出努力才可以获得的，是来之不易的。
          从你八字组合来看，你命喜印，老师这个职业是适合你的，做生意不适合。
          八字印星透出，天干有财生七杀，先七杀后印，代表通过自己的努力也会有所提升，只是地支戌土印星的根被财克，导致时干戊土印星力量不强，虽然有发展提升空间，但提升幅度也不会太大而一些小职位职权还是会有的。
          今年为辛丑年，属于印生劫财的运气，地支印力量增加，大运甲子，伤官被合，财被克制，属于喜神运气，可以申请教高三，是有机会的，且要到印旺透出的年份机率大如2028年，2029年的时候。
          婚姻分析：寅木为婚姻宫，婚姻宫三现，代表你的婚姻宫是较不稳定的伏吟，也代表感情容易时好时坏。八字七杀星透出，而正官藏在戌土墓中，自己很多时候遇到的对象以七杀为主，也代表感情不稳定，容易烂桃花。
          同时八字中寅木中藏有丙火的根，月支伏吟到时支，也代表你在谈感情的时候，容易有不稳定的波动，留不住异性。
          婚姻宫为偏财，代表你对另一半的要求是不低的，也喜欢条件比较好的对象，条件差的你又看不上。而婚姻寅木为忌神，代表你另一半出身条件较普通，对你的帮助不是太大，但可以通过后天自己的努力而获得好的发展。
          婚姻宫伏吟，另一半也容易有不着家或者出差的信息，加上地支财克印，久而久之也会慢慢产生感情问题和不满，影响到婚姻稳定。此外，你命带华盖，又带两童子星，对女命婚姻是不好的，带有孤寂孤单的信息，对你的婚姻发展也是不利。
          今年辛丑太岁，甲子大运，天干甲木被克，同时辛金劫财与七杀丙火相合劫财被合走，而地支子丑合，伤官合印，同时太岁与婚姻宫也存在暗合的信息，且该年印星力量增加，又是湿土，属于喜神运气，容易遇到对象定下的运气，好好把握。
          对象身高中等，脸型方正，五官端正，眼睛微大也比较有神，眉毛浓密，肤色有点清白，鼻翼对称，鼻尖肉不是太多， 嘴唇微薄点，看起来较有精神，筋骨也相对强健，身高在177厘米左右。职业与教师，律师及经营销售相关。
          大运分析：20岁-29岁走的是甲子大运，天干财星力量正增加与八字财杀印相生，大运财星贪生不克印为吉，大运属于干支相生的组合，工作上虽然也有不满情绪，辛苦忙碌，但七杀和印星天干无伤，所以会有些小的发展收获，不过提升幅度不大。大运财杀印相生，七杀力量增加，也有些异性桃花运，大运有结婚运气，只是干支财星力量增加，财克印，自己会有些计较而不利感情平稳。
          30岁-39岁走的是癸亥食伤运气，太岁戊癸合，印星被合住，地支寅亥合，地支财星力量增加，而财克印，此大运对你的事业发展是不有利的，事业方面印被合，七杀得财生力量增加，代表你面临的压力会更大，特别注意木火旺的年份，宜小心些为好，提防小人及口舌是非方面的问题，注意维护好人际系。感情走食伤运，且婚姻宫逢合，也有感情进一步发展的运气，同时也会有不合及分歧争吵矛盾，彼此注意控制情绪脾气沟通交流为好。
          40岁-49岁走壬戌大运，天干食神本该制七杀，但贪生财，财生七杀，印星无伤，且大运地支逢印，印星力量增加，大运壬水被戌土戳脚，此大运你的财运会所好转，事业更平稳些，属于好的运气组合，只是开始也会遇到些困难阻碍。而婚姻方面，天干五行流通，地支印星力量增强，感情相比来说稍好些，只是地支财印克战组合还存在，对彼此也会有不满的情绪，需多沟通理解才行。
          50岁后走的是辛酉大运，庚申大运，己未大运，属于比劫和印星大运，比劫大运属于帮扶日主的运气组合，八字日主偏弱而财旺生七杀，这几个大运得比劫印帮扶，对你运势发展也是较有利，整体晚年运气是相对不错的，晚年有福可享，属于好的运气组合，会过得比较的安逸些。
          你八字日主偏弱，财星当令而旺，财有透出生七杀，七杀代表压力大，好在印星也透出，透出的印星无伤，虽然压力大，但付出能有相应的进步和收获。
          同时地支财克印，也会有些不稳定的信息，注意理财，前面几个大运走的不算太好，破耗及辛苦疲劳疲惫付出多些。
          40岁后走壬戌大运后及到晚年财运会更平稳些，且会越来越好，中年后晚年走比劫印星的运气组合，所以晚年生活整体不错，可以安享晚年，整体八字格局层次虽然不是很高，但也不差。
          `
  }]
}

export default {
  寅时
}