const 戌时 = {
  公历: [{
    甲: '1996-07-01 19:10:00'
  }],
  农历: [{
    甲: '1996年五月十六日戌时'
  }],
  十神: '正印   正官   日元   正官',
  天干: '丙(火) 甲(木) 己(土) 甲(木)',
  地支: '子(水) 午(火) 亥(水) 戌(土)',
  遁藏: '偏财   枭神   正财   劫财',
  大运: '癸巳，壬辰，辛卯，庚寅，己丑，戊子，丁亥，丙戌，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/368.html',
    命主甲: `我跟前任是16年在一起的，四年了。感觉分开的也是莫名其妙，总感觉我们的缘分尽了，该分开了。所以我很困惑，难道两个人的缘分真的是注定好的嘛，在一起多久也是定好的嘛。我现在对感情也很迷茫。
          我的身体总是有很多小毛病，肠胃也不好，身体状态不是很好，总是有气无力的，很瘦。奇怪的是好像跟前任在一起以后我的身体一直都不太好，现在分开有段时间了，感觉身体是越来越好了。
          难道真的是他克我的身体嘛。可是以前有算命的说我命里缺土，肠胃就不好。是我自己心理作用嘛。
          `,
    珠玑: `八字分析：己土生在午月为偏印格带禄神，午亥合、子午冲，偏印有制论吉。天干透出正印，两个官星，为官印相生，但官星出现争合的情况，于感情显然不利。
          己土禄在午，地支一合一克，禄神跟着受克，所以身体会不太好，特别是官星参与进来引动的时候。
          事业分析：日主身旺月令逢禄，天干有官印相生，为人是有主见的，但两甲木正官争合日主，对待感情的事情则容易缺乏主见，对感情敏感且多情，八字比劫旺，印旺，也有些固执，执拗，控制欲强，疑心重，容易忽视他人的感受。
          财星在年支和日支，子水财星与月令午火相冲，日支亥水财星被时支戌土劫财克制，地支财星力量弱而被冲克导致力量不强，财运受到影响，财运不稳定。
          日支藏亥水正官，同时甲木正官在月干和时干，正官克合日主不化，可以抑制比劫力量，对你的事业求财是有些帮助的，但是年干丙火正印星，月令午火偏印，官印相生官印相生流通虽然为吉，但印星得到生助，也会增强劫财的力量，属于有利有弊的组合。
          八字财星不是太旺，且被冲克，而正官透出天干，在地支有长生根，说明你会有相对稳定体面的工作，但财运收入不是很高。
          婚姻分析：婚姻宫亥水为喜用神，亥水藏甲木正官，同时亥水是甲木的长生之地，甲木正官透出，对你的婚姻是有帮助的。时支戌土克亥水婚姻宫，婚姻宫用神被劫财忌神所克，吉神不吉，受克则代表对象对你的帮助不大。
          天干透出正官，但正官争合日主，对待感情有时候容易摇摆不定，不知道怎么选择，也容易出现几个选择，不知道怎么取舍，同时也要注意婚后容易有烂桃花干扰你的婚姻生活。时柱正官坐劫财，容易是有妇之夫或离异过之人，同时也要注意第三者女人插足。
          而天干两正官争合日主，整体另一半对你的态度还算可以，但也要注意防止第三者女人干扰插足，与你抢对象的情况发生。
          而八字两个正官星争合日主，时支正官坐劫财，容易是有妇之夫或离异过之人，故而有时很容易出现两个左右的对象，对你产生好感，自己也还算上心，有时不懂如何选择或者注意婚后防止有其他异性桃花，干扰骚扰你的情况发生，也不利于感情的平稳防止误会发生。
          从你的结婚运来看，婚姻宫逢克到逢合时，婚姻宫才会稳定些，也有利于落实婚姻，如果又遇到增强八字夫星力量的运势，结婚运气也会更旺些，特别是在2022年财生官，地支寅亥合，婚姻宫逢合，官星得强根的时候。
          对象脸型微圆，肤色不黑不白，五官端正，额宽，眼睛不大，单眼皮，眉毛不是很浓，鼻子有准头肉多，嘴唇不厚，声音也不太洪亮。
          算命先生说你缺土所以脾胃不好，你的八字看脾胃不好是有这个信息的，但不是因为缺土，你的八字有土，日干和时支就是土，原因还是因为禄神在月支被克，月支己土代表脾胃。
          但也不能直接就判定这个算命先生没水平，因为对普通人来说，要把五行生克制化说清楚了，你也不一定听得懂，反而可能一头雾水。
          2017丁酉年，丁壬合，火被合克，地支辰酉合助金泄土，金水相生，土被泄耗，肠胃也不太好。
          2018戊戌年，大运天克地冲，水被克，地支辰戌冲，干支土过旺物极必反，肠胃也不是太好。
          2019年己亥与大运湿土逢水，水土混肠胃时好时坏。
          算命经常会提到相克的问题，许多人闻之色变，认为自己被对方克病，克破财，甚至克死，其实是不对的，首先是自己的命运中存在这样的问题，而不会自己运势中没有体现，但被凭空克出。
          大运分析：20岁-29岁走的是壬辰大运，辰为财库，原局无库，逢冲则土被冲旺，天干财生官相生，对事业发展是有帮助的，但地支劫财逢冲，比劫旺克水，财运不稳定，注意预防破财，大的钱财不要外借为好。财星透出生官星，对你的感情有帮助，但地支劫财冲，也代表容易有其他女人干扰。
          30岁-39岁走的是辛卯大运，八字丙辛合，地支卯戌合克，印星被拌住，地支七杀合克劫财，对你的事业也是有帮助的，整体财运还可以。而感情容易有异性桃花，要注意处理好，防止感情误会影响到婚姻。
          庚寅大运，伤官盖头正官，天干有伤官见官，天干运势不吉，地支吉，属于有利有弊的运气，要注意人际关系是非纠纷。而婚姻也容易因为口舌矛盾激化引发分离危机。
          己丑大运，属于消耗，支出多的运气，宜低调求稳发展比较好。大运比肩旺合正官，也容易有其他女人干扰插足，感情运不稳定。
          你的八字日主偏旺，印星透出，劫财在地支，八字财星被冲克，财星力量弱，财富不是很大，但官星透出，官印相生，正官无伤，说明能够有稳定体面的事业。
          肾是一个人的先天元气，可以理解为人来到这世上所带的先天能量，而脾胃是一个人的后天元气，是主运化，可以理解为帮你吸收营养供应能量的，你的八字土旺为病克水，可以说先天元气和后天元气都不太好，你想下营养吸收不好，怎么供应营养，自然也容易精神状态不佳，毛病多。
          俗话说，三分治，七分养，对于健康毛病多的这些问题，通过药物也是调理，不能完全解决问题，更多是需要你后天的饮食作息，坚持养生，才能有帮助，你应该意识到自己健康存在的问题，制定适合自己的饮食作息方案。
          熬夜肯定是不可以的，熬夜伤肝伤肾，也不能吃冷饮，不要喝绿茶，因为容易伤脾。平常留意饮食对自己身体的影响，有什么反应，对于体质正常的人来说不明显，但对于体质弱的人，可能吃了不适合自己的东西，就会有明显反应，比如上火，失眠等，而每个人的体质不一样，别人适合吃的，不一定适合你，所以平常自己要留意，形成自己的食谱，和作息规律。
          思多伤脾，中医认为思虑是建立在脾气旺盛的基础上，正常的思虑思考对脾胃没有影响，但如果一个人思虑过度，或者思虑时间过长，对一个事情揪着不放，思不休止，超过了自身可以调节承受的限度（限度大小和本身体质有关），就会导致气滞，导致脾胃运化不行。所以为什么有的人思念一个人太久，就会茶饭不是，就是这个原因。
          你的八字容易焦虑，急躁，纠结，甚至有点强迫症，一个人思虑过度是不容易胖的，这些也不利于你脾胃健康的，形成了一个恶性循环。
          你想要治愈这些小毛病，除了找有经验的老中医调理，注意饮食规律之外，也要懂得宣泄调节自己的心情，平常可以多看书，散散心，学习一些传统文化知识，改变提升自己的思维格局层次，进而提升改变自己事物的看法，坚持下去，对你的健康都是有好处的。
          `
  }]
}

export default {
  戌时
}