const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   比肩   日元   七杀',
  天干: '甲(木) 丙(火) 丙(火) 壬(水)',
  地支: '戌(土) 子(水) 申(金) 辰(土)',
  遁藏: '食神   正官   偏财   食神',
  大运: '丁丑，戊寅，己卯，庚辰，辛巳，壬午，癸未，甲申，乙酉，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/529.html',
    命主甲: `出生在一个偏远的西南农村重庆市一个山区的男的，父母常年在家务农，没有什么收入，父亲在我记事起，大概七八岁，他一直跟我们讲他没有劲，母亲也是在18年以前没有大病，
          但是18年，她摔了一跤，摔得很严重，现在三年了，还是没能好，万幸的是没有成为需要别人服侍的人，爸妈他们一共生了五个孩子，有两个因为计划生育，而且家里条件原因，生下来就送人了，具体送给谁我也不知道，现在我们家就我姐，我，我弟。
          我小的时候身体自我感觉还是挺好的，也没有得过大病，读小学的时候三年级以前成绩很差，三年级以后又忽然变得成绩好了起来，08年进入初中，初一整个一年成绩都还不错，初二由于贪玩，英语跟不上。
          11年初中毕业，本来上个普高是没有问题的，而我们班主任却为了推荐职中他们有回扣，力荐我去读职中机械专业，就这样我去了职业学校。在我们县里面上了一年半，13年，然后广东对口支援我们那边，去广东读，不要学费，然后去了广东江门，又去读了一年。
          然后学校把我们介绍去美的工厂做普工，做了半年，然后又被朋友骗去了传销，15年断断续续进了一年厂，16年又去美的做了半年，然后八月份我身份证到期了，回老家照身份证，然后一直在重庆学厨师，期间也是做啥啥不行，学啥啥不行，特别是17年特别不顺，18年也是。
          19年开始身体胸口疼，然后到处查，花了很多钱，也没有看好，20年又是各种检查，中药，都治不好，检查出来就有心脏心肌桥，其他没有查出来问题，西医又说问题不大，可是一直背上胸口痛，中医也看不好，这些年恋爱也没有正式的谈过，口才也不好。
          从17年开始我陆续接触了周易，刚开始也看不懂，因为自己不顺利，也想一探究竟，可是毕竟自己头笨手拙，看不出来门道，20年有幸认识了老师您，经常看您给别人分析，受益匪浅，也学了一些基础。特别是今年感觉我好像往后去会心脏越来越严重，做厨房都觉得力不从心，往后的路不知道如何去走。
          `,
    珠玑: `八字分析：丙火生于子月，为正官格，申子辰合局，官星很旺。天干透出壬水，藏官露杀，官星无破，只是丙火本身太虚，唯一的戌根都有被辰冲的危险，偏印甲木为用，但水多木漂。
          事业分析：八字身弱，财官较旺，天干印比帮身，天干主外，地支主内，在外人看起比较良好，好像没什么，但实际上内心压力大，忧愁忧虑多，顾虑多，快乐少，怕事，人际关系不太好，地支食神生偏财，野心较大，求财的欲望不小，好在时柱壬辰为食神制杀的组合，做事还是有一定有魄力。
          官杀混杂，日坐偏财，丙火日主在地支无根，心性不稳，内心是比较急躁冲动，也容易顶不住压力，导致工作多变，难在一个行业领域坚持下去，工作变动频繁，年支戌土食神去制子水正官，但子水得申金生扶克不尽，在工作上非常辛苦，需要付出比较多的努力，但收获不成正比。
          地支食神两头，食神生偏财，适合依靠一门过硬的技术来求财，食神临国印贵人、月德贵人，做技术可以逢凶化吉，对你有帮助。你能去学习厨师是很好的，食神挂两头，有机会成为美食家，且厨师属火，刚好是你的喜用神，比较适合你。
          八字身弱，丙火日主在地支无根，不能担财，地支食神生财，财星较旺，申金偏财临驿马，则求财辛苦，不易得到这个财，适合跟着别人做，合伙去做，或在大一点的公司平台做，但由于天无二日，也容易遇人不淑被坑骗，在交友方面要注意，杜绝损友。
          天干丙火双透，有文化文明之意象，学习传统文化是可以的，年干甲木为枭神，对神秘文化感兴趣，比较喜欢钻研。年支戌土和时支辰土临华盖星，且辰土空亡，易学缘分和宗教缘分很深，年支戌土为火库，有寺庙之意象，八字官杀混杂，八字全为阳干支，适合做一些偏门的，冷门的行业，学习易学是可以的。
          健康分析：丙火日主较弱，被时干壬水所制，地支申子辰合水局，官杀攻身，体质较弱，抵抗力不强。丙火有心脏、血液血管方面的意象，容易有这方面的疾病。地支辰戌相冲，辰中的水去制了戌中的火，心脏不好。辰戌相冲，也要注意脾胃方面疾病。
          逢猪年、鼠年、龙年、狗年，要特别注意心脏问题。你提到的2030庚戌年，2031辛亥年，2032壬子年，刚好是狗年、猪年和鼠年，则要格外注意心脏疾病复发严重。
          婚姻分析：日坐申金偏财星，食神去生偏财，求妻心切，对女性的外表，长相，气质，条件等比较在意。年支戌土中暗藏辛金正财，偏财透正财藏，内心会有些心不定，有些花心，朝三暮四，且日支申金临驿马，对待感情比较心猿意马，容易见异思迁的一个人。
          日支婚姻宫为申金偏财星，临驿马，婚姻不稳定，容易发生变动，未来妻子比较勤快，妻子多为外地人。今年辛丑年，天干辛金财星高透，丙辛相合，正财合身，暗示有机会遇到正缘，但两个丙火争合辛金，暗示竞争较大，不易得到。2022壬寅年，地支寅申相冲，婚姻宫逢冲，有遇到定下的运气。
          大运分析：21岁-30岁走的是己卯大运，此大运天干己土被地支卯木截脚，为印制伤官的大运，天干甲己相合，甲木枭神被合拌不吉，八字身弱，甲木为寿元星，被合拌则身体健康不好，容易出问题，且丙火少了元神，故而心脏很容易诱发疾病，这是要格外注意的。地支卯辰相害，卯木印星和辰土食神受损，也是身体不好的信息。
          31岁-40岁走的是庚辰大运，此大运为食神生财的大运，天干庚金去制甲木寿元星不吉，地支辰土引动原局辰戌相冲，辰土中癸水去制戌土中丁火，心脏问题很容易复发严重，天干庚金偏财星高透，会因为身体原因花销和开支很大，导致财来财去，不聚财，求财也会比较辛苦。
          41岁-50岁走的是辛巳大运，此大运天干辛金被地支巳火截脚，大运和命局日柱天合地合，辛巳之间暗合，构成比肩夺财，此大运不要去做一些高风险投机的事情，比如投资，炒股赌博，借钱等，要注意因为损友破财，但只要跟对人，还是能赚到钱的，财运比之前要好。地支巳申相合，巳火比肩和申金偏财相合，要注意妻子婚外桃花。
          后面的壬午大运，地支午火被天干壬水盖头，午火被制要注意心脏问题复发。癸未大运，天干癸水被地支未土截脚，地支子未相害，要注意脾胃，肾脏方面疾病。
          身体是革命的本钱，身体不好影响到个人状态，不能很好的投入到社会工作中，没了身体这个立身之本，一切都是妄谈。针对你的五行，给你几个调理建议供参考。
          一、在阳宅之南悬挂一个红心结，或挂一幅《八骏图》；
          二、随身佩戴紫檀木、红木、绿檀木材质饰品，也可佩戴石榴石、朱砂石、红色水晶；
          三、家里养三只乌龟；
          四、家里多养花木盆景；
          五、阳宅东北方放一块红色水晶球。
          `
  }]
}

export default {
  辰时
}