const 午时 = {
  公历: [{
    甲: '1987-11-25 11:30:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正印   伤官   日元   劫财',
  天干: '丁(火) 辛(金) 戊(土) 戊(土)',
  地支: '卯(木) 亥(水) 寅(木) 午(火)',
  遁藏: '正官   偏财   七杀   正印',
  大运: '壬子，癸丑，甲寅，乙卯，丙辰，丁巳，戊午，己未，6岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/472.html',
    命主甲: `我是个超大龄剩女，婚嫁这步路寻觅了10多年依旧没有嫁出去。从小到大，我没有两情相悦过，我喜欢的人都不喜欢我。17年遇到了一生所爱，也只是流水有意落花无情。之前有个事业单位的合同工作到期也解聘了，自此连工作也没有了。
          生活没有盼头和念想，过的一地鸡毛，因为是独生子女父母有点退休金，勉强依靠着父母，父母因为我的婚事也已接近崩溃！
          从小到大都很倒霉，遇到的各种关系各种人都不友好，在任何事情上想和别人达到一样的效果我付出的注定要比别人多得多。
          `,
    珠玑: `八字分析：戊土自坐寅木七杀，犹如抱虎眠，七杀代表压力和不顺，占据了日支（同时也是夫宫）除了表示压力之外，也代表正官星很难进入生活。亥月壬、甲均不透，寅亥合，卯未半合，正财进一步助长官杀的旺势。幸好，时支午火为印星，也为阳刃，印星能够化解官杀的部分力量。天干伤官配印，但伤官弱而受克。
          事业分析：日支为寅木七杀，辛金伤官虚透，地支财生官杀，时柱有阳刃和比肩帮扶，为人脾气是不小的，有些直白直接，没有太多的心思，心眼，对人对事时，不太懂得维持人际关系，有时得罪他人而不自知。
          八字伤官生财，财生七杀，代表自己也是有上进心的，想通过自身努力获得更好的发展，不过自己的一些行为和目标计划最终的发展结果和自己原有的想法和期盼容易背道而驰，同时自己也会感到有些烦恼憋闷无奈。
          而财生官杀，虽然官杀生印星，代表自己也有一定的能力去化解自己在事业发展中遇到的一些困难阻碍。
          八字中月柱伤官泄日干，月令财星生地支官杀星，伤官生财，代表自己对事业财富的渴望和追求。但财生官杀为忌克身，自己遇到的困难阻碍不少，且官杀在地支旺而得生，所以有时表面看着较好，而实际内心烦恼艰苦，自己给自己的压力也较大。
          年干为正印，年柱官印相生，父母及一些长辈，领导会给你带来一些帮助，但是没有直接生助到日干，所以这种帮助也是间接的。
          地支也有杀印相生的组合，午火在子女宫，时柱印比帮扶日主，同时也代表自己能获得一些人的帮助，且结婚生孩子后运势也会有所帮助，对事业发展也有些帮助。
          总的来说日主偏弱，财旺生官杀，官杀去生助印星再生日主比肩，代表这个事业发展的过程及求财的过程会比较的比较长些，同时也比较的艰，遇到的困难阻碍比较多，劳动成果来之不易，会比较的疲劳疲惫付出多才有进步收获，同时开支花销也比较多，故而也要注意理财，八字原局格局层次不高。
          结合大运走势看，一路走的是正偏财，官杀大运，再到正偏印比劫大运，46岁之前走的财官杀运气较差些，而46岁之后走的印比大运财相对好些，八字属于越老越好的八字组合，格局层次在小康偏上左右的级别水平。
          从八字组合来看，八字喜印比为用神，八字印透出，在时支有强根，可以尝试努力往国企事业单位方面去发展的，其次也可以往一些教育培训，行政及互联网相关的职业行业发展也可以。
          婚姻分析：婚姻宫为寅木七杀，正官在年支又为桃花星，八字官杀混杂，七杀占了婚姻宫，正官留在外面，代表进你婚姻宫的或者你遇到的异性桃花很多都不太正，也容易遇到些烂桃花，同时也难找到彼此相互都喜欢彼此的对象姻缘。
          卯木正官在年支生年干丁火正印，你的感情找长辈或年长的人介绍会比较好，如果是自己认识的话，很容易遇到七杀性质的烂桃花。
          月柱辛亥伤官生财，女命伤官虚透，自己对另一半也有些挑剔的情绪态度及一定的要求。但地支财生官杀，生官，也生七杀，代表自己也是个很容易对感情较真的人，肯为自己的另一半付出的人。
          婚姻宫寅木七杀忌神，另一半出身交通条件较普通，对你帮助不是太大。但婚姻宫与时支杀印相生，子女宫为喜神，故而结婚生孩子后，另一半对家庭会相对的努力付出些，通过后天努力也可以慢慢改善其经济条件。
          八字比肩在时干，同时感情方面也存在竞争和压力，加上八字犯桃花，又是阴差阳错日生，犯孤鸾煞，提防第三者女人干扰。
          你今年劫财生伤官的流年，且走甲寅七杀大运，是不利婚姻的。到2022年开始走乙卯正官干支一气，又是桃花大运时，地支寅卯半合官杀局时，婚姻可以定下，在2022年和2023年里都有结婚的运气。
          对象脸型方长，身高中等偏上，五官端正，眼睛较大，双眼皮也比较的有神，眉毛浓密剑眉，嘴唇不厚，胡须有点粗硬，声音清脆，语调敞亮，身高在177左右。职业与技术技能，金融财经及店铺经营相关。
          大运分析：26岁-35岁走的是甲寅大运，属于七杀干支一气大运，天干七杀克日主会给你带来比较大的压力和困难阻碍，虽然天干也有丁火泄七杀，但地支财旺生官杀，官杀混杂，加大了官杀的力量，对事业发展不利，遇到困难阻碍和花销都比较多，难留住钱财，属于被动压力大花销多的运气组合。走七杀运，烂桃花多，容易因为感情而受伤，整体感情运走的不是太好。
          36岁-45岁走的是乙卯大运，此大运为正官大运，大运与八字天干伤官见官，也有印化掉一部分，地支卯的力量增加，地支官杀力量增加，压力也不小，很容易出现人际关系不和及一些纠纷口舌矛盾，保守求稳发展为好。正官大运，且又是桃花大运，有结婚的运气，但八字官杀混杂，也很容易遇到烂桃花，有时候患得患失，加上伤官见官的组合，也会有不合的争吵矛盾，同时防其他女人干扰插足。
          46岁-55岁走的是丙辰大运，天干丙辛合，丁火直接生日主，地支辰土为强根对运势发展也有帮助，但地支寅卯辰三会官杀局，也同样存在压力和困难阻碍，好的是印星可以直接生到日主，且印星无伤，此大运事业会有所好转，收入增加，辛苦付出也有所进步收获。
          后面的丁巳，戊午等大运，属于正偏印及印生比肩的运气组合，为生助及帮扶日主的运气，地支官杀被泄掉，晚年事业财运发展较有利些，能获得他人付出帮助，个人状态也较好，努力也会有好的进步收获。地支有些相刑，但问题不大，婚姻会有些分歧矛盾而已，多沟通即可，整体晚年运气还算可以。
          你八字月柱伤官生财，而地支财旺，且生官杀星官杀混杂，且逢印，代表自己也是个有想法及上进心，只是印没有直接生到日主，故而有时缺乏些主动性，容易想得多而做得少。
          而大运方面，前面大运走的也不理想，属于财，官杀的忌神运气，事业会比较辛苦，发展相对被动些。好在后面及晚年运走印比喜神运气，还有发展提升空间，收入增加，整体可以有小康偏上左右层次。
          `
  }]
}

export default {
  午时
}