const 未时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正印   伤官   日元   劫财',
  天干: '丁(火) 辛(金) 戊(土) 己(土)',
  地支: '卯(木) 亥(水) 辰(土) 未(土)',
  遁藏: '正官   偏财   比肩   劫财',
  大运: '庚戌 己酉 戊申 丁未 丙午 乙巳',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/76.html',
    命主甲: `靠祖上一盏丁火逢凶化吉的富贵命`,
    珠玑: `此造出生日日干为戊土，所以属戊土命，生于十月亥水当令之时，已入冬天。前文说过，冬天和夏天出生的命，牵涉到调候取用神的问题。十月寒土，以丙火为主要用神，无火则为下格，寒苦孤贫。
          现据此原则，很快看到年干有丁火透出，时支未土为燥土（暖土），内藏己丁乙，火之余气，木之墓库，丁火可赖此为根。虽不及丙火太阳照暖，亦为可用。
          火有了，再看日干强弱的分析：十月水旺、土囚，日主戊土临绝地，一生下来就身弱。再见辛金伤官在旁泄土气（土生金），辛金又再生旺亥水，使得月令亥水旺上加旺，日干戊土弱中再弱。弱则喜生扶，八字正格论命以中和为贵。喜见自坐辰土帮身，更见时柱己未二土相助，似乎能够抵挡当住月柱金生水旺的泄气局面。
          谁知天有不测风云，地有难测异动，地支月、年、时见“亥卯未三合木局”，如此一合，原本寄厚望的未土，一下子就让出了三分之一的国力给卯木，使得地支中木之力量增大三倍以上，而木能克本来就衰弱的日主戊土，这显然是对日主戊土不利的事。
          不是还有辰土吗？须知辰为湿土，内藏戊乙癸，为木之余气，水之墓库。犹以冬令寒湿的辰土，内中无火气，单靠它来帮助，显然势单力薄，反而喑中向亥水、卯木暗送秋波，说它为内奸也不为过。
          怎么办？正当傍徨不定之时，忽然记得，不是年上（祖上）留下一盏丁火吗（丁火是炉火、灯烛之火），现正当好派上用场了。你看它怎么妙用，先用丁火正印来制伤官辛金（火克金），使辛金不敢再泄日主戊土之土气；其二，丁火亦可生助戊土日主（火生土），指祖荫风水、长辈、贵人、时势有助力；
          其三，几乎是最要紧的一点，它可以起到起死回生，逢凶化吉，点石为金的妙用。即此人一生中，纵有诸多凶险，皆可将凶险化为助力，来一次，化一次，反而又成就了自己的事业。
          为何？前面分析过，此八字地支亥卯未三合木局，木能克弱主戊土，这木局就是此命的凶险和煞星，但由于现有丁火透出，此木就去生丁火，而不再去克戊土，丁火再生戊土，岂不是起到逢凶化吉，反败呈祥的妙用吗？
          如此一来，此命由一个几乎落败的凶命，靠此祖上（年上）一盏丁火（丁火是炉火、灯烛之火）的照耀，便能逢凶化吉，反败呈祥，成为一个能够发挥才能而赚到钱财的富贵命了。
          论此命时，开始说：冬土不见丙火太阳照暖，现见丁火透出值根于未，亦为可用，似乎有些遗憾之意。谁知错有错招，如果在此造中将丁火换成丙火，反而得不到后来的富贵。
          因为天干丙火见辛金，丙火反而怯场，因“丙辛合化水”，即使不成水，起码也两失其用，起不能照暖的作用。况且，化解地支的三合木局，丁火是炉火、烛火，木生火仍属自然。如用木去生天上的太阳丙火，恐怕过于牵强，故在此造中用丁火胜过用丙火，实在由于局中具体配合不同也。
          当然有人说，如用丙火，就应是丙寅，而不是丁卯，地支就不成木局了。我这里只是方便于解析用丙或用丁的作用不同而作的比喻而已，如真的是丙寅年，寅亥也合木，也须见火来化解，方可取富贵。
          大运当然仍是喜火、土，忌金、水、木。早运三十年西方金地未见精华，积累经验。37岁后入南方火运三十年，创业成功，名成利就。
          `
  }]
}

export default {
  未时
}