const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   伤官   日元   比肩',
  天干: '丙(火) 癸(水) 庚(金) 庚(金)',
  地支: '子(水) 巳(火) 午(火) 辰(土)',
  遁藏: '伤官   七杀   正官   枭神',
  大运: '壬辰9岁，辛卯19，庚寅29，己丑39，戊子49，丁亥59，丙戌69，乙酉79',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/517.html',
    命主甲: ``,
    珠玑: `婚姻解析：庚午日生在巳月长生之地，但年支丙火，日支午火，夏火炎炎，此八字的火比较旺，喜用神为癸水，但癸水在四月如同甘霖一滴，如同杯水车薪，伤官不是自己的正官星——夫星，仅仅是自己心仪的对象，但由于癸弱，就像露水一样，太阳一出来，露水就干了，
          所以此人对自己满意的对象，爱情就只有昙花一现的份，正官星又恰是此八字的忌神，真正遇到可以依靠的人，自己又不满意，而且时坐比肩，比较有自私的个性，火旺脾气大，容易情绪化，所以此八字注定情感比坎坷。
          `
  }]
}

export default {
  辰时
}