const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '2004年七月初七卯时'
  }],
  十神: '伤官   劫财   日元   食神',
  天干: '甲(木) 壬(水) 癸(水) 乙(木)',
  地支: '申(金) 申(金) 酉(金) 卯(木)',
  遁藏: '正印   正印   枭神   食神',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/308.html',
    命主甲: ``,
    珠玑: `八字分析：男甲申年生人泉中水命，申月癸水母旺子相，月透壬水入劫财格局。此造金生水兴自然应该以偏旺论，八字喜财官，五行喜火土，巧合的是财官不见，六根清净，真是个好孩子啊，欲望没那么强烈，生活幸福度就高了些。
          甲申年生人伤官当头，虚荣爱面子，天不怕地不怕的表现，其实骨子里谨慎的很，也就在家里敢说说大话，在外面大气都不敢喘，这样还是有好处的，最起码不给家里惹祸，能过的安稳，懂事的早啊，大胆又怯懦的这种双重性格，不好说祖上有阴债，反正很难得到祖上阴德庇护。
          壬申月生人，较重义气又乐善好施，真是挺好的孩子，但往往是苦了自己甜了别人，这一生或注定是种树插秧，辛苦一生的福报留给自己后人的命。乙卯时生人，时柱为用神吉利，代表晚年大好，其实也没多大好，因为食神被冲了，应该预防此子发生车祸等危险情况，容易有腿脚受伤的事情发生。
          此命入劫财格局，环境对他的学习影响很大，若是在优等学校也能是个好学生，但此命的情况来看，没有很好的学习供给，所以难以取的高学历，尽量读书吧。既然食神为用神，要培养其一技之长，学个技术是非常棒的选择，哪怕是去读大专也应该选择技术性强的专业，对他以后有好处。
          厨师啊汽车电工一类还是比较适合这孩子学习的，生辰八字已经注定了自己的平凡，没有特别强的能力，这个真不能怪他，都是命中注定，谁让祖上欠下阴债了呢。投胎在这种家庭，也只好认倒霉，自强奋斗吧，也能有不错的生活。
          大运分析：17岁走甲戌大运，叛逆的很啊，甚至打闹是非骂人，什么都干的出来，不利学习难以管教的运势啊，别说这年龄的大小伙子，就是七岁的孩子也管不了呀。只能说些道理引导，任其自然发展吧，把权力交给他，这个时候若是再严加管教，只会适得其反，不过此运后面几年挺不错的，能有份还不错的工作给他留着呢。
          27岁走乙亥大运，一般的运势吧，没有大的出息，事业竞争大，工作平凡，也就那么过着。37岁走丙子大运，此十年应该有强烈表现的欲望，自己的虚荣心能得到一定满足，大业绩没有，小成绩还是能展现的，还是适合稳定工作，投资创业则也容易破耗。
          47岁走丁丑大运，容易做别人嫁衣的运势，好好工作可谋个小头目做做，在一个行业磨炼那么多年了，技术经验都能支撑你做个小头目，但也不适合创业投机，容易有失败，赌一把的心理很重，若是能在一个单位稳定的做下去，受到重视体现人生价值是大有希望的。
          57岁走戊申大运，好吧刚夸了几句就蹦跶了，这个大运风波又起，进入老年的初期是更年期发作吗？强烈的情绪发泄，对于事业工作来说也不安定，总会觉得对自己不公平，埋怨牢骚一肚子怨气都来了，那工作事业波折，甚至再发个坏也不是不可能，真那样做了更糟糕，此十年情绪不稳定，工作不稳定的状态，更要注意身体健康，
          67岁后及老来性格温和，生活平淡或幸福着，注定把福气留给后来人，而自己享受平凡的快乐。
          读书也好，学技术也罢，只要专注沉下心思考学习，一定能出成绩。人与人之间的智力差距非常小，成功与否不过是努力与否决定的。太多的人做事不专注，上课分心想着玩游戏的情景，上班时心里总想下班看电影约会，能学好做好也就奇怪了。
          能控制自己情绪和心思的人才配得上成功，做事学习时就应该心无旁骛，专注思考怎么能做好做精。养成这样良好的学习工作习惯，就不愁没有进步和发展。深度认真的工作学习，得到的将是尊重和人生富裕的回报，每一份努力付出都是在给自己种福音。
          `
  }]
}

export default {
  卯时
}