const 巳时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   正印   日元   枭神',
  天干: '丙(火) 甲(木) 丁(火) 乙(木)',
  地支: '辰(土) 午(火) 巳(火) 巳(火)',
  遁藏: '伤官   比肩   劫财   劫财',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/420.html',
    命主甲: `这些年过得很辛苦，前夫花心有婚外情，为了孩子只有一再容忍，在去年孩子上大学后婚姻也就走到尽头，也从此解脱出来，去年离婚后，今年遇到一个心仪对象，打算在一起。
          `,
    珠玑: `丁火坐已土为劫财，生在午月禄旺之月，天干透丙劫财，时干又有偏印，劫财和偏印组合说明日主好强，有时性格有点偏激。已火夫宫伏吟到时支，一看就是要换老公的命。
          在命局里水五行为官星也为老公，官星水五行在命局没有显现出来，命局中只有伤官土，土的力量强大，有克夫之象，不是离婚就是两地分居或者是生离死别灾，至少有这其中一劫，是婚姻不稳定的因素。
          再加日主力量较旺排斥官星的也旺，不让官星好好与日主好合关系，再加上命局辰土得到丙丁午巳巳火的生助会克制水五行力量，不让官星在家里好好呆着，容易相克，最在未来的人生中让日主婚姻易有离婚、分居、一方伤病、婚外情等不利婚姻的事情发生。
          婚姻中也会吵闹不止，让婚姻无法好合。同时，也要注意老公的身体健康问题，引导老公锻炼身体，保养身体，注意出行安全，防止伤病和意外危害身体健康。
          今年暂时缓和了日主与老公的婚姻关系。婚姻关系会暂时缓和，婚姻矛盾和吵闹现象也会减少，让婚姻日子过得比较总体平顺和睦一些。今年再次牵手中意之人。
          2022发展了日主婚姻关系。预示着此年日主在婚姻中相处较好，让自己婚姻有了慢慢稳定的局面，利于婚姻感情向好的方向发展。
          2023年预示着日主此两年会极力和谐婚姻关系，让婚姻感情慢慢增加。
          2024年，2025年，甲乙木和巳火忌神又来搅乱了日主婚姻感情发展的基础。感情发展有了障碍和阻隔，会让婚姻感情不和顺。
          50岁进入己丑运，己丑土食伤克制水五行官星减弱了日主婚姻好合稳定的运势，此运中日主的婚姻平平常常，凑凑合合地过着婚姻日子。
          在走戊子运，此运中日主会进入60岁以后的晚年生活，夫妻之间感情也稳定不少，系比较恩爱和谐，互相照顾安度晚年。
          `
  }]
}

export default {
  巳时
}