const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1992年二月十九日酉时'
  }],
  十神: '正官   七杀   日元   食神',
  天干: '壬(水) 癸(水) 丁(火) 己(土)',
  地支: '申(金) 卯(木) 酉(金) 酉(金)',
  遁藏: '正财   枭神   偏财   偏财',
  大运: '甲辰，乙巳，丙午，丁未，戊申，己酉，庚戌，辛亥，壬子，5岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3132.html',
    命主甲: `回看走过的时光，感觉从小就运气一般，读书考试、找工作、换工作总是坎坎坷坷不尽如人意。我有两个堂兄弟，堂哥在长沙做电子商务，是一家电商公司的股东，堂弟在浙江杭州也是做电商的，做抖音，做视频，直播带货方面
          看着他们都是从事电脑相关的工作，收入也比较不错，有些朋友也问我，你怎么不和你兄弟他们一起呀，叫他们带带你也行啊。我也想啊，可我这些年，完全没有从事过电脑相关的工作，现在也是在一家汽配厂上班，虽然也是朝九晚六的工作，但没啥技术含量，拿着三四千的工资。
          写到这里，我也感叹，我怎么没有那么好的贵人运，感觉好运从来没有眷顾过我，堂哥组建家庭也几年了，堂弟也有女朋友了，而且还是留学生。我呢，工作不稳定，经常变换工作，想通过变换工作来提升收入，这条路好像也不行。买房没钱，买车也没钱，更不要提结婚的事了，要是有个女孩愿意跟我，就是我命好了。
          我在2019年前还有点存款，2019年在网上赌博，玩博彩输了好几万，经济方面到现在也没好起来，连一两万的存款都没有，这两年由于疫情的影响也有点吧！大环境不好。感觉自己好窝囊！
          事业工作方面，我也希望和他们那样，干电脑相关的工作，也想过上年收入7万到10万以上的生活，这个要求说起来虽然不高，但目前，想实现这个，就等于我实现了财富自由。也想让他们带带我，可我是个小白，什么都不懂，虽然是兄弟，但也不好开口叫他们带。
          `,
    珠玑: `八字分析：丁火生于卯月，为偏印格。申年酉日酉时，地支除月令卯木外全是金水，丁壬合，癸水克，丁火严重受克，为财官重身轻之命。命主丁火受克严重，偏印卯木也受克严重，丁火奄奄一息，如果没有强力用神大运流年助力，这实在算不上一个好的八字。
          事业分析：八字卯木偏印得令，但被地支两个酉金冲克，申金财星也来制印，为财星制印的组合，印星为用被制，是一个比较马虎，粗心大意，且做事不够专心，容易三心二意，加上命局壬水正官，和癸水七杀，官杀混杂，地支申金正财和酉金偏财同见，杂而不纯，也表示想法多且杂乱，导致做事不能坚持，“三天打鱼两天晒网”。
          丁火日出生，丁火在地支无根，卯木为丁火之灯芯，被冲克无力，也是一个比较没有主见，遇到事情容易拿不定主意，容易动摇的人。
          而丁火坐酉金偏财之上，酉金伏吟时支，酉金偏财为忌神，比较爱慕虚荣，要面子，比较注重别人对自己的看法，也容易贪图享乐，吃不得苦。
          八字官杀混杂，正偏财同见，地支卯酉相冲，卯木印星被冲克太多，也代表事业上变动较多，较难稳定，经常换工作。卯木印星为用神，被冲克太过，遇到机会容易错过，机遇不容易抓住，贵人运较为缺乏。
          卯木印星为用被冲克，很难在学习上有所建树，难靠文凭学历求财，参加工作后，更是难把心思用在学习上。安安稳稳上班，坚持下去，对你来说是最好的选择。
          时柱己酉为食神生财的组合，己土食神挨着丁火日主，食神相随，身弱无依，只有依靠一技之长，有一技傍身求财比较好，能踏踏实实学习一门技术，多提升技术，把技术钻研透钻研深入为好。
          互联网行业属火，是你命局的用神，可以考虑去学习互联网技术，学IT技术，电商设计可以，对于直播、管理这些则不太适合你，不要投入太多精力。
          八字偏弱，丁火日主在地支无根，地支申酉金较旺成势，则身弱不能担财，天干壬癸水官杀来克身，事业上会有一定压力，难胜财官，求财非常辛苦，且收获甚微，需跟着别人做为好，有团队一起求财，才有机会分一杯羹。
          地支卯酉相冲，财星破印，且酉酉自刑，酉金偏财受损，容易遭遇大的破财，意外破财，财来财去，留不住钱财，一些投机高风险的事情适不适合的，赌博自然更不能再去做。
          你现在走的是丙午大运，干支一气为比劫，比劫帮身为用，事业上适合跟着别人做，也会有贵人帮助，你的堂弟可以助你，也是一个很好的机缘，放下身段、拉下面子找他帮助，未尝不是个好的选择。
          婚姻分析：丁酉日出生，日坐酉金偏财之上，且酉金在地支伏吟，酉金临桃花，在择偶方面容易被外在的条件吸引，比如长相气质才华等，八字申金正财星和酉金偏财同见，在择偶上属于“外貌协会”，也比较不太专一，有些花心的一个人。
          八字先见申金正财，后见两个酉金偏财，酉金伏吟且伏吟到婚姻宫，申金正财难入，遇到的人多为偏缘，也容易经历失败的感情，但能有失败的感情。
          日支婚姻宫为酉金偏财星，且临桃花，则未来妻子鹅蛋脸，皮肤白皙，长相较好，鼻梁较高，眼睛较圆，能力较为一般，对你帮助不大。地支酉酉自刑，婚姻宫被刑伤，未来婚姻感情不佳，婚姻压力较大，双方感情容易冷淡僵化。
          你现在走的是丙午大运，地支午火为桃花，而2022壬寅年，地支寅申相冲，申金正财星逢冲而动，有机会遇到缘分，2024甲辰年，地支酉辰相合，婚姻宫逢合，合来解冲，有结婚的运气。
          大运分析：25岁-34岁走的是丙午大运，此大运干支一气为比劫，比劫帮身为吉，事业上适合跟着别人做，参与团队做，也易于遇到贵人提携帮助，能跟着堂弟去做为好，也会有不错的财运和机遇。地支午火为桃花，可以遇到缘分，有结婚的运气，要好好把握。
          35岁-44岁走的是丁未大运，此大运天干两个丁火争合壬水正官，虽有贵人帮助，但事业上也易遭遇竞争，地支未土食神来生财，要把技术学好，才有机会凭借手艺吃饭赚钱。此大运总体财运一般，求财忙碌辛苦付出多，要注意身体。
          45岁-54岁走的是戊申大运，此大运为伤官生财的大运。天干戊癸相合，癸水七杀星被合克，去杀留官为吉，事业上可趋于稳定。地支申金财星来制印，求财忙碌辛苦，切忌不要去做赌博之类，遭遇意外破财，钱财难聚，花销较大。
          55岁-64岁走的是己酉大运，此大运为食神生财的大运，依旧身弱难以担财求财辛苦。地支酉金引动命局卯酉相冲，卯木被冲克严重，要注意颈部、肝胆、神经系统方面的疾病。
          有一句话叫，时势造英雄。一个人要懂得客观分清楚形式，顺势而为，顺应大势去做事情，才能事倍功半，获得成功。一个人即使能力再强，逆势而为，不但难有成就，甚至可能头破血流。英雄一直都有，只是时势是否适合。
          对于你来说不管做什么，都一定要专心踏实，切忌三心二意，不能坚持，否则做什么都会一事无成。
          `
  }]
}

export default {
  酉时
}