const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1987年六月月二十日辰时'
  }],
  十神: '食神   正财   日元   正官',
  天干: '丁(火) 戊(土) 乙(木) 庚(金)',
  地支: '卯(木) 申(金) 未(土) 辰(土)',
  遁藏: '比肩   正官   偏财   正财',
  大运: '丁未，丙午，乙巳，甲辰，癸卯，壬寅，辛丑，庚子，己亥，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/453.html',
    命主甲: `少年不更事，已至而立年。三十岁真的是一道门槛，那些二十岁的年轻气盛和美好理想，到了三十岁，终究还是被现实打得七零八落，弄得一地鸡毛。我出生在山东省一个普通家庭，儿时生活虽不富裕，但却是我人生中最美好的时光。
          母亲品性温和柔顺，父亲虽然倔强，但却正统耿直，我也算是传统意义上的好学生，学习成绩优秀，担任班委成员。高中成绩虽有下降，但好歹也进入了一所普通大学。09年大学刚毕业，父亲就因病住院。在医院守了三个月后，父亲离世，为了生计，我选择开始工作，进入当地一家龙头商业企业。
          我是从最基层的工作做起的，11年通过公司内部竞聘，成功提升到商场管理岗位，那时工作很简单，只需要心无旁骛的把部门业绩做到名列前茅就好。13年到15年，公司安排我在不同的管理岗位进行锻炼。16年，当我兴致冲冲的调入公司总部，以为可以大展拳脚时，才发现原来社会远没有我想的那么简单。
          虽然企业已由国有转股份制很多年，但依然保留了很多国企的作风习惯。公司总部和一线商场不同，没有繁杂的业务，有的只是案堆如山的方案；没有简单的把业绩搞好，有的更多的是人与人之间复杂的利益关系，
          虽然来到总部也有四年时间了，但依然看不惯所谓的圈子、派别、送礼、酒文化和阿谀奉承，也瞧不上某些“机关大臣”媚上欺下、相互推诿、一手遮天。所以我从来不“站队”，我只是把自己的工作做好，但也深感因为自己的“不同”，
          走到了事业的瓶颈，这些年岗位一直是总监助理、副总助理之类的辅助管理职位；今年三月份，领导又把我安排到她的身边，担任总经理助理一职（实际她已有两位助理），我深知只是因她身边没有一个既懂业务，又有文案能力的人，所以现在过得也是十分焦虑迷茫和疲惫。
          `,
    珠玑: `八字分析：乙未日柱是不错的日柱，未为木库，又是日主的偏财和食神，所以往往乙未日出生的人都比较有财运。你的八字乙木生于申月，天干透出庚金和日主相合，为正官格。官星无伤无破，又有财生，所以你一直在国有单位发展。
          乙木本柔，官星重而合身，所以感到压力大是难免的。财官重而卯木禄在年上，而且卯辰穿把禄和官星坐支都穿坏了，所以导致格局层次降低。
          事业分析：八字月柱和时柱均为财官相生的组合，正官得令力量较大，日主坐未土财星之上，被财官包身，克耗的力量很大。
          年支卯木为原局唯一帮身之字，但离日主较远，且申月金旺木死，地支卯辰穿害，卯木被申金月令贴身克损，卯木作为乙木的根被损害，力量很弱，难以起到帮扶日主的作用。
          乙木出生的人，一般性格比较内敛，做事喜欢默默而为，不喜张扬高调，易暗斗不喜明取。加上乙木日主被财官包身，无印来通关，财生官杀，官杀攻身，造成人会比较低调老实，但也比较怕事，自卑，犹豫，容易三心二意，遇事没有主见。
          年干丁火食神透出，且官杀太旺，也暗示说话很容易口无遮拦得罪人，这些性格特点代表你适合做幕后工作，适合依靠过硬的技能来立身，专心把一件事情做得很好。跟着别人去做事。
          自己的话难以去当领导把舵领航，领导力较差，不适合在台前从事与人打交道的工作，如果是一些人际关系要求高，在工作单位与领导同事相处方面的事情，会比较难过。
          丁火食神透出也代表事业上喜欢遵从内心，按照自己最真实的想法去发展，不喜被别人左右，这种性格也是适合去钻研一项业务。
          八字为正官格，时干庚金正官星贴身，性格上人比较传统正直，是一个不越雷池一步的人。天干乙庚相合，庚金为正官，时支辰土为正财，庚金坐辰土之上为财戴官帽之格。
          但八字身弱，且日主乙木被财官包身，身弱难以担财官，财官难以被自身合入或得到。庚金可以代表大石头，乙木为花草之木，花草被庚金压在头上，代表工作上并不轻松，受到很大限制，事业发展会比较辛苦，被动，付出多而回报小。
          八字财星旺而无制，年支卯木去生了丁火，丁火食神来生财，则求财的欲望较大，人比较看重钱财，虽然也有财运，但为身弱财旺之命，求财过程会比较辛苦坎坷。
          身弱财旺是不建议你投资做生意的，做生意属于食伤生财的组合，对你而言属于泄耗的运气，容易血本无归。
          卯木用神在年柱，卯木为禄神，则适合远方求财，不适合在家乡发展。
          八字时柱是庚辰，纳音为白腊金，又临空亡，有金空则鸣之象，利求名，也是暗示你适合去通过过硬的技术去博得名声。
          正财和正官相随，也适合上班求财，或在大的平台发展会比较好。
          你在现在的公司是可以的，现在你走的甲辰大运，乙木见甲木为藤萝系甲，甲木为贵人为靠山，领导把你放在身边是一个很好的机遇。
          之所以有跳槽的想法是你性格的原因，若不能克服此想法坚持跳槽的话可以去更大的企业去求发展。
          至于你有考编的想法，八字有正财和正官相随，但原局缺印，印为实权，从事公职行业最多只能求得名誉，或获得虚职，如调研员，巡视员等，或副职分管非核心业务，没有实权。
          另一方面，官多压身，身弱不担财官则必然为财官所累，从大运来看，印星出现的大运均被合拌无力，也是不利仕途。所以只如果过求稳定，可以去考事业单位，只是考了也难以有所发展。
          如果走上公职行业和岗位，不要有太大升职欲望，尽量去选择一些专业技术岗或业务较为单纯的岗位，窗口岗位，综合性的岗位都需要很高的情商才可以有所发展，对于你会很痛苦。
          从现实角度来说，你现在的岗位也体现了你这方面的弱势，你应该正确认识到自己的优劣，去考编只是意识逃避而已，解决不了根本问题。
          同时你也也要适当调整自己的性格，提升下与人打交道的能力，放低身段，想改变环境只有先融入环境，也要注意祸从口出。
          婚姻分析：你的八字临天医，太极贵人，华盖，则暗示孤独，性格内向，不善于与异性交往，谈恋爱的话会显得比较被动，即使追求异性缘分也难以圆满，也暗示你有佛道缘分，为不利婚姻的体现。
          原局丁火食神高透，对感情比较挑剔，要求较高，存在完美主义倾向。对另一半要求高，不容易满足，也容易发生口角或抱怨，这也不利于婚姻的稳定。
          日支为偏财，则对妻子长相外貌身材等要求较高，对婚姻充满幻想。八字财星较多且旺，人也会有些花心，自己心性不定，容易见一个爱一个，甚至双性恋，这个是要特别注意的，想拥有一段美满的婚姻，这个心态不去改变则很难。
          八字时柱辰土正财星生了庚金正官，正官来合身，代表能得到妻子，但会因为感情的问题，而让自己压力很大，或因为感情婚姻问题会消耗很多钱财。日主被财官包身所克耗，则为妻管严，妻子会比较强势。
          你的八字财星混杂，表示身边异性比较多，只要你有这个欲望就会得到。先见正财后见偏财再见正财，则婚前会经历一些失败的感情，也为多婚之命，晚婚为吉。
          正财透而偏财在地支，对另一半不容易满意。日支未土为偏财，偏财在日支，正财不入主位，则爱妾不爱妻，很容易有婚外情，这是要注意的。
          男命以正官代表女儿，时柱为子女宫，则时干庚金正官代表女儿，乙庚相合，正官合身，则有女儿运，也能得到。时柱正财星来生正官星，则以后女儿比较有能力。但由于你身弱难以担财官，会为女儿所累。
          大运分析：33岁-42岁走的是甲辰大运，此大运天干甲木出现，日主乙木见甲木为藤萝系甲，甲木为你的贵人，靠山，你现在正赶上这个机遇，所以不建议你跳槽，在现在总经理助理岗位上把工作干好，在领导身边工作能有展现自己的机会，这个大运是你事业黄金期要好好把握。但地支两个辰土去穿害了年支卯木，工作之余，也要注意身体健康。
          43岁-52岁走的是癸卯大运，此大运天干虽出现癸水印星，但戊癸相合，癸水难以起到滋养乙木的作用，财官无法通关生身，在事业上比较平凡无奇。地支卯木可以帮身去制财，这个大运财运还是不错的，但卯辰穿害，也是要注意健康和破财。
          53岁-62岁走的是壬寅大运，此大运也为印比大运，但天干壬水和原局构成丁壬相合，被合拌而难以发挥作用来生身。地支寅卯辰三会木局，木来制土为吉，比劫帮身来制土则可以得到财，这步大运财运很不错。事业上也要努力做出成绩，有升职加薪的机会。
          63岁-72岁走的是辛丑大运，此大运为财杀相生的大运，和原局日柱构成天克地冲，日主身弱是不喜天克地冲的，所以这步大运运势较为低迷，烦恼也较多，身体也不好。天干辛金去克身，地支丑土去冲未土，土又被冲旺了，婚姻也会有一些矛盾争吵。
          接下来庚子大运地支子卯相刑，子未穿害，则卯木禄神受损，要注意肝胆不好。子水受损要注意肾泌尿系统方面疾病。
          己亥大运地支出现亥卯未三合，但由于木不得令，故合而不化，反而亥水被合克不吉，也要注意身体问题。
          你的八字身弱财官旺，有时候顶不住压力，如想考编现在的大运可以去拼一把，今年辛丑年和原局天克地冲不吉，明年壬寅年可以把握下。
          但对你来说，考上了，工作也有相似问题，且你的性格处事同样不能很好的适应环境，如果只是求稳定可以考虑，难有太大发展，做的也不开心。
          工作方面建议你好好珍惜现在的工作岗位，不要去在意和你同岗位竞争的人，领导之所以考虑调你在这个岗位上一定有他的考虑，也有你的优势，努力工作做出让领导满意的成果才是你的机遇。
          `
  }]
}

export default {
  辰时
}