const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1987年六月月二十七日辰时'
  }],
  十神: '正财   七杀   日元   偏财',
  天干: '丁(火) 戊(土) 壬(水) 丙(火)',
  地支: '卯(木) 申(金) 寅(木) 午(火)',
  遁藏: '伤官   枭神   食神   正财',
  大运: '丁未，丙午，乙巳，甲辰，癸卯，壬寅，辛丑，庚子，6岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/311.html',
    命主甲: `受邻家一位老人所托，她有一子，不受管教，混迹社会，爱打架斗殴，每每惹出事来就拿父母的血汗钱赔偿对方。家中也盼他能走上正道，但是做生意都赔了。
          由于第三者，跟妻子离婚了，有一女一子但并没有尽到做父亲的责任，都是老人一手带大。
          2019去年又因为打架进了监狱，老人几乎绝望。
          `,
    珠玑: `八字分析：壬水日主生在申月得令，申月金旺而水相，月令对日主的生助是比较大的。但是地支卯申暗合，同时日支又寅申冲，代表月令不太平稳，不能专心生助日主。同时年干为丁火生月干土贴身克日主。时柱丙午又与日支寅午半合火，贴身耗日主的力量。而八字只有一个月令，其他都是克泄耗日主的五行，所以日主偏弱喜金水为用神，以木火土为忌神。
          八字年支为卯木伤官生年干丁火财星，日支寅木食神生时支的午火财星，财星又透出在年干时干，整个八字的财星力量是比较旺的，而财旺克印，印代表是一些传统思想，家庭管教，自我约束力等，财旺会贪财克印，会因为缺乏约束，而违背法律和道德，做出违法的事情。
          而八字月干透出戊土七杀，财旺生七杀，八字身弱不抗杀，七杀克身，食伤旺，也是容易引起灾祸，而他的八字月令为用神，但其他都是忌神，日主被克泄耗严重，日主周围的五行都是忌神，代表他的事业发展是不利的，也比较容易碰壁，遭受阻碍。
          结合他的大运来看，早年一路走的是财运，食伤大运，更加增强了财星生七杀的力量，对他的命运发展是不利的，一时都难以改变。整体来说，他的八字格局层次不高，属于非常普通的格局。
          1.她这个儿子还有希望吗？能否改邪归正？走正路安稳干活过日子。
          解答：他的八字喜印比为用神，忌食伤财官杀，想要改邪归正的话，必须是走印星比劫大运才可以，而相对来说，他的八字走印星大运更重要些，因为印代表的是自我约束力，道德观念，印旺去克制食伤，能够约束自己的想法和行为。
          而走比劫运的话，虽然可以克了财星，但比劫旺了也代表自我，胆子大，同时会去生食伤，最终的五行力量对他还是不利，他后面大运一路走的是食神，比劫大运，到了晚年才走印运。他要彻底改邪归正的话是很难，他的自制力比较差，且不太愿意去改变。
          2.以后还会有牢狱之灾吗？
          解答：他从2012年-2021年走的是乙巳大运，为忌神大运，而且大运和八字组成寅巳申三刑，又是财克印的组合，可以说这个大运对于他来说，牢狱是在所难免。而下一个大运是甲辰大运，属于食神生财的运气，财星力量增加七杀克身，也是容易引来牢狱之灾，特别是在2025年，2026年财星旺的时候容易发生牢狱之灾。
          而2024年-2039年食伤无制生财，财官杀旺的时候也是比较危险。总之当他遇到食伤旺，财旺，官杀旺，财克印的年份都容易出问题。
          3.儿女跟他的缘分怎样？是否相克？
          4.如果不能改邪归正，那老人所带的这个孙子是否能有出息？
          解答：他的八字以七杀代表子女，七杀在年干为子女星，同时参考子女宫时柱丙午，八字当中子女星和子女宫都是忌神，代表他命里和子女的缘分不强，子女关系也不太好，和子女缘分浅薄，享受不到子女福分。
          有句老话讲：有生无养，断指可报；有生有养，断头可报。生孩子是爱情的结晶，某种角度来说是两个人爱情欢愉的产物，只是把孩子生下来，却没有尽到抚养教育的责任，并不是很大的恩德，最多就是断根手指，就报答他的生育之恩。
          他虽然生了一儿一女，不仅没有尽到父亲的责任，反而带来一个不幸的家庭，增加家庭的负担，对孩子童年的成长带来了阴影，即使孩子长大了也很难面对他，这样的情况注定是和儿女关系很难好，亲情也是淡薄。
          而从他的八字看子女出息，他的八字以七杀为子女星，以戊土七杀当做子女为立足点来看，戊土七杀为子女的太极日元，戊土得两边的火来生助，火为戊土的印星，说明子女和他比起来，懂事有教养的多，也可以遵纪守法，而戊土坐下申金为戊土的食神，寅木为戊土的七杀，卯为戊土的正官，地支食神制杀而留官，年柱丁卯与戊戌又是官印相生的组合，说明他的子女格局还算不错，孩子会比较懂事，也会有出息。
          他的八字格局比较差，日主偏弱，八字财旺生七杀克身，食伤又去生助财星，八字身弱不担财，财旺生杀克身为忌，而且财旺又为贪财坏印，容易不遵纪守法，为人人品是比较差的，缺乏自我约束和控制力，不受道德和法律约束，也容易带来牢狱之灾，加上大运走的又是忌神大运，很难改变过来，到晚年走印运虽然会有所改变，但来得太晚了，更多是他老了，坏不动了。
          像他这个八字组合，如果小时候多读书，命运或许又不一样，因为读书，学习，知识就是代表印，通过印的力量来化解他八字当中的问题。
          他的八字早年有辍学之象，作为家长没有提前干预，给孩子做个规划引导，以至于过早进入社会，对他命运发展很不好，以至于他不能明是非，懂善恶，知羞耻，做出有悖于道德法律的事情，让父母失望和寒心。
          网上看过一些新闻报道，某人犯了罪行，父母想尽办法为孩子开脱，网友认为父母不明事理，但作为父母来说，哪有不疼自己孩子的，哪怕自己的孩子一错再错。
          只是这种好不是对孩子好，而是害了他。有的父母遇到孩子犯错的时候，似乎只是吓唬吓唬孩子，小孩察言观色能力其实很强，他发现父母并不是真的想教训自己，这种教训么有什么意义，小孩也意识不到什么是对错，会变本加厉。
          孩子小时候犯错不能严厉训斥，给他教训，每次为他犯错擦屁股，他心里没有了对错的认识，以至于一次次犯错甚至犯罪。
          教育孩子不一定是读书多厉害，赚多少财富，能够努力，上进，踏实，善良就非常好了。一个人没有树立正确的三观，飞扬跋扈，即使财富再多，地位再高，也不会长久。
          对老人来说，虽然是自己的亲生儿子，作为父母总希望哪天他能变好，希望能倾尽自己所有解决孩子闯的祸，但他的情况来看，即使不断的给他擦屁股，他也不会改邪归正，还会继续闯祸，拖累整个家庭，且老人家也是心有余而力不足。甚至会影响到孙子孙女的教育。
          既然他现在再次犯错，进了监狱，那就让他在监狱接受改造，让法律来教育他重新做人。好好带好孙子孙女，培养好，更重要些。
          `
  }]
}

export default {
  午时
}