const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   伤官   日元   正官',
  天干: '戊(土) 癸(水) 庚(金) 丁(火)',
  地支: '辰(土) 亥(水) 辰(土) 丑(土)',
  遁藏: '枭神   食神   枭神   正印',
  大运: '壬戌，辛酉，庚申，己未，戊午，丁巳，丙辰，乙卯，甲寅，6岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/436.html',
    命主甲: `关于事业，我一直不喜欢现在的工作，压力大，离家远，收入一般。
          谈过一个丁火日主的男生，分手了。
          `,
    珠玑: `八字分析：庚金生于亥月，为食神格，透出伤官癸水合戊土偏印，为伤官配印。庚辰日坐魁罡，偏印又旺，性格方面必然有些偏激。同时印旺，丁火官星虚浮，被印星泄得厉害，财星藏于土水之中，不发露不得力。婚姻怕是有些艰难了。
          事业分析：伤官高透，比较喜欢自由，不喜欢被束缚，被限制，管束太多。但伤官被克，地支辰辰自刑，心情容易抑郁，有患抑郁症的可能。
          食神代表的是才华，技术，吃喝等，适合去从事咨询，语言方面的工作，也适合去做点小吃，餐饮之类的工作，八字印多为忌，早年学业较为平凡，父母对你干涉较多，离家发展对你是有利的，方位上去北方、东方、东南方发展为吉。
          八字不见财星，只有地支辰土中暗藏了乙木正财，亥水中暗藏了甲木偏财，属于身旺财弱之命，求财较为困难，工作中难以遇到好的机遇，贵人运也不太好。
          地支辰辰自刑，地支三个土来克亥水，财星受损，食伤受损，财的源头也受损，财运不太好，难以聚财，容易破财。
          年柱戊辰干支一气为枭神，月柱癸亥干支一气为伤官，天干戊癸相合，伤官与枭神合拌，导致伤官难泄秀，才华难以发挥出来，价值难以显露，事业很容易受制，遇到困难和阻碍，遭受不公待遇，会感到怀才不遇。
          八字三个偏印，旺且为忌，也代表内心比较敏感，想法多，想法杂乱，加上枭神夺食，想法虽然多，但多不切实际的空想，不能得到好的实现，想得多做得少，计划难以得到实现。
          婚姻分析：庚金日出生的女命，性格上一般比较刚直果敢，而且你的八字中和偏旺，现在走的又是庚申大运，则这个性格特点会较为明显。
          魁罡日出生，脾气比较大，固执倔强，枭印较多，会有些孤僻，性格甚至有时候怪异，好强自我，又临太极贵人、寡宿、红鸾和华盖，这些神煞都是孤独之象，不利婚姻的。
          枭印太旺，是泄耗夫星的力量，也是对女人婚姻不利的，印旺也是一种克夫的信息。
          时干丁火为正官，坐丑土之上被直接消耗，且原局没有财来生官，夫星较弱，不容易遇到满意的对象，丁火在时柱出现，则为晚婚之命。
          枭神多虽然能吃苦，重情义，但对感情又会有些完美理想注意，精神洁癖，对待感情会比较敏感，疑心较重，这个性格是不利于夫妻相处的，相处久了容易造成矛盾不和谐。
          天干伤官癸水与枭神戊土合拌，导致癸水受损，地支亥水见辰为入库，又辰辰自刑，亥水被克损，原局水无元神来生扶，构成枭神夺食，用神被忌神所制，这是非常不吉的。
          枭神夺食的八字一方面性格不好，心胸不大，脾气不好，心情不快，以后家庭不和矛盾大，另一方面也容易发生是非纠纷，身体也容易不好，因为食伤为寿元星，水被克泄严重，与水相关的健康部位容易出问题，如肾泌尿，妇科方面。以及要注意怀孕方面，怀孕不容易，以及怀孕过程不稳定。
          日支辰土为婚姻宫，辰辰自刑则婚姻宫受到伤害不吉，体现为结婚后家庭不和谐，夫妻矛盾大。辰土为印星，婚后也容易和男方家庭闹不和。
          日支为枭神，未来的丈夫人品还是很不错的，对你也比较爱护，婚姻不顺更多会是你自己的原因多些。
          你的八字伤官被克，尤其是天干戊癸相合，则癸水难以去克时干丁火，则不构成伤官见官，且以后的大运也没有食伤大运了，也是吉的一面。
          但没有了食伤运，原局食伤星被克损严重，则子女缘分较弱，在要孩子前要注意调理，切忌不能去打胎，不然以后会影响到你生育。另外一方面，有了孩子之后夫妻矛盾会加大，也会有离婚的概率。
          大运分析：26岁-35岁走的是庚申大运，此大运干支一气为比肩大运，也为空亡大运，增强了八字金五行和日主的力量，地支申亥穿害，伤害了食伤，身体健康不好，也不适合去求子，心情也较为抑郁，会经常想不开，也为比肩夺官的大运，婚姻不太理想，异性容易被第三者女人插足，整体婚姻运不太平稳。
          从流年来看，2017年丁酉年，天干正官星透出，地支辰酉相合，且酉金为桃花，则这一年是有结婚之象的，但是错过了。
          明年壬寅年，天干丁壬相合，地支寅亥相合，驿马星动，则适合换工作。
          36岁-45岁走的是己未大运，此大运为土印大运，原局土太旺，则不喜大运再见土，这步大运是不利的。干支一气土旺来克伤官用神，则要注意官非之事和口舌之事，身体容易不好。
          大运印星旺，所以也会比较忙碌疲劳，事业上要谨慎求稳，注意理财，不要贸然去投资开店，容易发生破财之事。大运印旺也较为克夫，婚姻中容易顾虑和烦恼较多，人比较多疑，导致感情隔阂矛盾。
          2023年癸卯年、2025乙巳年、2026丙午年，则还是会遇到缘分的，要好好把握。
          46岁-55岁走的是戊午大运，此大运为官印相生的大运，天干戊癸合火，枭神夺食，地支丑午穿害，午火的出现加强了印星的力量，引动了时干丁火，则心情容易抑郁憋闷，工作容易发生变动，财运不好，身体健康不利，子女缘分也较弱，家庭上也容易发生不和之事，争吵矛盾较多。
          你的感情不顺利，和你的性格是一个很大因素，性格是必须要改变的，你的八字容易接触和倾向于负能量，平常多克制自己负面能量，去除自己的妄念，修习一颗清净心，也可以多接触正能量的人和事，通过身边人环境来改变，你的命运自然会改变。
          `
  }]
}

export default {
  丑时
}