const 申时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   正财   日元   伤官',
  天干: '乙(木) 庚(金) 丁(火) 戊(土)',
  地支: '亥(水) 辰(土) 卯(木) 申(金)',
  遁藏: '正官   伤官   枭神   正财',
  大运: '己卯，戊寅，丁丑，丙子，乙亥，甲戌，癸酉，壬申，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/348.html',
    命主甲: `初中高中大学期间，父母经常吵架，我爸是个暴躁的人，那期间逼迫我妈多次外出务工，不让回家。我母亲是个典型的勤劳，朴实，聪慧的农村妇女。母亲对我影响比较大，从我母亲身上学到很多。
          17年末参加了考试在政府单位的事业编，18初年正式上班，去年初我父母离婚了。我爸脾气不好，经常有和别人吵架，以前有过沟通没有啥效果。今年这段时间以来，沟通感觉有点效果。
          还有单位上也是通过上个月的沟通，工作减免了些，但是工作任务还是很重。之前是专科今年上个月刚好本科也毕业了，今年也报考了公务员，不知道近几年考试运如何。
          `,
    珠玑: `八字分析：丁火日主生在辰月，时干透出戊土，为伤官格。伤官为凶神需要制化，伤官要么生财，要么制杀，要么配印，总之得让它有事情做。此命正财庚金得时而旺，而且有强根申金。
          偏印乙木坐亥水，有卯根，在辰月也不算弱。本来偏印和正财都可以用，但乙庚一合，用神的作用就打了折扣。只是，偏印太旺也不好，旺了会夺食，对身体不利，正财旺相刚好制约偏印，也算好事一桩。
          性格分析：月干庚金财星透出，且印合财，日支又逢印，伤官生财，说明是比较有上进心，事业心的。丁火日主，同时坐卯木印星相生，也代表自己比较务实，做事亲力亲为，同时伤官生财，所以也不是个安于现状的人，为人有自己的原则，且做事效率高，能力也还不错，可以通过自己坚持努力，实现自己的目标和计划。
          事业分析：月干透出庚金财星，和年干的乙木偏印合，且乙木偏印在日支有卯木强根，年干偏印被合制，是忌神被合，是好的一面。年支亥水正官有印星护卫，又有正财相生，而且中年有子、亥水运，官星无伤自然可以往国企事业单位，公务员方面发展。
          日柱丁卯，时柱戊申是木火土金小太极循环相生的流通组合，没有明显的生克，也是好的一面，日主被泄，代表付出多而有收获，八字原局组合来看还不错。结合大运走势看，大运走势有帮助，整体格局层次还算可以，达到中产是没问题。
          现在走的是丁丑大运，今年庚子年，太岁与大运相克，天干比肩克财，地支食神制杀，学业运本不吉，但太岁介入八字还算流通，且印星无伤，所以今年的学业运还算可以。
          明年辛丑年，食神生财，偏财克偏印，乙木偏印被克，对学业不利。
          2022年，2023年都属于官印，杀印相生的组合，学业考试运也相对不错，利于学业考试的发展，好好备考可以考上公务员。
          六亲分析：八字财星为父，印星为母，乙木在年干代表母亲，流年来看，2021年食神生财，天干财克印的时候，要注意父母的健康。母亲要注意些头部胀痛，跌打扭伤，关节炎，骨质增生及气血方面问题，父亲注意肝脏，心脑血管，心脏呼吸，皮肤病方面的问题，尤其是2026年，2030年及2034年，2041年的时候。
          大运分析：21岁-30岁走的是丁丑大运，此大运比肩帮身增强日主的力量，地支食神生财，八字中喜用神没有发生冲克刑害，整体而言，此大运你可以通过自己坚持努力，付出多些而获得发展提升和收获，同时八字食伤旺，忌讳太急躁，急于求成而适得其反。
          31岁-40岁走的是丙子大运，此大运天干劫财有制，八字形成火土金相生，为印生比劫加伤官生财的流通组合，对你的事业是有帮助的，但地支子卯刑，财生官杀，要注意下人际关系方面问题，另外是开支花销也比较多，但能花也能赚，整体属于利大于弊的运气组合。
          41岁后走的是乙亥大运，和甲戌大运，这两个大运印星透出，与八字形成伤官生财配印的组合格局，八字整体还算流通，所以这两个大运还有更好的发展提升，和升职机会。
          而61岁后分别走官杀运气，与八字财生官，官印杀印相生，地支为财源，财生官杀，八字印无伤，还算流通，整体晚年运一般偏好些。
          你的日主偏弱，八字印星透出力量强，地支印星也没有明显的冲克，又有官印相生的组合，加上日柱与时柱形成木火土金流通相生的小太极组合，对你的发展也是有帮助的，结合大运走势来看，一路天干走的都是生助日主的运气，可以承担起更大的财官，可以在事业上获得发展成功。
          `
  }]
}

export default {
  申时
}