const 巳时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   伤官   日元   正印',
  天干: '癸(水) 辛(金) 戊(土) 丁(火)',
  地支: '酉(金) 酉(金) 申(金) 巳(火)',
  遁藏: '伤官   伤官   食神   枭神',
  大运: '壬戌，癸亥，甲子，乙丑，丙寅，丁卯，戊辰，己巳，庚午，6岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/519.html',
    命主甲: `高中时候贪玩，没好好学习，上了一个普通本科，选错了专业，后来转行多次，做过运营，做过会计，但都觉得人生这样过没什么意思，后来报了培训班学习编程，两年前来到了北京找了个程序员的工作，工资很低，但是加班不多，可以抽空学习，今年自学考研考上了，以后想往项目管理方向发展。
          老师我总觉得自己心里不够强大，特别玻璃心，但是项目经理都需要特别圆滑特别强大，可以应对各种人，其实我还很害怕社交，但都是硬着头皮面对工作上的人和事。
          `,
    珠玑: `八字分析：戊土生在辛酉月，典型的伤官格，年支酉，日支申，食神伤官混杂，金特别旺。食伤旺的人一天就喜欢东想西想，想得多做得少，多少有点懒惰。时柱丁已是全局关键，伤官需要配印，丁已一柱正印伴禄适得其用。戊癸合求财心重，但金多不大生水，还得看正印。
          事业分析：酉月已进入秋季，出生接近中秋，天气逐渐转寒，喜见丙火来暖身，原局虽不见丙火，但时柱丁火和巳火可以起到暖局之用，也算吉祥。命局金旺成势，喜见火来制金生土，时柱虽有丁巳，但无木来生火，制金力量打折扣，忌神较旺，用神无力，格局层次一般。
          八字为伤官格，伤官得令较旺，为人想法较多，内心不太安分，做事容易三心二意，不专心，容易半途而废，难以坚持到底，但也比较有上进心。伤官格的人性格容易骄傲自满，做出成绩容易得意忘形。不过天干有丁火正印，可以起到些制伤官的作用，所以也有吉利的一面，为人比较聪明。
          伤官旺的人，也比较任性，冲动，有的时候喜欢逞强，不太喜欢被约束，因为伤官是克官的，官代表就是约束，也容易对工作不满，容易说话直接，与人发生争执矛盾，导致人际关系不太好，影响到事业的发展。
          地支酉酉自刑，且巳申相合，为枭神夺食的组合，则内心承受力不强，容易郁闷想不开，这些性格缺点要克服，否则很难把一份事业坚持下去做好。
          八字伤官星较旺，比较崇尚自由，不喜欢被束缚，多喜欢自由行业，也喜欢比较有挑战的工作，不喜墨守成规，按部就班枯燥的工作。八字不见官杀，适合从事自由一些的工作，朝九晚五，按部就班坐办公室的工作，会让你不舒服不自在。
          年干癸水正财星得酉金和辛金生扶，为伤官生财的组合，适合外出发展，去出生地的南方，东北方，西南方比较旺你。天干戊癸相合，正财合身，多依靠辛勤努力求财，身弱不担财则求财辛苦，天干癸水财星高透，且癸丁相冲，则不聚财，花销大。
          八字伤官重重，非常适合在大一点的平台公司，从事业务，创新能力较强的工作，如一些设计策划，技术，教育培训，市场更销售等，比较适合你，具有挑战性的工作，你越有动力和激情，你计划从事项目管理工作，是适合你的，可以朝这个方向去努力。
          健康分析：八字伤官泄身太过，抵抗力较常人稍弱，八字土弱，要注意脾胃方面容易诱发疾病，好在有印星贴身护身，是吉的一面。八字金旺成势，要注意肺呼吸道，大肠方面疾病。八字缺木，也要注意肝胆，筋骨方面疾病。
          八字身弱，以印星为寿元星，印星不可受损，食神不能受刑冲，逢猪年，虎年要注意身体健康，这些年份也要注意母亲身体健康。八字印星为用，但不见官杀星来生印，母亲身体健康容易不好，要多注意。
          大运分析：26岁-35岁走的是甲子大运，此大运为财杀相生的大运，天干甲木虽制戊土日主，但去生火为吉，旺了印星则利考学，此大运可以考上理想的学历，获得一定文凭和学历。地支子水财星得食伤星生扶，财星不弱，印星旺来生扶日主，可以担一定的财，总体财运不差。
          36岁-45岁走的是乙丑大运，此大运地支丑土被天干乙木盖头，天干乙木旺了丁火印星为吉，事业上可以得到贵人相助，可以发挥自己的才华，做出一定成绩。但地支巳酉丑合金局，巳火用神化忌，也容易有不顺利之事，容易因为骄傲自满说话直接等问题，影响到人际关系，而不利于事业开展，总体运势吉凶参半。
          46岁-55岁走的是丙寅大运，此大运为杀印相生的大运，天干丙辛相合，丙火枭神去制辛金伤官星，脾气上会收敛改变，开始成熟稳重，印星高透则事业上有升职的机会。而地支寅巳申三刑，要注意意外伤害，尤其注意出行安全。
          丁卯大运，天干丁火去制辛金伤官星为吉，性格缺点会有所克服，但地支卯木生火也是好的。只是被一片金来制，容易有些冲克，要注意口舌是非，也要注意四肢受伤。戊辰大运，干支一气为比肩大运，比肩帮身为吉，则总体财运较好，晚年运势较为平顺。
          世事洞明皆学问，人情练达即文章。你和人打交道的能力，为人处世的能力比较欠缺，但不管你去任何单位，与人合作交往，都是离不开些能力，缺陷太明显的话肯定会吃亏的，躲是躲不掉的，唯有主动面对，积极求变，先适应后顺心，情商和智商同样重要，既然不能出世就只能入世，入世就要掌握这项基本技能，对你有百利而无一害。
          `
  }]
}

export default {
  巳时
}