const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '食神   比肩   日元   七杀',
  天干: '戊(土) 丙(火) 丙(火) 壬(水)',
  地支: '申(金) 辰(土) 申(金) 辰(土)',
  遁藏: '偏财   食神   偏财   食神',
  大运: '丁巳 戊午 己未 庚申 辛酉 壬戌',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/170.html',
    命主甲: `丙火从势格贵如春雨，大运助力创全球知名企业
          `,
    珠玑: `此造出生日的日干为丙火，所以属丙火命，生三月辰月，土正秉令，有晦火泄身之咎，天生火已弱。再见时支又是辰土，年、日两支两申金，即二土二金，丙火日干不通根地支。天干透出一戊土、一壬水，皆泄弱和克制日干丙火。全局唯一见到月干丙火透出帮日主，但此丙火坐辰土泄气，地支无木火之根，又遭天干壬水克，戊土泄气，此丙火虚浮不能用。
          而四柱两申金（两财），两辰土一戊土（三食伤），一壬水（一官），财、食伤、官竞强，日干无根，且弱不堪扶，唯有从强者之势，但又不能从一神而去，只好从命中食伤、财、官之旺势，为“从势格”。但因天干有月干丙火比劫透出，可判为“假从势格”。
          “从势格”的构成和其取用的方法：日主无根，满盘都是财、官、食伤，也不见有印、劫生扶。日干弱不堪扶；但又不能从一神而去，只好从财、官、食伤之旺势而去。行运以财、官、食伤三者较强之神为用神；如果三者力量均停，不分强弱，则须行财运以和之，引通食伤之气，助其财官之势，则吉；行官杀运次之，行食伤运又次之。行印、比劫、禄刃运，必凶无疑。
          所以此造行运喜土、金、水，即喜食伤、财、官运，忌木、火，即忌印、比劫、禄刃运。
          早运南方巳、午禄刃火运，本为不利，但地支中有两辰土化解，成火生土，土生金，凶为吉兆。己土运伤官发挥有利，38岁创业，之后走了几十年土、金、水运有利，成为全球知名企业，年营业额200多亿美元。
          此造“从势格”，格中食伤、财皆旺，为喜用，凡食伤泄秀为喜用，精华吐露，必为聪明绝顶之人。而从势格等的从弱格之人，又能跟随、顺从形势之发展和变化，于是能发挥绝顶的聪明才智，看准形势，而能创业成功发大财。壬水一点偏官，主有掌管企业之职位，且在创业路上具谨慎、警惕、防范之心。
          命中喜土、金、水，即命中有六个喜用神，犹如一架飞机有六个发动机（事实上现在的飞机至多只有四个发动机），一旦行起土金水运时，犹如六个发动机一齐起动，当然比一般普通的命，更能成功致富贵了。
          `
  }]
}

export default {
  辰时
}