const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1995年七月初九酉时'
  }],
  十神: '枭神   七杀   日元   食神',
  天干: '乙(木) 癸(水) 丁(火) 己(土)',
  地支: '亥(水) 未(土) 卯(木) 酉(金)',
  遁藏: '正官   食神   枭神   正财',
  大运: '甲申，乙酉，丙戌，丁亥，戊子，己丑，庚寅，辛卯，壬辰，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/501.html',
    命主甲: `出生于安徽合肥，小时候家境和成绩都很不错，13年考入某政法大学。13年以后命运就发生接连不断地转变，父母生意失败欠下巨款，自己身体出现各种情况并查出轻度抑郁。之后虽然成为律师，但一直压抑，收入也甚微。
          感情上谈过多次，遇到的男孩子基本条件性格都不合适。现如今很迷茫，也对生活感到很悲观，感觉周围原来很多不如我的都比我强很多。
          `,
    珠玑: `八字分析：丁火生于未月，时干透己土，为食神格。地支亥卯未三合，年干透出乙，为偏印猖狂，在大运流年的参与下肯定会有对食神不利的时候。而且，癸水七杀虽不当今，但紧邻日干，会趁自己不注意给自己带来伤害。时支酉金冲卯木保护食神，时柱为用，晚运及子女运不错。
          事业分析：丁火和丙火都属火，不同的是丙火好比是太阳，而丁火则是灯盏，好比是灯芯之火，而卯木则为灯芯，那么癸水和亥水好比灯油，你的八字丁火日主，有卯木，癸水，亥水，为三象俱全的命，比较吉祥。
          只是天干的丁火被癸水冲克，地支卯木被酉金冲克，破坏了三象的组合，格局层次低了很多。
          官杀混杂且七杀食神贴身，为人比较聪明伶俐。丁火日出生，日坐枭神，性格比较文静，感情细腻丰富，比较懂得关心体贴别人。
          八字食神泄身，天干癸水七杀来攻身，癸丁相冲，年柱空亡，日支卯木被酉金冲克无力，性格上体现为比较胆小怕事，压力较大，做事缺乏勇气和魄力，因此会错过很多良机，也容易有暗疾，睡眠不好。
          年干乙木为偏印，被月干癸水和年支亥水包身，癸水和亥水为官杀，为官杀护印，乙木偏印被官杀保护，没有受到任何伤害。乙木偏印有偏财制约，且状态很好，则可以取得一定文凭。
          八字原局癸水和亥水官杀去生了年干乙木枭神，地支合拌，为官印相生的组合，但身弱不担官杀，且原局官杀混杂，导致杂而不贵，从事律师职业难有所建树，另外律师这个职业也会给你带来很多压力和烦恼，从事这一行并不顺利，去正式单位上班求财，有一份稳定的收入会轻松一点。
          丁火在八字中代表如文化，思想，教育，易学，医学，烛火等意象，卯木代表书本，丁卯的组合则代表文化，从事文化相关职业是很适合你的。乙木代表笔，癸水和亥水代表墨，这个组合是非常利学习的，时干己土食神贴身，食神代表晚辈，学生，也暗示你也很适合从事教师职业。印为学校，在学校上班是有利发展的。
          婚姻分析：你的八字年月日时均为阴干支，即八字纯阴，所谓孤阴不生孤阳不长，阴阳严重失调，阴命多孤寡，主要是性格上比较阴沉，婚姻缘分也较弱。
          另外八字临太极贵人，华盖，也是在感情性格上会有些孤僻的，与异性相处比较被动。而丁火是灯火，癸水是至阴至暗，也是一种孤独孤单的象。食神高透贴身，对另一半要求过高，不容易满足，也不容易接受一个人，故而婚姻难落实。
          八字原局先见亥水正官，后见癸水七星，为官杀混杂的组合，且杀近而夫远，则很容易发生多婚，身边容易出现一些烂桃花，这是要注意的。
          丁火为灯芯之火，最怕见癸水来冲克。癸水直接来冲克丁火，癸水为忌神，则遇到的异性人品或条件一般，对自己帮助不大，对自己不够体贴，一段感情很容易无疾而终。好在有月支未土食神来制杀，则会稍微好点。
          日支卯木为夫宫，地支卯酉相冲，且亥卯未相合，则卯木并不安宁，也暗示婚姻不稳定，容易发生多婚。
          健康分析：日干丁火为自己，七杀贴身克，年干没直接生扶，则会体现为体弱多病，体质不好，抵抗力较差。
          2006年-2015年走的是乙酉大运，引动原局卯酉冲，卯动则未土食神受克，天干乙木也会克己土形成枭神夺食，所以这个阶段身体会不好。
          天干丁癸相冲，则日主丁火受到冲克，也为健康受损的体现。癸水代表肾，耳朵，泌尿系统，丁火代表心血管，两者相冲则极易发生耳，血液系统等疾病。2013年为癸巳年，天干两癸冲一丁，地支巳亥相冲，又走乙酉大运，则会诱发疾病。
          大运分析：22岁-31岁走的是丙戌大运，此大运丙火劫财透出，丙火是太阳之光，夺了丁火的光芒，且丙火和丁火见戌土有入墓之象，丁火黯淡无光，体现为事业上难以有所成就，有好的机会总是让别人所得，贵人运较差，不容易显示出自己的才华。地支卯戌相合，酉戌穿害，则财星受损，财运较差，容易破财。但总归卯戌相合解了原局的卯酉冲，这个大运能够落实婚姻。
          2022年为壬寅年，天干丁壬相合，壬水正官被合入，会遇到正缘，有结婚的运气，要好好把握。
          32岁-41岁走的是丁亥大运，此大运天干丁火坐亥水之上被戳脚，则丁火虽来帮身，但力量较弱。天干两个丁火去冲癸水，要注意肾脏，泌尿系统，耳朵等方面疾病。地支亥水引动七杀，则这十年事业上运势会有所改善。
          42岁-51岁走的是戊子大运，此大运要特别注意身体健康问题。地支子卯相刑，卯木寿元星受损，身体健康不好，要特别注意肝胆，肾脏方面疾病。卯木婚姻宫受损，要注意婚姻争吵之事，家庭矛盾会较多。未土为食神，食神不管为用神还是忌神是不能受伤的，子未穿害也非常不利身体。
          己丑大运要注意的还是身体问题，丑未相冲冲了食神不利健康。庚寅大运，乙庚相合，财星破印，要注意破财之事。辛卯大运卯酉冲，也要注意破财和身体健康问题。
          由俭入奢易，由奢入俭难，意思是一个人啊，从节俭的紧衣缩食的生活，进入到富足的物质生活容易，但是从富足的物质生活进入紧衣缩食的生活则很难，每天花钱都是有计划，买东西不再是享受物质的豪华，而只是追求吃饱穿暖，这种落差不单单是物质上的，也包括了心理上的落差，比如虚荣，人际关系等等。
          你的父母过往的成就终究是他们所创造的，和你无关，你现在已经成年了，参加了工作，完全有条件自己去创造，你的问题更多是心态的问题，自己要有归零的心态，过往那些比同龄人高的物质条件，现在给你带来的更多只是心里包袱，这种落差让你看不上现在的工作，也看不上人，甚至影响到你的婚姻心态，
          你要学会去放下这些包袱，客观认识到自己，在以后你的命运之路，才能轻松前行。
          `
  }]
}

export default {
  酉时
}