const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1995年六月二十七日酉时'
  }],
  十神: '正印   正官   日元   劫财',
  天干: '乙(木) 癸(水) 丙(火) 丁(火)',
  地支: '亥(水) 未(土) 辰(土) 酉(金)',
  遁藏: '七杀   伤官   食神   正财',
  大运: '甲申，乙酉，丙戌，丁亥，戊子，己丑，庚寅，辛卯，壬辰，6岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/532.html',
    命主甲: `父母在福建厦门打工时生下我，一岁左右就和父母回老家江西上饶生活了。爸妈都是老师，非常宠爱我。
          小时候我的学习名列前茅，但是高中开始就一落千丈了。父母都是老好人，我也性格内向脾气非常的好，养成了讨好型人格，还得了轻度抑郁症和强迫症。
          所幸谈恋爱遇到了善良的人，他对我非常好，但因为我恐婚恋爱八年都没结婚，现在我俩是住在他工作的地方湖北宜昌。
          毕业三年我一直不敢工作，考教资也没考上。今年有缘结识佛法，顿悟许多，跨出了转折性的一步，找了第一份工作。虽然公司挺压榨员工的，966工资也才三四千，但也充实了我的生活，让我没有那么抑郁焦虑了。
          `,
    珠玑: `八字分析：丙火生于未月，为伤官格，乙木、丁火皆出于未土，为日主的正印，劫财。八字食伤旺又生财，官星也不弱，癸水官星制劫财有管理能力。伤官格、财官也重，宜配印为用。少年时代为乙亥大限，用神得力，因此读书名列前茅。
          事业分析：乙木正印为用，性格上会比较温柔体贴，比较善良，月令为未土旺为华盖星，性格偏内向，丙火日主在地支无根，做事容易不坚定，半途而废，不容易做成一项事业。
          未土伤官得令较旺，日支是辰土食神，为人理想较高，但也比较思虑重重的一个人，同时想法和会有些理想化，不切实际，导致难以把想法落实到行动上，也容易贪图安逸，趋于懒惰，这是要尽力克服的，不管考证还是工作，脚踏实地，坚持是一切的前提。
          年干乙木正印为用神，被癸水和亥水官杀星包局，官印杀印相生，而地支食伤制七杀，去杀留官，有做自己一番事业的潜力，天干乙丙丁三奇高透为用，八字原局是个比较有福气的一个人，但是大运走的不算太好，格局就打了折扣。
          月干透出癸水正官，正官正印高透，官印相生，利文化，地支酉辰相合，正财合身，财官印全，适合选择一份稳定的工作求财比较好。日支辰土为官杀库，日坐官杀，也是代表在稳定的单位上班最好。
          同时八字正星较多，暗示稳定较好，但年月官杀混杂，同时伤官克官，青年时期工作变动较多，并不稳定，也代表自己心性不稳，对规则，管束，约束等会有些抵触抗拒，容易对工作产生不满情绪，难以坚持到底，行事比较松散，这是要克服的。
          印星为用，日支辰土食神贴身，辰土食神去合酉金正财，天干丙丁双透利文化，这样的组合均适合从事教育教师相关工作和职业，能去学校上班最好。
          你现在走的丙戌大运，今年辛丑年，地支辰戌丑未全，一顿乱冲，内心浮躁，三心二意，考学运不好，明年壬寅年，地支寅木去制土，寅亥相合，乙木印星坐实，寅木驿马动，考学运较好，建议是好好规划下，今年多做些准备，明年有机会考过。
          婚姻分析：年支亥水为七杀，月干癸水为正官，为透官藏杀的组合，内心对感情和婚姻不太坚定，容易心生二心，月柱癸未为伤官见官的组合，对另一半不满挑剔，相处久了就容易心生厌倦，感情僵化，这是要注意的。
          八字官杀混杂，先见七杀，后见正官，早年很容易经历一份失败的感情，亥水七杀和癸水正官见辰入墓，不利感情。婚姻宫辰土为忌神，在感情上自己为付出较多的那个人，但收获不大，感情幸福感不强。时支酉金为桃花，被合入婚姻宫，未来丈夫有出轨的迹象。
          2023癸卯年，天干癸水正官星高透，地支卯酉相冲，解了原局的酉辰相合，可以结婚。
          健康分析：八字身弱，日主无根，地支未土和辰土泄身太过，抵抗力不好，体质较弱，容易感到疲惫，做事没力气，四肢乏力。食伤泄身较多，身材偏瘦，能胖一点对你健康比较有利。
          丙火日主在酉时出生，为日落西山之象，要注意灾祸，好在天干乙丙丁三奇高透，则可以化险为夷。
          天干癸丁相冲，丁火代表眼睛，则很容易眼目浑浊，近视，也要注意心血管方面疾病。丙丁火有神经系统的意象，天干被癸水所制，癸丁相冲，且命局泄身太过，很容易心情压抑，甚至患抑郁症。
          你现在走的丙戌大运，戌为丙之墓，走墓库大运不利身体健康，地支辰戌相冲，把土冲旺，且丙火在日柱有小肠的意象，容易得肠胃疾病，故而在饮食规律，饮食健康上要特别注意，少吃垃圾食品。
          大运分析：26岁-35岁走的是丙戌大运，此大运为墓库大运，身弱见墓库不吉，要特别注意身体健康，尤其是脾胃方面。地支辰戌相冲，婚姻宫逢冲，解了原局的酉辰相合，婚姻可以得到落实，但也表示婚姻比较动荡不安，且天干两个丙火争夺癸水，婚姻上有竞争，要多注意，地支酉戌相害，酉金财星受损，则花销较大，容易破财。
          36岁-45岁走的是丁亥大运，此大运天干丁火被地支亥水截脚，亥水中暗藏壬水，丁壬相合，丁亥暗合，有劫财夺杀的象，婚姻不太平，官杀混杂，会遇到其他男性来影响你的婚姻，要多注意，也要防止其他女性介入婚姻。此大运事业上竞争较大，阻碍大，要防小人，防口舌是非。
          46岁-55岁走的是戊子大运，此大运地支子水被天干戊土盖头，为食神制官的大运，天干戊癸相合，癸水正官星被合克，地支子未相害，伤官见官，在事业上要谨慎低调，容易与人发生争执矛盾，婚姻上容易对丈夫不满挑剔，发生家庭矛盾，也是要注意的。
          己丑大运，干支一气为伤官星，地支丑未相冲，把土冲旺，要注意脾胃疾病，伤官见官，要克服自己的性格缺点，防止口舌是非。
          庚寅大运，地支寅木被天干庚金盖头，天干乙庚相合，乙木寿元星被合克，身体健康很容易出大问题，乙木为命局最重要的用神，最怕被合克，而且此大运年龄也比较大了，容易导致大的灾难，要特别注意。
          一个人如果从小到大，遇到的都是好人，每个人都对自己很好，不是什么好事。一切都太顺利，当遇到一点困难挫折的时候，在别人眼里平淡无奇，在自己身上就会觉得天大的事，无法承受。人要经历点困难，经历坏事，才能成长。
          `
  }]
}

export default {
  酉时
}