const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   比肩   日元   正官',
  天干: '乙(木) 庚(金) 庚(金) 丁(火)',
  地支: '亥(水) 辰(土) 午(火) 亥(水)',
  遁藏: '食神   枭神   正官   食神',
  大运: '辛巳，壬午，癸未，甲申，乙酉，丙戌，丁亥，戊子，己丑，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/522.html',
    命主甲: `工作方面，我目前在上海的一家美容院工作，老板是我之前的领导，他辞职创业开的这店，向我抛出橄榄枝，跟我说可以考虑跟他一起做店，给我股份做合伙人。
          婚恋方面，男友也提出了求婚，希望我回广东，好安排双方父母见面商量婚事。我妈妈不看好不同意我和他在一起，她说之前找先生算过八字，说我男朋友脾气不好，怕我婚后会被家暴被出轨，怕我婚后经济上也吃苦。
          健康方面，爸妈和我，体质都较弱。我消化系统脾胃功能很弱。
          `,
    珠玑: `八字分析：庚金生在辰月，为偏印格，偏印格则不宜见食神，否则有夺食的风险。八字两个亥水食神，也不太弱，只是遇到岁运偏印旺的时候，食神不太好受。此八字财官高透无伤，而且日主合财，地支食神合官，是有一定富贵层次的。
          事业分析：庚金为矿石金，时干丁火贴身炼金为吉，日支午火虽可起到炼金之用，但也去生了辰土。辰土当令，地支亥水被制，辰为水库，亥水见辰有入墓之象，构成枭神夺食，思想受限，才华难以发挥出来，因此在事业上很容易错失良机。
          枭神夺食的组合，也代表人比较心事重重，思虑较多，做事瞻前顾后，想得太多而导致犹疑不决，容易心情压抑抑郁，不利事业的发展。
          年柱亥水生乙木，年干乙木正财，适合外出求财，到出生地的北方，东方，东南方比较旺你。天干两个庚金去争合乙木，构成比肩夺财，乙木本被庚金日主合入，但被月干庚金比肩妒合，暗示不能合作求财，很容易亏损或被坑骗。
          八字比肩夺财，枭神夺食，不建议去投资创业，很容易亏本破财，决意开店的话建议低投入，服务型，小成本经营为佳。
          八字有食神生财的组合，依靠过硬的技术来求财较好，美容也属于技艺，枭神得令，有民间技艺之意，从事美容行业比较适合你，天干正财和正官相随，能为他人打工较好，同时正官透出在时干上，也可以从事相关管理性质的工作。
          婚姻分析：婚姻宫为午火正官，正官在夫位，一般来说正官在婚姻宫代表会有一段较为稳定的婚姻，夫妻之间感情较好，相处比较融洽。
          八字枭神得令较旺，脾气有时候会有些古怪，想得多，敏感，多疑，在感情上很难全心全意的信任对方，遇事的时候缺乏主见，容易别人说一些，就听到心里，听风就是雨，也容易时不时怀疑，猜忌另一半，而不利感情稳定。
          子女分析：女命以食伤代表子女，地支两个亥水，月令辰土中暗藏癸水伤官，你男朋友八字日支为卯木七杀星，年干甲木正官星透出，甲己相合，正官合身，为儿女双全的命格，总体而言，女儿的缘分更强一些。
          你的八字时支亥水食神代表女儿，亥水空亡，且有枭神夺食的组合，辰土枭神临流霞，生育容易有障碍，怀孕过程不顺利，注意好定期检查比较好。
          一般来说，怀孕之后，不要频繁变换主卧，这样是不利于养胎的，同事最好不要搬家，家中的一些大件物品不要随意搬动，修造等，这些都不利于养胎，对于本身怀孕不顺利的人来说，尤其是要注意。
          壬寅年，地支寅亥相合，流年太岁合动子女宫，天干壬水填空食神，可以要孩子。错过明年就要等到2025乙巳年，地支巳亥相冲，子女宫逢冲，临驿马，有胎动之象，可以要孩子，但切忌2024甲辰年怀孕生育。
          健康分析：八字年支和时支亥水食神空亡，年支亥水食神有食道的意象，亥水被辰土枭神所制，枭神夺食，要注意肠胃消化方面疾病，平时要注意饮食规律，忌过热过冷刺激性过强的食物。
          时支亥水空亡，被辰土枭神所制，要注意泌尿生殖系统，妇科等方面疾病，逢兔年，狗年要注意母亲身体健康，逢蛇年要注意父亲身体健康。
          大运分析：20岁-29岁走的是壬午大运，此大运地支午火被天干壬水盖头，壬水食神透出，丁壬相合，壬水食神被合入门户，食神填空，子女缘分较好，可以考虑此大运备孕。但壬水去制丁火正官，很容易和丈夫不和，对丈夫不满挑剔，容易犯口舌，要多注意。
          30岁-39岁走的是癸未大运，此大运天干癸水被地支未土戳脚，天干癸水去冲克丁火，构成伤官克官，要注意婚姻家庭矛盾，多包容忍让对方，事业上也要注意口舌是非。乙木财星见未土则入库，午未相合，财库被合入，总体财运不错。
          40岁-49岁走的是甲申大运，此大运天干甲木被地支申金戳脚，此大运为驿马大运，比较奔波走动多，求财辛苦。也为比肩夺财的大运，甲木财星透天干，生正官，事业运不会太差，但申亥相害，亥水食神受损不吉，开支花销会比较多，求财需谨慎，也要注意肾泌尿系统，妇科疾病。
          接下来走的乙酉，丙戌大运，乙酉大运，天干乙木被地支酉金戳脚，为劫财夺财的大运，则要学会理财，不宜投资做生意，很容易破财。丙戌大运，天干丙火七杀星透出，天干运不从，而地支逢冲，印旺，烦恼多，顾虑多，容易郁闷，也要注意脾胃，食道方面疾病。
          对你现在来说，是人生的岔路口，一边是事业，老板想要留下你答应给你股份做合伙人。另外一边是想要和你结婚的男友，但是要离开上海，回到广东。如果两边都不想放弃，就意味着婚后要异地，但两地相距甚远，刚结婚长期两地分居也不太好。
          一个人，如果心中多疑，摇摆不定，那就很容易被他人的言语，动摇自己的想法。不论在婚姻还是事业上，不能盲目去信任一个人，也不能处处怀疑一个人，凡事要保持正见，犹疑和偏信都是执其一端，让你对事情失去正确的判断，给自己带来很多麻烦，学会中庸之道，那么人生才会平顺。
          `
  }]
}

export default {
  亥时
}