const 未时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '伤官   劫财   日元   枭神',
  天干: '丙(火) 甲(木) 乙(木) 癸(水)',
  地支: '申(金) 午(火) 巳(火) 未(土)',
  遁藏: '正官   食神   伤官   偏财',
  大运: '癸巳 壬辰 辛卯 庚寅 己丑 戊子',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/134.html',
    命主甲: `乙木女命伤官用印金水相涵，读书出色才能出众
          `,
    珠玑: `此造出生日日干为乙木，所以属乙木命，生在夏天五月，先看一下有什么特征：夏月火旺土燥，乙木者，夏如禾稼，禾稼皆枯，木气尽泄，非癸水滋培不为功。癸水有调和气候，换回造化之妙。故癸透有根，富贵可期；水得金生，源长流远。此为五月乙木之正用。
          现据上述之原由，检查下此命造配合得如何？只见真有癸水透出时干，可惜地支并无水根，反见坐未燥土，水力已减。幸得年支见有申金，金能生水，源长流远。喜水调候的问题基本上可解决。
          接着再看乙木身强弱的问题，因五月丁火司权，乙木见火，木气尽泄（木生火），最好地支能见有寅、卯之强根，和天干甲木之助力。
          现查地支不见有木之强根，反见巳午未三合火局，更泄木气。天干丙火伤官透出，幸见一甲木在乙木旁边，此谓“藤萝系甲”。乙木为阴木，性本阴柔，故喻为“藤萝”，甲木为大树，乙木缭绕甲木大树而长。如藤萝系松柏，必将大大增强了日干乙木的力量，弥补一下地支无强根的遗憾。
          如上见有癸水调候和生乙木，甲木之帮助乙木，使其不至身大弱；下见有申金发水源，使癸水源长流远，故此命亦算合格，但并不入上上之格。
          缺点是日主乙木地支无强根，巳午未三合火局透丙火泄气太过。用神癸水地支无水根，也无湿土，全靠申金生助；但申金受火局之克和阻隔，生水之力大减，使此命不能更上一层楼。
          女命伤官透出，有金水配合，读书出色，才能出众。辛金运生癸水有利，入读名流大学；庚运同样有利，出外留学。毕业后长期在国外从事教学、研究、媒体工作，及参与各级竞选活动等，得助于大运走东北木水之地。
          `
  }]
}

export default {
  未时
}