const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '偏财   比肩   日元   正印',
  天干: '甲(木) 庚(金) 庚(金) 己(土)',
  地支: '子(水) 午(火) 午(火) 卯(木)',
  遁藏: '伤官   正官   正官   正财',
  大运: '辛未 壬申 癸酉 甲戌 乙亥 丙子',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/136.html',
    命主甲: `哭泣淋淋反伏吟，不伤自己伤他人
          `,
    珠玑: `此造出生日的日干为庚金，所以属庚金命。生在夏天五月，火旺而烈，庚逢败地（即火旺克金，金衰败而身弱），首先考虑是用水调候的问题，其次身弱亦喜金生扶；况且夏月水值绝地，也需金生水以佐之。因此，在其余六个字中，要想成富贵命，水和金必不可少，也忌木火再多。
          现在用此原则来考察其余六个字，看合格到何种程度。首先看到年支有子水，月干有庚金，此二者可符合上述要求。接着看到日主庚金自坐午火，时支卯木，年干甲木透出，木可生火，这些都加强了月令午火的作用，属不利的因素。最后一个字是时干己土，己土可化旺火而生金，也是属此造中的喜用神。
          现在看到此造五行齐全，金水二行最需要的也有了，是不是就成富贵命呢？且慢，有不等于能起到该有的作用，还须分析它们的力量大小、位置、和冲克会合的作用后，看是不是对庚金日主真的有好的帮助。这就是算命师最困难的辨证取用神的工作了。
          先分别出二大阵营：以庚金日主和庚金日主所需要的五行为一方，有子水，月干庚金和时干己土；对立方则有地支二个午火，一个卯木，一个甲木。从数目上看四比四，似乎势均力敌，但说过许多次了，论五行强弱，不能单凭数目，其中有几大原则，
          首先是月令最重，其力占全局三至四成左右。同时它又是提纲，决定了这个八字中各个五行的旺、相、死、囚、休等的力度。
          例如同在地支的一个子水，一个午火，因为生在五月火旺之地，因而午火的力量就大于子水，因夏月火旺、水囚。如果生在十一月，地支同样是有子水和午火，则子水的力量就大于午火，因为冬月水旺、火死。
          现在看到子水和午火连在一起，便成“子午相冲”，因午火当旺，子水休囚，便火胜水败。更见到日支也是午火，加强了火的力量，子水受伤。有书说，二午不冲子，这不足可信，光从自然现象来看，就不成立，命理不外乎效法自然。
          先前说过，夏金火旺，急需水为用神，现子水用神被冲受伤，其力大减，可不是好事。又看到月干庚金喜神，地支无金根，且坐在午火位，火克金，其力也减；且与旁边的甲木相克（庚甲相克），两败俱伤。
          最后是时干己土，也是被坐下卯木克制。于是可看到，以庚金日主一方的喜、用神全都被冲或克，忌神火木势力强大且包围了日主，双方强弱不成比例，木火胜，水金土败。结论是用神无力，格局配合无情，那就是一个不合格的不好的命。
          假如到此为止，大不了是一个一生一事无成，奔波劳碌的辛苦命。还有不好的是，此命四柱内有二柱是天克地冲，即甲子与庚午，庚甲相克，子午相冲，命学上叫“反吟”。又有两柱天干地支是相同的，即庚午月，庚午日，命学上叫“伏吟”。命书云：
          “哭泣淋淋反伏吟，不伤自己伤他人”。
          命中有一组反吟相当于命中有一条裂痕，有一组伏吟等于有一层共振，此命两组都有，这是指命局结构极不稳定，随时会发生意外。日后如果再遇到一个大运或流年与命中干支再次有反吟或伏吟时，便会命运解体，发生不测之灾，意外身亡，家人还不哭泣淋淋吗。此造应验在中年凶死。
          `
  }]
}

export default {
  卯时
}