const 申时 = {
  公历: [{
    甲: '1996-03-11 16:10:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   偏财   日元   伤官',
  天干: '丙(火) 辛(金) 丁(火) 戊(土)',
  地支: '子(水) 卯(木) 未(土) 申(金)',
  遁藏: '七杀   枭神   食神   正财',
  大运: '庚寅，己丑，戊子，丁亥，丙戌，乙酉，甲申，癸未，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/360.html',
    命主甲: `2018年考研上岸，顺利读研。2021年正式毕业，然而，在即将毕业的时刻，我不知道我该何去何从，想在今年2020年11月份考个国考试试。
          事业之外，我对于自己的爱情姻缘方面也十分迷茫。我个人比较喜欢那种积极向上阳光的男孩子，希望自己未来的另一半有让我崇拜的点，并且他上进，绅士，温柔，对于未来有明确的规划。
          在2014年以前家里面的经济状况一直很稳定，但是2014年以后由于父亲想要下海创业，辞去了国企的工作，母亲用家里的全部积蓄去支持父亲，当时也是赶上大环境经济形势严峻，不仅积蓄全部赔了进去，现在家里面依旧负债累累，
          我想知道我家里面的经济状况什么时候能够扭转过来，虽然现在依旧负债，但是父亲母亲也没有萎靡不振，依然积极乐观面对生活，我想知道我父母的未来发展状况，我现在也很迷茫，现在还在念书，想要帮助家里改善，但是心有余而力不足。
          `,
    珠玑: `八字分析：丁火生卯月为偏印格，偏印格喜欢伤官为伤官配印，偏印格喜欢偏财制约以保护食神，偏印格一旦成格是非常厉害的。你的八字偏印没有透出天干，时上透出伤官也有伤官配印的意象。卯未合，卯木克未土，偏印夺食不喜。申卯合为财制印，不过申金隔得远了一点，已经是人生后半段体现出来的意象了。
          天干丙辛合水官星，劫财合了偏财，劫财根在未土，代表自己赚钱的手段，也代表朋友合伙赚钱。但这里的劫财有点矛盾，可喜可不喜，本来辛金制约卯木偏印，丙火却来合了辛金化为官星，官星又能制劫财，还能形成官印相生的好组合，过程曲折错综复杂。
          事业分析：丁火日主且月令为卯木印星当令，也代表有思想，有想法，丁火日主周围是食伤，且伤官生财，说明还是比较聪明的，也比较积极上进，有事业心，独立自主，有经济观念，但也容易急躁，急于求成。地支枭神夺食，也代表有时候容易纠结，矛盾，踌躇不前，有些患得患失。
          年干透出丙火被子水戳脚，力量不是很强，月干透出辛金偏财，但被年干的丙火合克，同时辛金坐下卯木，辛金偏财的力量不强，同时偏财被克，也代表钱财的破耗，属于有投机风险之心，但没有什么偏财运，不要侥幸冒险去博取偏财。而地支卯木偏印和未土食神，卯未合克，在事业工作中一些大的事情，要注意预防过失失误，以及一些投资方面考虑不周而导致破财。
          好在八字日柱，时柱火土金相生，八字金得土来生助，所以命里还是有一定财富的，且八字以正财为主，八字原局虽有瑕疵，结合走的大运来看，总体在小康偏上到中产左右。
          八字食伤生财，且八字正财在时支，正财得生助，代表财运整体上还算稳定的，食伤财星为喜用神在日主周围，对你的事业发展也是有帮助的，可以往国企事业单位发展。考公务员的话，你目前走的是伤官运，公务员方面不太适合，即使去做了公务员，也只能是基层发展。
          今年庚子运，八字伤官生财，财生七杀，而明年太岁土金相生，如果想考公务员的话，这两年可以去把握下，考试运相对旺些。食伤主技术技能，代表文化教育，策划设计，金融财经方面，也可以往这方面发展。
          婚姻分析：未土为婚姻宫，婚姻宫为喜神，但月令卯木为偏印，日支未土食神，枭神夺食，婚姻宫被克，导致婚姻宫的状态不好，丈夫对你的帮助也打了折扣。另外，子未相穿为七杀穿夫宫，可能会因为一些烂桃花影响婚姻稳定。
          印星也代表家里长辈等，感情容易受到父母长辈的干预。八字年支为七杀也是桃花星，为桃花煞，且年干丙火为劫财，也容易遭遇桃花劫，是要注意的，在感情相处中大的金钱来往要谨慎，八字逢劫财和伤官有点克婚姻，要注意第三者插足，婚姻组合整体一般。
          你目前走的是戊子伤官加七杀大运，感情是不稳定的，也代表对感情会有些理想主义，完美注意，眼光会高一些，但不容易遇到你理想中的对象，要预防被烂桃花的表象迷惑，受到感情伤害。到2022年太岁正官星出现时，太岁为尊，可合日主有点桃花机会，但不太旺，可以把握下，错过的话在2029年食伤生财，财生官的时候了。
          对象身高一般，家庭经济条件还可以，对你的帮助不大，体型结实，有些国字脸，肤色微黄，眼睛不是太大，有些细长且较为有神，鼻梁挺直有肉，嘴唇微厚，短发，身高大约在175厘米左右，看起来比较的有精神。为人积极上进，办事周到，敢做敢当，不服输，但也比劫固执，自尊心强，有些小聪明和心计。
          大运分析：23岁-32岁走的是戊子大运，此大运天干伤官为财源，地支七杀力量增加，杀印相生，对你的事业发展有帮助，但同时开支花销也比较多，而与月令相刑，要注意人际关系方面问题。
          大运伤官加七杀，虽然有结婚的运气，但也容易遇到烂桃花，要注意，同时情绪方面不稳定，对感情上会有些落差，而导致不合的争吵矛盾，且容易矛盾激化，而影响到婚姻，要注意调整情绪。
          33岁-42岁走的是丁亥大运，此大运天干丁火被地支亥水戳脚，丁火比肩力量被削弱些，竞争不那么大，而地支官印相生，事业发展进步和提升，而地支印星力量增加，也会比较的辛苦忙碌，付出多才有收获。大运地支见正官，感情运表面还可以，但要特别注意提防其他女人干扰。
          丙戌大运为劫财甲伤官的运气，劫财被伤官泄，力量不强，属于利大于弊的运气组合，但地支未戌刑，还是要注意下人际关系，同时容易急躁烦躁，而得不偿失。感情方面也不太平稳，容易有争吵的矛盾及其他女人插足导致婚姻危机。
          乙酉，甲申大运，大运财星力量强，天干为印，属于忙碌付出的运气组合，整体一般稍好点，发展进步来之不易，整体晚年生活还算可以。
          你的八字属于明显的伤官生财的组合，只是年干见劫财合克偏财不化，不过劫财力量不强，虽然对八字组合有些阻碍作用，但不是非常大，适当注意小人竞争和做好相关即可。
          而地支枭神夺食的组合，有时候容易纠结，矛盾，患得患失，而影响到个人状态。同时预防考虑不周而破财，特别是重大事情方面三思而后行，防止过失发生。
          八字日时柱食伤生财，且八字伤官星，财星无伤，所以整体事业会有所成，且结合大运走势看还可以，不算太差，个人的经济生活水平比普通人会好很多，格局层次虽然不会太高，但也不会太低。
        `
  }]
}

export default {
  申时
}