const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1998年三月初三亥时'
  }],
  十神: '正官   正官   日元   比肩',
  天干: '戊(土) 戊(土) 癸(水) 癸(水)',
  地支: '寅(木) 午(火) 巳(火) 丑(土)',
  遁藏: '伤官   偏财   正财   七杀',
  大运: '己未，庚申，辛酉，壬戌，癸亥，甲子，乙丑，丙寅，8岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/408.html',
    命主甲: `家里条件差，父母离异。自己没学历没本事。感情不顺。恋爱谈的时间都短。难遇到合适的人。容易被劈腿。
          工作上也是做的比别人多，拿的比别人少。感觉郁郁不得志。我自认我心地也算善良也不干伤天害理的事。为什么我的生活如此糟糕。
          `,
    珠玑: `八字分析：癸水生于午月，为偏财格。地支寅、巳、午，木火很旺，官杀也旺，丑土湿土是日主的生存寄托。
          天干戊癸合，首先月干与日干戊癸合，年干与时干距离远合有型而无实，地支火被丑土泄气，导致戊癸合而不化，难以形成化气格。
          所以“双戊双癸火中行、一生定是富贵命”这句口诀对你是不适用的。你的八字还是以五行生克来定八字格局层次，八字癸水日主明显偏弱，喜生助的金水为用神，以木火土为忌神。
          事业分析：八字年月为正官，同时地支财旺生官，官旺克日主，年月可以代表祖上为忌神，说明出生家庭条件不太好。
          八字身弱，财旺官旺，且官杀混杂，而财代表是物质欲望，代表你渴望获得钱财，有理想和追求，但身弱不能很好驾驭钱财，容易眼高手低。
          而八字官杀旺克日主，说明你欲望大，但胆子不大，做事相对的踏实保守，个人的能力也有限，交际能力一般，有时做事的效率也不是很高，缺乏一些恒心，容易博而不精，同时自己也有些固执，虽然能埋头苦干，但不够注重些方法，缺乏灵活性。
          你的八字官杀旺为忌，没有金水印比帮扶癸水日主，官杀代表为压力，同时也代表小人，有时候容易急躁，静不下心，同时八字中月令午火，日支为巳火，消耗日主癸水的力量，且财生官杀，属于忌神生助忌神的组合，财星起到不好的作用，对你事业发展是不利的，容易因为钱财辛苦奔波忙碌。
          八字中印星不显，虽然时干透出癸水比肩，但癸水本身不旺，八字财旺官杀旺，且身弱难以担起财官，做事阻力阻碍会比较多，有时候比较的无助无奈，八字原局层次不高。
          结合大运走势看，一路走的是正偏印，比劫运，对你的发展有些帮助，只是八字财旺地支克合印，天干官旺克制比劫，组合也不是很好，属于一般好点的八字，发大财就不要想了。
          你现在走的是庚申大运，八字官印相生，但大运与八字三刑，对你的运势发展是不利的，要到辛酉大运，三会印局，2028年官印相生的时候运势会稍微平稳些，且最好是脚踏实地，踏踏实实，戒骄戒躁，不能急躁，急于求成。
          婚姻分析：你的八字婚姻宫巳火正财本吉，但寅已相刑，且巳火正财生七杀为忌，说明妻星和婚姻宫都没有起到有利作用，妻子对你的帮助不大，和另一半关系也不太好。
          八字官杀混杂，官杀的元神为财星，官杀旺克日主，也说明妻子对你的管束要求会比较多，对你会有些不满，也容易滋生不合的争吵矛盾。
          而八字月令为偏财，刚好又是桃花星，且桃花星在前，正财在后，所以你会先遇到些烂桃花后才会遇到比较好的感情姻缘。
          同时八字身弱财旺，也代表你难把握驾驭住感情桃花，再加上戊癸两两争合日主，有时对象很容易被人合走的，选择了别人，而不是选择你，感情婚姻不是太和谐稳定。
          你现在走的是庚申大运，大运与八字寅巳申三刑，婚姻宫带三刑，大运对你婚姻来说不太友好，只能在一些流年把握下。
          此大运八字官印相生，印星生助日主，使得日主得生助，才有能力去把握住感情。2020庚子年，太岁与大运金水相生，子水又为日禄的时候，可以化解三刑，对日主帮扶力量也相对较大，有些桃花机会，好好把握的话在2021年有结婚运气。错过的话要多等八年，到辛酉大运，2028年地支巳酉丑三合印局，去杀留官八字流通的时候结婚。
          对象身高中等，身材不错，身高在162厘米左右，方脸，肤色有些红润，眼睛大而有神，人中分明，嘴唇不厚，牙齿不是太整齐。为人比较现实主义，经济观念强，事业心重，有些固执，做事利索，脾气大，喜怒表现在外，做事急躁，能力稍强。
          大运分析：18岁-27岁走的是庚申大运，此大运大运正印生助日主，天干官印相生，八字流通对你事业求财有些帮助，但是印星也主辛苦忙碌，一分耕耘一分收获，会感到有些疲劳，疲惫。地支与八字寅巳申三刑，组合上不是太理想，容易遇到困难和阻碍，人际关系有时不太理想。总体来说此大运有些提升，但提升幅度不大。
          28岁-37岁走的是辛酉大运，此大运与八字巳酉丑三合印局，八字官印相生，对你的事业求才有帮助的，遇到的问题和阻碍，也能得到好的解决，同时能获得长辈领导的帮助，属于辛苦付出努力，能有相应的发展收获的运气，财运也会获得增长，但整体还是忙碌付出，辛苦求财的运气。
          壬戌大运，劫财帮身帮扶日主，但地支七杀旺，且八字寅午戌三合生助财官杀，所以此运势不太理想，支出开销多，压力也不小，发展缓慢。
          癸亥大运，比劫帮身对你的事业求财有帮助，且天干戊癸合拌正官，地支巳亥驿马相冲，又是冲财星，所以属于有好有坏的运气，也有外出走动奔波忙碌的信息。
          甲子大运为伤官见官的运气，地支子午冲，属于口舌是非争吵多，地支财逢冲，财来财去的不稳定，晚年运不太理想。
          整体而言你的八字并不适用“双戊双癸火中行、一生定是富贵命”这句断语，属于是身弱的八字，财旺生官杀，日主身弱而难以把握住财官，事业发展会比较被动，也较辛苦忙碌，付出多而收获少，花销也不少。
          大运对你发展虽然有些帮助，但大运和八字组合不太理想，整体格局层次不高，没有大富大贵，属于较为普通的辛苦忙碌求财的格局，脚踏实地为好。
          `
  }]
}

export default {
  丑时
}