const 子时 = {
  公历: [{
    甲: '1996-02-04 23:05:00'
  }],
  农历: [{
    甲: '一九九五年十二月十六日子时'
  }],
  十神: '偏财   枭神   日元   枭神',
  天干: '丙(火) 庚(金) 壬(水) 庚(金)',
  地支: '子(水) 寅(木) 申(金) 子(水)',
  遁藏: '劫财   食神   枭神   劫财',
  大运: '己丑，戊子，丁亥，丙戌，乙酉，甲申，癸未，壬午，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/362.html',
    命主甲: `关于事业：2018年毕业，毕业至今工作情况一直不算太好，比较迷茫，尝试过很多工作都不太稳定，去年下半年方向才比较明确，从事教育行业，在补课机构里做数学老师，不过今年受疫情影响，也有小半年没有工作，
          2020年6月份换了一个新的单位，也是做数学老师，不过不太如意没有做太久，目前就是做家教，来回奔波，因为工作的事家里人也跟着我操心，劝我不要再从事这行了，
          最近自己也不太有信心从事这个工作，想问下我是否适合这份工作，坚持这个教育行业的工作能取得什么样的成绩，还是适合自己做生意，自己对工作这方面比较焦虑。
          关于感情：都说我的八字适合晚婚，而且感情也不太顺利。
          `,
    珠玑: `八字分析：壬水生于寅月为食神格，现寅中甲木食神遭到申金中庚金克害，食神格遇偏印自然是八字中最大的毛病。寅中丙火本可以制约偏印，但自身力量太弱，又遭到子中癸水克制。
          两个子水为阳刃，对女命婚姻来讲也不是有利的东西，阳刃遇到偏印，性格上会有一些刚强极端的表现，综合大运来看，还是适合当老师，或做个技术类的工作。
          事业分析：你的八字食伤，财星为喜用神，月令提纲寅木食神为用神，月令的量是大的，力量上不弱，但是寅木食神被庚金枭神盖头，同时地支又有申金枭神冲克，对寅木食神是不利的，虽然有子水半合申金，可以起到缓解寅申冲，但是半合水，也加强了劫财的力量，整体食神力量是比较弱的，八字身旺，食神被克制，加上枭神夺食，也容易有闷闷不乐，不得志，能力发挥不好之象。
          同时年干丙火财星虚透，但无根，食伤不旺，也不透出，财星得不到好的生助，说明命里的财运是不太旺的。财星虚透克印星，说明有些上进心，但很多时候是因为不满足，且有些眼高手低。
          八字身旺，带两个阳刃，为人会有些执拗固执，脾气大，容易偏激，刚直，在一个地方工作一段时间后容易无形中得罪人，遭别人讨厌记恨，也容易给你使绊子，阻碍你做事，对你有不好的影响，而八字印旺比劫旺也是竞争大之象，地支驿马冲而逢合，也代表工作辛苦，奔波走动的信息。
          八字喜用神力量不太旺，食神被为克，财星虚透无根，八字原局层次不高，但大运走势来看，后面走的是财食伤大运，对事业求财是有帮助的，只是地支走的不太好，能够有发展提升，但来之不易，且提升幅度不大，整体命运组合普通偏上到小康的水平。
          八字金水为忌，月令寅木食神，且财星透出，月令为用神是食神，代表技术技能，同时也主教育文化培训，教育行业是适合你的，只是食神被盖头，加上没有透出，所以发展过程会遇到不少困难和阻碍，八字月令为食神，逢冲但被解冲，自己坚持努力的话，还算可以在这方面获得些收获。
          八字财不旺，而印旺，财不能破印，个人才能难以得到好的发挥展现，其他也可以从事火的喜用神行业作，如互联网相关，化妆美容，摄影广告等。
          婚姻分析：申金婚姻宫为忌神，且透出在月干和时干，围在日主周围，对象的出身家庭条件不是太好，同时八字夫星不显，对你的帮助也不大。而印旺比劫旺，也说明会比较名单多疑，性格脾气也不小，有些急躁，对感情相处有不利影响。
          地支两个劫财，婚姻宫又与劫财半合比劫局，对你的婚姻是不利的，感情竞争大，你看的上往往是名花有主，或有其他选择，而你不那么占优势，容易被第三者插足。
          八字夫星弱而不现，且印旺为忌透出泄官星力量强，感情运不强，对感情也有些被动，婚姻难落实，属于晚婚的八字。夫星不显，且婚姻宫先冲后合，所以你的感情多是通过其他人介绍认识，需要些外力介入。、
          你的结婚，要到克制忌神印和比劫的时候，才比较有利，也容易把握些。虽然2021年官印相生，夫星出现，丁亥大运，丁壬合有点机会，但地支亥子丑，水土相混，而水旺，是较难以把握的。要到丙戌大运，丙火克忌神印星，地支戌土克劫财的时候结合运旺些，比如2027年财生官，地支劫财被克的时候。
          对象脸型方正，肤色微白，五官端正，眼睛不大，有些细长，单眼皮，鼻尖肉多，看上去有财气，嘴唇不厚，身高一般，有174厘米左右。
          大运分析：21岁-30岁走的是丁亥大运，此大运丁火财星虚透与丙火增强财星力量克印，事业财运不是太旺，虽然有收入但不高，也容易烦躁，对工作不满。同时地支比肩旺，竞争压力大，地支寅亥合，也代表自己会比较忙碌付出多，容易招惹小人，发展缓慢被动，属于辛苦求财的运气，到2024年时会慢慢好转。大运丁壬合，地支申亥穿，有些桃花运，但不那么好把握。
          31岁-40岁走的是丙戌大运，丙火坐戌为财库，丙火力量增加克庚金力量强，同时地支戌土克子水结成力量也不小，此大运比上一个大运好些，属于发展收获的运气组合。同时此大运有结婚的运气，只是个别年份要注意感情不和谐，以及第三者插足，比如2031年-2035年。
          乙酉，甲申，食伤加正偏印的大运，大运天干食伤生财，与年干财星相生，对你的求财有帮助，只是地支印旺，所以难免会遇到困难阻碍，以及一些琐碎事情，同时也引动驿马，奔波走动会比较多，运势有利有弊，要注意金水旺的年份不太好。
          你的八字身旺印旺比劫旺，喜食伤泄秀生财为用神，虽然食神在月令，但食神被克，而且没有透出，力量不旺，财星虽然透出但地支无根，食伤和财星也没能直接流通相生，八字原局组合不太好。
          好在大运走势还可以，丙戌大运比较有利，可以好好把握，多努力，能有所发展收获，可以达到小康左右，而其他运势有利有弊，晚年运也较普通。
          你毕业到现在，时间长，却换了不少工作，6月份到现在也只有3个月不到，又换了一份工作，任何工作都是需要时间积累，不是一蹴而就的，就算是了解工作流程，了解自己产品，行业情况都需要时间，你现在需要的是有个清醒的长期的职业规划，而不是做什么工作能有成绩。
          任何一份工作，只要坚持不下去，就不会有任何成绩，工作中遇到的困难和问题，要勇于去克服，多和自己的前辈领导请教，怎样做更好，多吸取经验教训，职场上的很多问题都是相似的，换工作只是一时的逃避，在新的工作中还是会遇到相似的问题，要多从自己身上找原因。
        `
  }]
}

export default {
  子时
}