const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '比肩   正财   日元   比肩',
  天干: '戊(土) 癸(水) 戊(土) 戊(土)',
  地支: '申(金) 亥(水) 寅(木) 午(火)',
  遁藏: '食神   偏财   七杀   正印',
  大运: '丁巳 戊午 己未 庚申 辛酉 壬戌',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/120.html',
    命主甲: `地支一炉火成就富贵命，五行顺生四柱流通
          `,
    珠玑: `此造出生日的日干为戊土，所以属戊土命，生于冬天十月亥水当令之时。这已经是连续介绍第三个生在冬天的八字了，为的是巩固调和气候取用神的学习法则：冬天出生的命，首先必须命中喜见到有火，无火则为下格，除非一些能入特别格局的命。
          那么八字中有了火，是否就万事大吉了，就是好命了呢？非也，有了火，只是合乎了调候这一节，能否成为好命，仍将重新开始，和一般八字那样重新批算。也就是说以日主和其他财、官、印、食伤、比劫等比较，看其间的生克制化、刑冲会合如何，才可定夺的。
          所以，冬天出生的命，虽喜见到有火，但不一定就是以火为用神，火只是在八字配合上用作调候之需要，是否真的就以火为用神，仍需看日主的强弱，和其它五行的生克关系而定。例如有一命造出生在冬天，但命中八个字配合上已经火很多，又有强木来生火，明显木火过多，就显然不会是取火为喜用神了。所以要明白冬令喜火为用神此话内的二层意思。
          现看此造，戊土命生冬天十月，亥水当旺之时，水旺当然土就弱了，且寒水冻土，日主又冷又弱，是此命一出生时就先天带来的主要特征。现在再看它周围环境，看能否有解决这二个特征的因素，能解决得好，就是好命。解决得不好，就是坏命。
          日主戊土自坐寅木位，木从下向上克土，使日主更弱，无助力。月柱癸亥上下皆水，有如屋漏更兼连夜雨。且寅亥合木，水变成木，加强了木的力量来克土，更不是好事。
          年上戊土申金，戊土帮身，且戊癸合，虽不能化火，只求两失其用，舍身救主，挽回半局。为何只说半局，因戊土坐申金位，早已泄土气去生金，加之冬令水旺土囚，故此戊土实只得三分力。而地支申金得天干戊土之生，反成了七分金力，用此金力又去生旺月柱癸亥水，真是行船偏遇顶头风了。
          至此为止，八个字已分析了前面三柱六个字了，好像仍看不见有解决日主戊土又冷又衰这二个难题。不过，大家不要灰心，前面分析过的很多命例都曾是这样，在最后的时刻（时柱），临门一脚，扭转乾坤，反败为胜。就像一场精彩的足球赛那样，未踢到完埸最后的一分钟，仍不能轻言胜负的。例如前一段时间，台湾中华男足在亚洲杯资格赛对上劲敌巴林，在比赛的最后，靠着3分钟内连进两球，最终以2比1逆转击败巴林。
          现在看下这个命是否也能在最后关头，连进两球，逆转败局。
          时柱是戊土午火，这个戊土可不等同于前面年柱的戊土，因前面年柱的戊土坐申金位，早已泄气（土生金），只得三分土力。而后面时柱的戊土，坐午火位，午火能生旺戊土，十分土力也不为过。且午火又是日主戊土的阳刃，即是最旺的地支，得此最旺的地支的支持，其戊土日主自能起死回生，足以解决日主先天就弱的问题了。且午火同时又能起到调候暖土的作用，一物两用，何其妙也。
          午火中内藏丁火、己土，丁火为炉中火，有土围住，等于燃烧着的炉灶。至此为止，可说已进一球，使得日主戊土既弱又寒的问题基本得到解决。但与前面三柱金、水、木的力量相比，仍是有差距，不足以抗衡。
          有人可能说，三戊土加一午火，对决一金二水一木，四对四，不是刚好势均力敌吗？以前说过，判断日主的强弱，不能只是数五行的数目，因为每个字在不同位置、不同的月份及与左右上下的关系等因素，都会影响到它的力量大小的不同。就如上面分析过，同一个戊土，年柱戊申与时柱戊午，这两个戊土虽同在天干，其力度就大相径庭了。
          原则上，地支中的力量比天干重，地支中又以月支为最重，再加上春夏秋冬四时的影响，如同一个癸水，在冬天出生的八字中就最旺，在夏天出生的八字中就属衰。更有天干的生克制化、地支的刑冲会合等关系，都会改变着原来每个字的力量的。
          现在看到申、亥、寅全在地支位置中，且占据了月支最重的位置，又时值冬令，水最旺，火最衰。再看到有寅亥合木，旺水去加强了木的力量，综合一切，便不难看出局中水木金的力量胜于火土的力量了。
          此时已到临终埸最后一分钟了，忽看到午火在寅木旁，寅午可半合火局呵（寅午戌三合火局，寅午、午戌可半合火局）。如此一来，寅亥合木中加强了的木，因为刚巧碰到了午火，便可合化成火，使得这地支的一炉火，能得到源源不断的寅木支持，不断地燃烧着，不用担心燃料之不足了。于这个得寅午半合火局，便成了在最后关头，踢进的第二球，终能逆转败局，成就了一个富贵命。
          为什么有了这地支一炉火，就能成就一个富贵命呢？现再用六神的关系来分析：自己是戊土命，生在冬天，既身弱又寒冷，但还要去泄耗精力去发挥能力（土生申金），去赚取钱财（申金生癸亥水），命中看出钱财会很多（十月癸亥水旺），但这么多钱财是要用自己的命中的福德去交换的，如果命中福德不够，这么多钱财非但赚不成，反会成为你的祸害。易经中不是说过：君子以厚德载物；又说：吾闻之，唯厚德者能受多福，无福而服者众，必自伤也。
          现这生在冬天的戊土命，又冷又弱，显然不具备这种厚德，不能载这么多的财物。况且财旺（水多）又再去生官（寅木），即一个人有了钱，就想做官（寅木），但做官是有责任要承担的，如果身体太弱，没有这么大的福德时，这时官就会变成鬼来侵身。所以，经常看到有些八字中偏官（七杀）太多，但无化解，或化解得不好，日主承受不了时，往往就是些患恶性疾病（如胰腺癌）的人。如果此造缺少了时支午火，也就会成为这种命了。
          但现在有了午火，且寅午半合火，这样一来，整个八字就能流通起来了：即日主戊土生申金（才能发挥），申金生癸亥水（发挥才能去赚钱），癸亥水生寅木（财旺生官），寅木生午火及寅午半合火（官印相生），最后午火生日主戊土（印生身），将前面所有的发挥才能赚取大量钱财，再得到官职等，全部收归自己所有，从而成为一个有厚德能载物，厚德者能受多福的命了。
          大运喜火、土，忌金、水，地支木运有午火化木生土可行，天干克土不利。早运北方水木之地（甲子乙），仅小学毕业就出来工作。丑土运自立创业，后经几十年的火土运，创业成功，成就一富贵命。
          `
  }]
}

export default {
  午时
}