const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   比肩   日元   正印',
  天干: '戊(土) 壬(水) 壬(水) 辛(金)',
  地支: '戌(土) 戌(土) 戌(土) 丑(土)',
  遁藏: '七杀   七杀   七杀   正官',
  大运: '癸亥 甲子 乙丑 丙寅 丁卯 戊辰',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/69.html',
    命主甲: `众煞猖狂，一仁可化`,
    珠玑: `此造出生之日干为壬水，所以属壬水命，生于九月（戌月），戌属土，秋末土旺用事，壬水受制，已属身轻杀（土）重。意思是壬水日干一生下来就身弱，因为月令戌土当旺，旺土克水，水当然弱。戌土（阳土）又是壬水的七杀星，阳土专攻壬水，所以称杀重。
          再看其他干支配合，年支、日支再是戌土，戊土又透出天干，成七杀格，且杀重身轻。至此为止，如不能入从煞格等特殊格局的话，那可是一个不祥之造啊。如七杀格歌诀有云：
          身弱杀强无制神，多生灾祸不堪论，那堪更入官强地，耽疾遭刑丧此身。
          此诀就是分析到上述为止的写照：壬水命身弱，土多且强旺，不见有木神制土，平生灾祸多多，这就不必论了。更不堪设想的是，如果日后再行土旺之运，疾病延绵或遭遇刑克，以至失去性命。这么可怕的命，还有得救吗？
          且慢，还有最后一柱，时柱还未看呢。
          此造时柱是辛丑，辛属金，丑为湿土，可生金，亦是金库。如此一来，前面众多的七杀（戊戌土），一见到辛金，便能土生金，化掉其七杀之凶性，金能生水，增强壬水日主的力量，起到“众煞猖狂，一仁可化”的作用。
          可见，此局便靠时支辛金高透，金库之援，便化解了前三柱土重克水的凶性，使一生能逢凶化吉，反败呈祥。当然，月干壬水也起到护卫辛金的作用，为喜神，可惜被戌土所伤，力量有减。
          此造喜金、水，忌火、土。虽然不是一个富贵之命，然可是个有福之命，可得福寿吉祥。
          命中不见食神、伤官、财星。食神、伤官指才能发挥，即看不到有发财致富的基因。虽有官星多个，然命中官多反而不贵，为忌神时，反指压力，小人多。
          全局最好的星为辛金印绶星，全靠它化解众多的杀星。所以印绶星又可看成是吉星，福星，能助日主，能逢凶化吉，反败呈祥。
          当印绶为喜用的人，往往是有福气的人，有贵人、时势的助力，犹其是日坐印星为喜用，且不被月、时两支冲破克合的话，往往是有福之人。
          办事能事半功倍，常得意外之助力，不用太劳碌辛苦的人。此造虽不是自坐印星，而印星高透时柱为喜用，时柱亦指子女宫和晚年，故二者皆佳，不失为有福有寿之人。
          `
  }]
}

export default {
  丑时
}