const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1993年八月二十九日辰时'
  }],
  十神: '正财   偏财   日元   枭神',
  天干: '癸(水) 壬(水) 戊(土) 丙(火)',
  地支: '酉(金) 戌(土) 辰(土) 辰(土)',
  遁藏: '伤官   比肩   比肩   比肩',
  大运: '辛酉，庚申，己未，戊午，丁巳，丙辰，乙卯，甲寅，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/367.html',
    命主甲: `自小调皮，但也算聪明，不大认真学习也考得不错。但是爸爸在我小学10岁时就去世了，家里穷再加上无心学习，小学毕业就打工去了。家里我最大，有两个妹妹，弟弟最小。妈妈一人拉扯我们长大。
          叔叔是我的贵人，他是搞建筑工程的，专门承办政府工程，他就携带我，说结婚会给我买一套婚房，但我不敢要。我知道生活的不易，较懂事，很孝顺父母，长辈。大方不吝啬。没什么存款。算是比较宅。
          很少和异性接触，有些相亲对象知道我家情况，不看好我，没谈就结束。2020年现在接触着一个小学教师，比我大两岁。她，农历91年10月14日8点辰时。我和她有希望成婚吗？
          `,
    珠玑: `八字分析：戊土生在戌月为比肩，月、日、时三重比肩必然为分走部分福气，此命分的是偏财，偏财是众人之财，代表有钱大家赚，有合伙的意向。辰土为财库，戌土为印库，印库冲财库是有发财机会的。
          天干偏印有制，日主合正财，而且有伤官生财，说明你赚钱的欲望很强。而且合的是正财，戊癸合为老少合，未来妻子年龄大概会比自己小。
          事业分析：八字比肩旺，比肩生伤官，伤官生财，又有印星，为人是重感情的，有上进心，但也容易急躁心理，八字地支辰戌冲，库中杂气受伤，冲旺土，也代表比较踏实，但也有些老实，缺乏变通，同时八字墓库多，土重，喜欢安静，喜欢呆家里，虽然有伤官些比肩，但土太重，交际能力不太强。
          八字财星在年干，月干，年支伤官生财，同时可以泄比肩，代表命里是有一定财富的，八字财库逢冲，如果遇到好的运气组合，也有发财的运气，只是你早年走金运，那时候还没有出社会，好运走的太早，后面走比劫印运，属于忌神运，对你命运发展限制比较大。
          八字月令，日支和时柱又是比劫，印星，在工作上容易竞争压力大，同时比劫旺易克夺钱财，导致财星受伤，财运不太稳定，财来财去，没有太多的积蓄。
          八字土重喜泄耗，年干伤官生财，伤官主头脑和技术技能，如果有一技之长的话，对你的求财会更有帮助一些，可以考虑学一些技术技能，有一技傍身更好。
          婚姻分析：婚姻宫位辰土，而月令是戌土，辰戌冲，同时是指是辰土，辰辰自刑，婚姻宫为忌，同时又是财库，八字地支相冲比劫旺，辰土中的财星被冲伤，婚姻宫的状态不太好，有不利妻不利婚姻的信息。
          癸水正财为妻星在年柱，年柱癸酉伤官生财，辰酉隔合，中间逢比肩，代表阻碍，也说明感情竞争阻碍不小，婚姻落实会遇到比较多阻碍，能看上的往往有其他选择，而你不那么占优势。
          年柱为父母的宫位，同时妻星在年干，日柱与年柱戊癸合老少配，你的感情需要借助下外力才能落实，最好是找人介绍更好。
          辰土婚姻宫为忌，癸水正财妻星为喜，且癸水正财得生助 ，妻子出生条件一般，但婚后通过两个人的努力，经济生活水平可以改善，对你也有一定的帮助。
          但八字比劫旺婚姻宫逢冲，在己未大运，戊午大运的时候，增强了比劫力量，容易引导不利妻不利婚姻的信息，是要注意的。
          大运分析：23岁-32岁走的是己未大运，地支未戌三刑，比劫力量刑旺，天干劫财克财，钱财支出破耗比较多，没什么积蓄，人际关系也不太好，容易被人排斥。劫财大运，财星被劫，感情竞争大，感情不太顺，有机会也需要主动些，好好把握才有会落实婚姻。
          33岁-42岁走戊午大运，大运比肩透出戊癸合克，地支午酉破，财星被克，伤官逢破，财源被克制，而有比劫通过虽克不尽，但才有也是不太平稳的，比较被动，发展受限，特别是火土旺的年份运气不吉，而八字妻星被克，伤官逢破，有克感情不利妻的信息，同时容易导致婚灾发生。
          43岁后分别走丁巳，丙辰正偏印和后面的官杀大运，印运属于辛苦忙碌，付出比较多的运气组合，得到的发展回报不那么可观，属于辛苦求财求发展的运气，运势一般。晚年官杀运八字官印，杀印相生，运势一般偏好些。、
          你的八字年柱伤官生财，年干，月干虚透正偏财，八字原局还算有一定的财运的，但是比劫旺且逢冲旺，财星易被克，竞争大，财来财去不稳定。
          早年走的金运的还算可以，但好运走的太早，23岁后分别走比劫，印的忌神大运，对你的运势发展是不利的，只能把握下个别金水旺的流年，而遇到火土旺的年份要注意低调谨慎。
          `
  }]
}

export default {
  辰时
}