const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1992年十二月四日亥时'
  }],
  十神: '正官   正官   日元   偏财',
  天干: '壬(水) 壬(水) 丁(火) 辛(金)',
  地支: '申(金) 子(水) 丑(土) 亥(水)',
  遁藏: '正财   七杀   枭神   正官',
  大运: '辛亥，庚戌，己酉，戊申，丁未，丙午，乙巳，甲辰，7岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/340.html',
    命主甲: `家里是吉林德惠的，家里条件一般，我也不知道怎么回事，就是自从我2016年大学毕业之后，我挣钱之后，我家里就接连不断的出事，尤其是我妹妹，我工作到今年2020一点钱都没有剩下来，
          2017年她脑出血，手术，本来家里就没钱，我把我所有的钱都给家里了，还是不够，借了好多，好在手术很成功，我妹妹没有留下后遗症，然后家里一贫如洗了，努力挣钱。
          好不容易，眼看着妹妹要高中毕业上大学，我家这两年也缓的差不多了，日子要变好了，我妹妹又生病了，系统性红斑狼疮，我又把我的钱都给家里了，我妹妹也因此高考失利，选择了重新复读，
          然后我去年辞职在长春找工作，找了两个月，没有合适的，因为我之前在上海工作，我觉得我是一个努力的人，但是长春没有好的工作机会，然后在去年我重新回到上海工作了。
          但是我的感情也是很难，就一直单身，遇不到合适的，有的时候我自己好累好累呀，我特别想有个依靠，但是就是遇不到，我也不知道我是怎么了，就感觉这几年过的好难啊，差点得了抑郁症，但是一想到我还有家人，我不能懦弱，我要坚强。
          `,
    珠玑: `八字分析：丁火日主生在子月失令，八字年月地支半合官杀局，年干月干透出两个壬水克日主，整个八字的年柱，月柱全部是水，而且地支见亥子丑三会水局，丑土也被化为水，时干辛金也是生助水的五行，而日主丁火在地支无根，
          八字全部是水的五行，而八字透出两个壬水正官，代表八字官旺，日主不得不从了正官的气势。所以八字以从官格来论，那么从官格则以金水为用神，以木火土为忌神。
          事业分析：你的八字以财官杀为用神，以印比食伤为忌神，八字中财生官杀力量强旺，而日支丑土本为食神，但丑土为湿土，地支又逢旺水，所以丑土被化为水，所以八字喜用神力量是比较旺的，全局都是用神，对你整体事业非常有帮助。
          八字从官代表你具有正官星得特性，为人比较的正直，且积极努力上进，为人有正气和责任心，也比较的传统顾家，懂得照顾人，这样的组合只要你努力，大运走的好的话，可以获得事业发展成功。
          从格的八字一般比普通八字格局层次高，从格的八字看法和普遍的旺衰看法也不一样，但不是说从格的八字就百分百好，也要结合大运情况来看，你的八字原局虽然从，遇到大运流年组合不好的时候，容易出现不从的情况，简单说就是遇到大运流年容易导致格局变化，以至运势比较大的波动。
          你的八字属于从官格，喜财官杀为用神，且正官气势可顺不可逆，但非常忌讳见到克制官星的五行，也忌讳日主被木火生扶起来，这种就逆反了从官格的格局。所以当你走土运，木火运的时候，属于破格，对格局会带来比较大的干扰和阻碍，发展也容易受困。
          比如38岁走戊申大运及后面走丁未，丙午等大运的时候，容易出现反局，特别是丁未运时有明显破格的情况，代表你后面的运势容易有比较大的起落。结合大运走势整体来看，你的八字属于起伏比较大的组合，格局层次不算太好。
          婚姻分析：你的八字丑土为婚姻宫，婚姻宫被化为官星，日主从官。而女命以官星为夫，八字从官代表官星为用神，对你来说是吉的，同时正官为用，婚姻宫忌神被化为用神，也代表你会遇到不错的对象，且对方的家庭条件也不错，对你会有比较大的帮助。
          简单的说，你的八字是容易嫁到贵夫，但是八字正官旺同时透出，说明你对感情的要求会比较高，有时候有些完美理想主义，注重细节，正官旺代表你为人比较的传统，正派，宁缺毋滥，不放纵自己的感情和行为。符合你择偶要求的对象会相对较少些，婚姻来晚。
          你目前走的是己酉大运，己土为食神为忌神，好在大运地支酉金泄土，八字时干又逢辛金可化掉己土的力量，大运食神生财，财生官对你的感情发展是非常有帮助的，特别是在2020庚子年的时候，与大运形成土金水相生的组合，增加了八字喜用神的力量时容易遇到且有结婚信息。
          大运分析：28岁-37岁走的是己酉大运，此大运天干见己土食神不吉混局，但己土坐下酉金泄土，天干酉有辛金可泄土。所以此大运与八字作用后力量最终转化为金水的组合增加了八字用神水的力量。所以此大运对你的事业发展是较不错的，可以获得稳步的增长，也容易获得贵人的帮助，属于发展收获的运气。
          38岁-47岁走的是戊申大运，此大运天干见戊土透出的运气，土为高山之土，比己土厚而重，专克旺水，所以戊土有明显妨碍壬水的作用，且又是伤官见官的组合，属于逆局发展的运气，也是非常容易导致破格的情况。而大运地支申金泄戊土的力量，对八字有一定的帮助，
          天干辛金也可以泄日主的力量，对八字事业发展还是有所帮助的，但属于蕴含杂气逆局的气息，所以此大运比上个大运稍差些。也容易不稳定的波动，此大运宜谨慎低调些为好，凡事应三思而后行，不要招惹上些口角是非，属于有利有弊的发展运气。
          后面的丁未大运，比肩帮身，地支未土冲丑土犯局，而未土中也有丁火弱根。所以此大运日主得大运帮身有气，地支水土相克反局，此大运有破格不从之象，对你的事也是较为不利的。
          丙午大运和乙巳大运也是日主的生助的运气，也是破格不从的格局组合。说明中晚年的运气不是太理想，发展也会比较的被动缓慢，遇到的困难也较多，属于非常一般的辛苦求财运气。
          你的八字原局属于从官的格局组合，八字财生官杀，地支亥子丑三会官杀局，且透出官星，八字从官明显，喜用神力量也是比较大的，所以你有获得大发展的机。
          只是八字中五行方面有些偏枯，特在遇到生助日主或反局运气组合，非常容易破格，也就容易导致你的事业明显波动，难以平稳。而且中年走的刚好是生助日主的大运到晚年，所以你八字中年后以破格来论，后面的运势也不是太好，格局层次方面大打折扣，导致整体格局层次不高。
          `
  }]
}

export default {
  亥时
}