const 卯时 = {
  公历: [{
    甲: '1948-07-27 06:22:00'
  }],
  农历: [{
    甲: '一九四八年六月廿一日卯时'
  }],
  十神: '正官   七杀   日元   食神',
  天干: '戊(土) 己(土) 癸(水) 乙(木)',
  地支: '子(水) 未(土) 丑(土) 卯(木)',
  遁藏: '比肩   七杀   七杀   食神',
  大运: '庚申 辛酉 壬戌 癸亥 甲子 乙丑 丙寅 丁卯 5岁运',
  批注: [{
    作者: '中国周易文化学',
    出处: 'https://xw.qq.com/amphtml/20200124A066OS00',
    命主甲: `命主是个普通的农民，一生辛苦劳累，没有什么成就，并且一生病伤累累。
          `,
    珠玑: `日主癸水，仅仅是年子子时远根，坐下丑土里面有一点弱根，丑未一冲则毁灭，肯定是身弱！
          命格官杀混杂，戊己土在地支有丑未土，很明显身弱官杀旺！
          时柱有食神乙卯干支一气出现，力量也不弱！
          命格身弱，己酉官杀为忌神，也有食神出现，但是是否可以制杀化为权呢？
          月干己土七杀干支一气紧贴克日主，年干戊土也则是帮助月干己土；且日主之根远在年支，又被戊土直接盖头，地支子未相害紧贴，日主的力量被重重包围，急需解救！
          时柱食神呢?天干乙木与日主紧贴可以直接泄日主力，但与官杀戊己土则是隔柱，不能直接作用，或者说就算是天干主动，有跳跃式的发挥，其作用力也很小，完全不足以抵挡杀星的攻克！
          地支卯木与未土隔柱，就算是要半合相绊，中间也有一个第三者丑土插足，导致卯木无法克忌神未土。卯与日支丑土虽是紧贴，但是没有明显的生克关系，所以作用力同样有限。
          因此食神没有起到制杀救主的作用，相反却有盗泄日主的忌神效果。因此本造不是“七杀有制化为权”的贵命，而是一个普通命格。
          `
  }]
}

export default {
  卯时
}