const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   枭神   日元   正印',
  天干: '癸(水) 庚(金) 壬(水) 辛(金)',
  地支: '酉(金) 申(金) 子(水) 亥(水)',
  遁藏: '正印   枭神   劫财   比肩',
  大运: '己未 戊午 丁巳 丙辰 乙卯 甲寅',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/189.html',
    命主甲: `特别格局之从气格大富命，中年经营得利千钟
          `,
    珠玑: `此造出生日的日干为壬水，所以属壬水命。生七月申金当旺之时，壬水长生，金旺水相，水势已盛。
          再见日干自坐子水阳刃旺地，时支亥水归禄，年干癸水透出，日主绝顶身强。即天干壬、癸水，地支亥、子水，十天干、十二地支中，水这一行全都占有了。再看天干透出庚、辛金，地支见申、酉金，也同样是十天干、十二地支中，金这一行全占有了。
          整个八字中，金和水二行分别各占二干二支，且两者力量相等，不见有火土混局，全局气势在于金水，这样就构成了特别格局中的“从气格”（从金水之气），有如两神成像中两行相生偏强的格局。
          这“从气格”比起从旺或从强格中的只是一行得气，或从官杀、从财、从食伤等，仅以一行专旺为重心的，有些不同，与从势格必须三神并立或并强的也不同，从气格中的两神成像相生之局，必须两者各占二干二支，力量相等。行运都是顺从其旺的气势取用，
          在此造中就是喜金水，忌火土，木运如果不见命中有金冲克，见有水生木可行，命中有金冲克则不利。如命学先贤任铁樵说：“不论财、官、印绶、食伤之类，如气势在木火，要行木火运。气势在金水，要行金水运，反此则凶。”
          从气格中的两神成像的构成：是指八字中有二行，各占二干二支，两者力量相等；以五行生克而言，相生有五局，相克有五局。下面先讲相生的五局：
          （一）水木相生：不论是我生或生我之局，必须水木各占二干二支，两行势力均平，不见土金混局，方可适用。
          （二）木火相生：不论是我生或生我之局，必须木火各占二干二支，两行势力均平，不见金水混局，方可适用。
          （三）火土相生：不论是我生或生我之局，必须火土各占二干二支，两行势力均平，不见水木混局，方可适用。
          （四）土金相生：不论是我生或生我之局，必须土金各占二干二支，两行势力均平，不见木火混局，方可适用。
          （五）金水相生：不论是我生或生我之局，必须金水各占二干二支，两行势力均平，不见火土混局，方可适用。
          此造就是（五）中的金水相生之生我之局，行运皆喜顺其金水两行相生之旺神，忌克制旺神之五行。例如此造，早运南方火土齐来，克制金水旺神，未见有利，多滞难成。
          中年运入乙卯、甲寅东方木地，命中天干壬癸水化庚辛金之克而生木，地支亥子水化申酉金之冲而生木，才能发挥卓越，经营得利成大富。
          `
  }]
}

export default {
  亥时
}