const 戌时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   七杀   日元   七杀',
  天干: '丙(火) 丙(火) 庚(金) 丙(火)',
  地支: '戌(土) 申(金) 午(火) 戌(土)',
  遁藏: '枭神   比肩   正官   枭神',
  大运: '乙未 甲午 癸巳 壬辰 辛卯 庚寅',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/152.html',
    命主甲: `女命建禄格杀旺无制婚姻多事反复
          `,
    珠玑: `此造出生日日干为庚金命，所以属庚金命。生于七月，申金当旺，申金是日主的建禄，所以此造亦是“建禄格”。按照之前讲过，建禄格日主根通气旺，如果八字中再有二、三个字生扶日主的话，确定日主在此八字中属旺，则可以财官为用。
          现看此造地支有两戌土生金，以为身旺无疑，喜财官制金，使日主中和。现见天干透出三丙火偏官，地支有午火强根，虽不见有财星（木）生官，然三丙火值午火之根本身够强，不用财（木）生，也能制金，以为是官贵格，为佳命。
          其实是错了，这也是论命之难的原因之一，不能照搬前面例子已有的经验，而要以每个八字作重新具体分析。在此例中，因为地支有了午戌半合火局，天干三个丙火太阳透出，地支中两戌原来就是燥土，经此一合一晒（太阳日照），已成为焦土，焦土只能脆金，不能生金。犹如在一片炎热干燥的沙漠中躺在一块金属，天上三个太阳猛烈地晒它，这块金属被上晒下烁，其酷热几乎能将它熔化，这时还能说它身旺吗？
          可见，此造中日主庚金虽生建禄月，但仅占此“得时”一项，却“失地、失势”，失地是指地支午戌半合火局，燥土已化为火，即使原质未灭，亦变为焦土不能生金；全局四火二焦土，二金，故为失势，日主庚金由强转弱，仍喜湿土、金、水为用，忌木、火、燥土。
          此造最喜见湿土收火气而生金，水运理论上有利，然配合到八字上，天干行壬癸水运，遭命中三丙火回克，有运也行不久。地支行水运，又怕午戌半合火局而犯旺。其实行金运亦如此，遭命中过多的火回克，有利而不见利。所以说此造唯走湿土运最好，为格局不高之平常命。
          此造还有一个最大的隐患，就是天干三个丙火透出，丙火是日主庚金的偏官，偏官与正官同为克我（日主）之物，但正官为阳见阴或阴见阳，阴阳有和洽之情，故其管束多居善意。而偏官乃阳见阳或阴见阴，其势刚暴，深具压迫之力。譬如小人多凶暴无忌惮，若无礼法控制之，不惩不戒，必伤其主。所以说：有制谓之偏官，无制谓之七杀。
          在此造中，三丙火值根于地支午戌火局强根，且为忌神，不见有制，是为七杀。故经云：原有制伏，杀出为福；原无制伏，杀出为祸。此造显然是属于后者，即命局中七杀天透地载，而没有制伏，则必身受灾祸了。所以说，命中七杀太旺无制化，七杀攻身太过，日主不堪克伐，不是贫病交逼，即是凶祸惨败了。
          而且女命以官为夫，天干、地支官星太多，明暗夫多，对女命也不是好事，婚姻多事反复，难以长久。
          早年木火运不顺，须到癸水运稍有利，唯命中三重丙火，仅如乌云遮日，其中的甲寅、乙卯年，财生杀旺攻身，第一次离婚。壬辰湿土水运有利，曾旅游世界，唯到丙寅、丁卯木火流年不利，又第二任丈夫病重。
          `
  }]
}

export default {
  戌时
}