const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1994年七月初四辰时'
  }],
  十神: '七杀   偏财   日元   枭神',
  天干: '甲(木) 壬(水) 戊(土) 丙(火)',
  地支: '戌(土) 申(金) 辰(土) 辰(土)',
  遁藏: '比肩   食神   比肩   比肩',
  大运: '辛未，庚午，己巳，戊辰，丁卯，丙寅，乙丑，甲子，癸亥，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/431.html',
    命主甲: `从小就和妈妈我对着干，大了我觉得她在北京工作一个人也挺难的，所以我都忍着。我和她爸爸一直想让她回吉林老家考个公务员之类的，有个稳定的工作，找个对象过一生挺好的，但是姑娘就是不同意啊，一谈到这个问题我就憋气窝火。她也不愿意搭理我。
          听说她自己也时常趴在被窝里哭，当妈的非常心疼她，但是说不到一起。
          她从事财务工作，所以从去年开始考证，去年由于疫情取消考试了。今年又报名了。去年年末又换了工作。勉强够自己生活。对象也遇不到合适的，想把证考到手后离开北京找个二三线城市发展，总之很彷徨。
          `,
    珠玑: `八字分析：戊土日主生于申月，为食神格，月干透出偏财，为食神生财。而且，戊土座下为辰，辰是财库，时支也为财库。年上戌土为印库冲财库，有点财坏印的意思。你姑娘的八字身财两旺，走到合适的大运会有不错的财运，整体层次是不错的。
          八字月令申金为食神，八字土重又有火生土，有土多埋金之象，好在申金为月令，申月已进入深秋，申金力量较强，不至于被埋，但申金泄土的力量也不是那么强，且申辰半合，故而申金泄身力量一般。
          原局为相对流通的八字，年支戌土和日支辰土去生申金，申金去生壬水，壬水又去生甲木，申金、壬水、甲木为用神，则为忌神化用神，用神力量强。则为有病有药的八字，所以命格不错，见大运来助身，能有一番作为。
          从调侯的角度来看，戊土为高岗之土，也为厚土。《滴天髓》言：戊土固重，既中且正。静翕动辟，万物司命。水润物生，火燥物病。若在艮坤，怕冲宜静。最喜甲木来疏土，甲木为大树之木，可以在戊土扎根生长。
          戊土在天为霞，喜见癸水雨露之水，则戊癸化火为虹，又遇丙火太阳之火则万里无云，霞光照人，贵不可言。从原局来看，天干见丙火、甲木，但不见癸水，则格局层次稍低一点，但依旧为好命。
          事业分析：她的八字比劫太重，则性格是比较固执，好强的，有时候自我，脾气不好，容易和他人言语争论，导致和他人发生矛盾，影响人际关系，阻碍事业发展。而八字原局土太重，也代表为人比较老实内敛，不喜欢婉转奉承，在职场上也容易太受领导待见。
          日支和时支构成辰辰自刑，带自刑的八字也容易心生抑郁，纠结，想不开，如果不加以调整心态，疏导心情，容易患上抑郁。
          而八字纯阳，性格会有些执拗，容易一根筋，一条路走到黑，不撞南墙不回头。八字纯阳全是偏星，七杀透年干之上，野心大，事业心重，属于一个内心不安分，不甘于现状的人。
          八字比劫太旺而克财，属于比劫克财，对钱财观念不是那么重，钱财花销多，也容易破财，难以聚财。好在有申金来生财，代表财星有源头，财源不断为吉。
          不过比劫太重也代表不管做什么事情，都容易阻碍多，竞争大，身边容易出现小人，或结交到不好的朋友，损友，出馊主意，防止受到伤害。
          她的八字财官印全，女命逢之则吉，一生不会遭遇太大的挫折。但她八字比劫太旺，则喜欢自由，不喜欢被管束，所以是不适合求官的，如果考一个正式编制，如教师等还是很不错的，也符合她的性格。
          月柱壬水偏财星临驿马，则代表奔波求财，工作经常变动，而且原局比劫较旺，则求财的过程还是较为辛苦。财星贴身，月柱也构成食伤生财，身旺可以担财，则财运还是很不错的。这个财只能靠自身努力去求得，而不能依靠别人，否则也难以得财。
          婚姻分析：八字纯阳之命，俗话说，孤阴不生，孤阳不长。而且原局临三个华盖星和太极贵人，则为孤独之象，婚姻是不顺的。
          女命正官星代表丈夫，原局不见正官星，则以七杀为夫。年干甲木七杀星代表婚前的感情，七杀在年干透出，而正官星藏于日支辰土中，为官透而杀藏，女命逢之为不吉，一方面要注意婚外桃花，另一方面容易二婚。
          原局比劫太旺构成比劫夺夫，日支为夫宫，辰土为比肩星忌神，则也为其他异性介入她婚姻之象，也容易自己有婚外桃花。日支为夫宫，辰辰自刑，辰戌相冲，婚姻宫受损严重，则她的婚姻在中年以后还是很难安稳。
          大运分析：22岁-31岁走的是己巳大运，此大运为禄神大运，戊之禄在巳，则走禄神大运都是非常辛苦的，事业上易变动，工作上难以稳定。
          天干甲己相合，地支巳申相合，这两个合打断了原局的流通，且用神被合拌，故而壬水财星没了元神，被土来克，则财星受损严重，体现为破财，求财辛苦，事业波折。比劫克财的大运，不建议在事业上较为冒进，能平稳过渡最好。
          今年为辛丑年，天干丙辛相合，印星去合了食伤星，则代表她现在还是很上进的，事业心比较重，印星代表学历、证件、单位，故而有合的象，考证成功的可能性还是很大的，但毕竟走的是禄神大运，所以还是要下一番苦功夫。
          明年是壬寅年，地支寅申相冲，申金为寿元星不喜被冲，则明年要特别注意身体。
          2023年癸卯年，和原局天合地合，这一年要好好把握，有遇到正缘的运气。
          32岁-41岁走的是戊辰大运，此大运为比劫大运，旺了原局的比劫星，则辛苦求财、奔波求财是必然的。辰土在地支伏吟三次，辰辰自刑则心情容易苦闷想不开，你们作为父母还是要多开导，引导她打开心结，不要钻牛角尖。辰土为财库被损害则也有破财或花销大的象。
          42岁-51岁走的是丁卯大运，此大运为官印相生的大运，丁火在天干透出被壬水合入，则和丙火构成日月相随，地支卯木制了厚土，则这步大运在事业上会有所起色，努力工作会有好的发展。但不足之处在于地支卯辰穿害，伤害了婚姻宫，则要注意夫妻口舌之事，离婚之事。
          她的命格和六亲是容易不和的，这种不和，也体现在观念上的不同。对于上一辈人来说，有正式的工作，吃国家饭，是很稳定体面的，在东三省可能会更看重这方面。
          但对现在年轻人来说，并不是都喜欢在这样的稳定的单位，一眼就能看到这辈子大致的发展怎样，希望自己能够去闯一闯，尤其她的八字纯阳，比劫旺，偏星旺，事业心是很重的，不会甘于现状，会想自己去闯一闯，
          即使她按照你们安排，开心满意的只是作为父母的你们，她自己是不会开心的，那样违背了你们的初衷，又有什么意义呢？
          而且她的八字财星用神临驿马，用神在年柱和月柱，年柱和日时相冲，都是暗示她是外出求财之命，回到家乡难以求财的，而且她的性格也不适合去考公务员，即使考上也难以求得发展，心里容易压抑，抑郁。
          她的性格会比较固执执拗，不会轻易认输，但其实内心有时候还是脆弱的，会觉得身边没有亲人朋友支持自己，八字临三个华盖、和太极贵人，也是暗示内心孤独之象，内心上的孤单无助比物质上的缺乏是更无助的。
          与其想要她按照自己的人生规划来走，倒不如尊重她的选择，多给她一些工作人生上的建议，精神上的支持，也能减少很多母女矛盾。
          她的八字格局还是有的，不过早年运势不太理想，在事业上好好把握，以后会属于女强人之类，中年后能有一番成绩。
          `
  }]
}

export default {
  辰时
}