const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   枭神   日元   劫财',
  天干: '乙(木) 壬(水) 甲(木) 乙(木)',
  地支: '未(土) 午(火) 辰(土) 丑(土)',
  遁藏: '正财   伤官   偏财   正财',
  大运: '癸未 甲申 乙酉 丙戌 丁亥 戊子',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/132.html',
    命主甲: `置之死地而后生的80分甲木女命
          `,
    珠玑: `现在看此造，出生日的日干为甲木，所以属甲木命，生于夏天五月，午火当旺之时。虽说是参天大树，生在仲夏，然气候炎热，不免枝叶干枯，木性枯槁，调候为急，不能缺水。
          有水则根润木荣。然夏天火旺、水囚，用水又必先有金，则水有源（金生水)；如无金，必须得辰、丑湿土，以收火气，得其中矣。
          现见此命壬水透出天干，地支有辰、丑湿土，虽说缺金，亦能解决调候的问题。
          第二步就看日干甲木的强弱了，甲木生五月火旺之地，一生下来，脚根还未踏稳，就马上要去生火（木生火），当然是身弱了。所以说五月甲木，位居死地（指很衰弱的意思），身主之弱可知，如无印比（即水木）之助，实难全其生机。
          刚才已看到有壬水之印的帮助（水生木），再看到有两乙木透出年干和时干，虽不能说身旺，亦指有帮助。也许有人说，天干一水生三木，占了八字中四个字了，还不算身旺吗？
          须知天干得二比劫（这里指两乙木），不如支中得一长生禄旺（这里指一亥水、或寅木、卯木）。换句话说，这里的两个乙木的力量，比不上地支有一个亥水，或一个寅木或卯木。
          现查地支全无亥水和寅、卯木强根，只见有一辰土，一丑土，其余一午火，一未土，即一火三土，火生土旺，土亦是此命的财星（我克者为财），可见此命现在属财多（土多）身弱（甲木弱）之造。
          好在辰为木之余气，未土同时也是木之墓库，天干甲、乙木有此余气、墓库之根，亦为可用，不至于为无根之木，只是不强而已。
          且辰、丑又为湿土，在夏天则能晦火、蓄水、养木，这也是此命隐藏的好处了。试想像下一棵参天大树，如刚好生长在潮湿的水边之地，即使仲夏之炎热，但树根能吸收到地下之水汽，不至于根枯叶焦一样。
          可见，此甲木命生在夏天炎热干渴之时，但天干得到壬水之调候，和两乙木之助力，地支有辰、未之余根，及辰、丑之湿土润泽，虽然缺少金来生水，和缺少寅、卯木之强根助力，亦不失为一个好的八字。如果八字满分为一百分的话，此八字可得八十分。缺木强根扣十分，缺金生水扣十分；壬水、二乙木和辰、丑湿土可为它得分。
          此造为伤官生财用印、用劫之格，女命伤官泄秀，人聪明或美貌秀丽；但伤官太多反指愚顽；或伤官见官更是妨夫克夫（指以官星为用时）。好在此造后二者都不是，只是月令伤官午火，生起三财星（三土），财（土）旺可以生官，且夫子位为辰、丑湿土有助力，故亦为合格的女命，不存在伤官伤害官星的问题。
          既然是财（土）多身（甲木）弱，行运当然喜木、水，忌火、燥土，金运天干有壬水生化，地支不见木之强根（寅卯木），不会克木，自可化土生壬水，故亦可行。
          早运未燥土未见其利，甲申、乙酉运青年即可发挥有利可成。唯前面二步好运，得天独厚，许多人就以为是凭自己的努力就能取得前面的成绩，
          以为后运也可以继往开来，忘记了是命运的主宰，便将会受到下面丙戌名利（火土）之运的诱惑，或贸然改行，或另下更大赌注冒险创业，必将受重挫，自内而失，泄气破财难免。须中年后运入北方水地，方见缓和回升好转。
          `
  }]
}

export default {
  丑时
}