const 巳时 = {
  公历: [{
    甲: '1992-11-16 09:45:00'
  }],
  农历: [{
    甲: '1992年十月二十二日巳时'
  }],
  十神: '七杀   正财   日元   正官',
  天干: '壬(水) 辛(金) 丙(火) 癸(水)',
  地支: '申(金) 亥(水) 申(金) 巳(火)',
  遁藏: '偏财   七杀   偏财   比肩',
  大运: '庚戌，己酉，戊申，丁未，丙午，乙巳，甲辰，癸卯，4岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/359.html',
    命主甲: `家境不好，家里4个小孩（2女2男），没有2个弟弟的时候，我爸重男轻女，经常家暴我妈，我妈被打得死过好几回，但是为了这个家我妈都没有离婚，直到我弟弟出生，我爸家暴没那么严重了，慢慢的重男轻女思想也变了。
          我去年考上了研究生，我妹今年考上了县里的高中老师，我一个弟弟大专毕业了也在工作，最后的小弟学业不好，在工厂打工。爸妈关系就那样，经常吵架，但是吵了就和好了，半辈子了都习惯了。
          现在特别困扰我的是我的感情问题，我爸妈思想特别传统封建，他们想让我在我们村附近找对象，说离家近以后受欺负了可以去看我还可以回娘家，我不想回去，我们那很穷，我跟我妈顶嘴，我妈嫁的离我姥姥家特别特别近，我妈也没少挨打，我觉得家暴挨打问题和嫁的远近没有关系，我跟他们沟通，他们不听。
          我找对象前就先问他们意见，去年遇到一个男生觉得不错，但不是我们老家的，我跟他们说了，他们坚决不同意，我很纠结痛苦，不想错过他，就瞒着父母偷偷跟他交往了。
          他和我一个学校，刚毕业工作，我们异地，见过几次面相处过，刚交往他就想和我领证，他年龄不小了，父亲已经去世了，母亲年纪很大，身体还不好。
          我想自己做个决定和他领证，但又担心以后后悔。
          `,
    珠玑: `八字分析：丙火日主生在亥月失令，亥水中虽然藏有甲木，但是年月申亥穿害，甲木受伤所以帮扶又打了折扣。而年柱壬申金水相生，月干辛金透出，日支又逢申金，水得双长生生助，时干又透癸水，所以金水的五行力量是非常旺的。而月令中藏干甲木秉气，且时支巳火为日禄，使得日主有一定的生扶力量，八字丙辛，巳申难以化水。
          因此日主偏弱，喜生扶的木，火五行为用神，而八字水旺，所以五行土也可以制水为用，特别是戊土专治浩瀚之水，而己土制不住水，所以天干己士不能为用神。
          六亲分析：你的年月都是金水忌神，说明你的祖上以及家里的出身条件是不太好的，而印星代表是母亲但印星不显，财星代表是父亲，财星旺去生助官杀克身为忌，代表父母对你没什么帮助。而地支申亥穿在年月支，属于财星穿害藏干中的印星，说明父母关系不好，家庭也不和谐。
          事业分析：八字以木火为用神，只有月令藏干甲木和时支的巳火是八字中的用神，而月令甲木没有透出天干，地支申亥穿害又让甲木的帮扶力度小，时柱的巳火则有天干癸水盖头，地支申金与巳火相合，八字金水两旺，巳火中的丙火克庚金，申金中的壬水冲丙火，八字金水旺，
          所以巳火也容易受伤，帮扶日柱的力量打了折扣，八字金水忌神旺而无制，用神弱又受伤，在事业发展上会比较无助，大多时候只能靠自己亲力亲为。
          禄神被忌神合制不吉，加上禄神逢空，也代表你的八字福禄方面受到影响，事业发展会比较辛苦忙碌，花销也多，财来财去，不过好的是虽然你的八字原局用神帮扶力量小，
          但大运帮扶两大，一路走的是食神，比劫，正偏印天干大运，地支行西方，到南方，东方之地，说明你的大运整体是走的比较好的，而且随着年龄增长会越老越好那种，往后发展也会越来越平顺。
          你的的日主合财，也说明你是比较有上进，事业心，不满足现状，想获得成功的人，当大运帮你的时候，你的发展目标就能慢慢的实现，而且发展还不错，钱财可以富足，晚年无忧，整体可以中产层次。
          婚姻分析：年柱为财生七杀，月令也是七杀，时干透出正官，属于官杀混杂的类型，而且是先七杀后正官，代表你刚开始遇到的对象并不是很好，会经历些失败的感情，经历过几段感情才能遇到比较好的对象，正官在时柱，时柱代表晚，说明你的婚姻来的会比较晚，如果草草结婚的话很容易发生离婚的问题，必须晚婚才会更好。
          日支申金婚姻宫为忌神，同时暗藏七杀星，说明你的结婚对象并不是你喜欢的或者满意的类型，年柱申金偏财，也代表父母，偏财入婚姻宫，说明父母对你的婚姻干扰是比较大的，起到的是不好的作用，因为八字巳申合，使得日禄的力量减弱了很多，因此父母对你婚姻的意见或者说干涉对你来说是一种伤害，不太尊重你选择。
          正官星在时干，且时支为日禄同时又是驿马，代表癸水正官才是你喜欢的人，而夫星坐驿马，说明你命中的对象会是外地远方的，不会是在村子附近的。
          你要到32岁的是才比较容易遇到，且在当年就有结婚的运气。
          大运分析：24岁-33岁走的是戊申大运，此大运食神制杀，七杀星被制，天干去杀留官为吉，对你的婚姻是比较有帮助的，也可以杜绝一些烂桃花干扰，此大运有结婚的运气好好把握。而八字食神制杀，地支生财，对于事业来说也是有帮助的，凶神被制事业发展会获得提升，且能获得他人帮助，自己也比较的用心努力，可以取得不错的发展进步，不过平常开支破耗也不少。
          34岁-43岁走的是丁未大运，此大运丁壬合，七杀星被合住主吉，地支未土为燥土克制亥水也为吉，所以此大运你的事业也是吉利的，可以持续稳步的增长，收获也不小。而婚姻方面，虽然劫财与七杀相合，但还是要适当注意些第三者插足，以及婚姻当中的口舌矛盾，特别是在2026年，2027年要多注意。
          而后面的丙午，乙巳，甲辰等大运，属于比劫，印比帮身的大运，对于你来说都是吉利的发展大运，后面的运势对你来说会更加平稳，钱财会更富足，晚年无忧。而婚姻方面还是老问题，提防第三者插足。
          但婚姻组合不太好，感情不稳定，容易遇到烂桃花，过程不会太顺利，也会受到父母长辈的阻碍，在婚姻问题上，你的想法和父母的想法存在差异和分歧。
          但不能说父母就一定不对，不要因为父母的婚姻不好，以及父母要求，就自我设限，各持己见，不利于沟通，也容易不愉快争吵。
          可以让父母去找本地的，但你也可以提出自己的要求，你上了研究生，虽然学历不代表所以，但很多时候直接或间接影响到两个人生活相处，如果想在村子里找到适合，且学历差不多的对象，也不是容易的事情。等他们去做了发现确实不实际之后，也就不会强塞给你他们的要求。
          和现在的对象看下来，他会比较在意母亲的想法，甚至为了母亲的意愿而委屈自己，他到底是真的想和你结婚，还是为了完成母亲心愿？从你们运势看下来，你和他的缘分不深，婚姻方面建议你晚婚会更好些。
          而事业总体来说是不错的，虽然八字原局比较差些，但是大运走的很好，事业先难后易，越老越好，未来事业发展中获得更大更好的发展成就也是必然的。
          `
  }]
}

export default {
  巳时
}