const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1992年十月十四日卯时'
  }],
  十神: '偏财   正财   日元   正官',
  天干: '壬(水) 癸(水) 戊(土) 乙(木)',
  地支: '申(金) 亥(水) 子(水) 卯(木)',
  遁藏: '食神   偏财   正财   正官',
  大运: '庚戌，己酉，戊申，丁未，丙午，乙巳，甲辰，癸卯，壬寅，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/533.html',
    命主甲: `大学本科专业是工科，2015年毕业后一直在传媒行业，但心里总没安全感，想考公务员，又很困惑。
          `,
    珠玑: `八字分析：戊土生于亥月，天干透壬水，为偏财格。戊土根浅，全局一片财官，申金食神也生了财，八字整体从财官，具体要看大运怎么走。
          事业分析：八字为从财官，喜见食伤来生财，财生官为吉，八字不喜见火土，对大运要求较高，一旦行火土运，导致大运反背，八字全局五行为忌，皆来攻身。从你八字行运来看，一路均有火土，大运走的不太好，困难阻碍会比较多，起伏波动较大，不太顺利
          你第一个大运为庚戌大运，地支戌土比肩星出现，第二个大运为己酉大运，现在走的戊申大运，天干戊己土比劫高透，大运反背，从极弱变身弱，则财官攻身，内心压力较大，忧虑忧愁多，精神比较煎熬，迷茫较多。
          八字水旺缺火，做事缺乏热情，容易消极待人，申金食神去生财，辛金伤官去生财，壬亥水为偏财，子水为正财，物质欲望追求，求财的欲望较大，内心比较不安分，不满足于工资财。八字财星混杂，事业不太稳定。
          天干辛金伤官去制乙木正官，伤官克官，地支申金去制卯木，而水泄金流通，内心比较向往自由，束缚较多，约束较多的事情，会让你不自在，对工作内心比较拒绝，加上地支子卯相刑，卯木正官星受损，考公务员不适合你，容易犯口舌是非，甚至有官非之事。
          八字食伤生财，财旺无制，如大运顺从弱势，可以去经商做生意，但大运一路反背，身弱难以担财，求财辛苦，难以得到这个财，财富等级不高，但八字财官旺，欲望会比较大，求而不得会让自己比较痛苦，对财官较为执着的话，容易惹来灾祸，是要注意的。
          能有一门过硬的技术为吉，从事你所学的工程类专业和事业是可以考虑的，也可以考虑设计策划，金融财务，销售相关工作。
          婚姻分析：八字为从财官格，月干辛金伤官星和壬水偏财星高透，口才较好，人比较灵活，慷慨大方，浪漫有情调，人际关系较好，也是比较有人情味的一个人，懂得照顾体贴别人，在恋爱中一旦认准便敢于追求。
          八字大运反背，对待婚姻比较挑剔，容易冲动，对另一半要求较高，充满幻想，要求多，在感情和婚姻上压力较大。地支子卯相刑，婚姻宫子水受损，未来婚姻环境不太好，夫妻感情较为冷淡。
          八字食伤较旺，年龄偏大的男人比较适合你，时柱正官星临天乙贵人和天德贵人，未来丈夫内心比较善良正直，聪明灵活，长相帅气，肤色偏黑，个子不高，身材微胖，对你帮助不大。
          今年辛丑年，地支子丑相合，婚姻宫动，天喜入命，有机会遇到缘分，明年壬寅年，地支寅木七杀星出现，寅木为驿马，地支寅申相冲，驿马动，异性缘分不差，2023癸卯年，地支卯木正官出现，天干戊癸相合，卯木正官星一并被合入，这几年好好把握，可以落实婚姻。
          大运分析：22岁-31岁走的是戊申大运，此大运天干戊土比肩星高透，大运反背，身弱不担财，求财辛苦，正官攻身，工作压力较大，内心忧虑担忧多，负能量重，地支申亥相害，开支花销较大，存不住钱，能上班求财最好，命局克泄耗较多，要注意身体健康。
          32岁-41岁走的是丁未大运，此大运为印比大运，大运反背不吉，天干丁火印星高透，但丁壬相合，财星制印不吉，贵人运较差，要注意身体健康。地支未土去制财，戊土日主有了根，则财运稍微好转，但子未相害，开支花销还是比较大的，容易破财，也容易有其他女性来影响你的婚姻，夫妻矛盾不小，这是要注意的。
          42岁-51岁走的是丙午大运，此大运干支一气为印星，大运反背不吉，天干丙辛相合，丙火被合拌，地支午火被财星所制，子午相冲，财星逢冲，开支花销还是挺大的，求财辛苦，付出多，收获不太成正比，整体财运不太好。日支子水逢冲，也代表婚姻不稳定，夫妻之间聚少离多，有婚姻变动的迹象。午火为日主的羊刃，羊刃逢冲，要注意意外伤害。
          乙巳大运，官印相生，甲辰大运，地支见火土强根，整体大运反背，地支巳亥相冲，巳火被冲克，地支逢湿润土见旺水，水土混，事业发展方面容易有明显波动，财来财去，容易陷入泥潭，事业财运整体不太理想，注意理财，同时运背离也要注意身体健康方面的问题。
          癸卯大运，财官相生，大运终于不反背，顺从弱势为吉，运势好转，但年龄已经很大了，未免遗憾。
          不要总想着找一条最完美的路，再付出行动和努力。而是你付出行动和努力之后，才会知道自己接下来应该怎么走。
          `
  }]
}

export default {
  卯时
}