const 子时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1987年六月月二十日辰时'
  }],
  十神: '劫财   七杀   日元   食神',
  天干: '丁(火) 壬(水) 丙(火) 戊(土)',
  地支: '卯(木) 寅(木) 申(金) 子(水)',
  遁藏: '正印   枭神   偏财   正官',
  大运: '辛丑，庚子，己亥，戊戌，丁酉，丙申，乙未，甲午，4岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/322.html',
    命主甲: `自2013年结束外地漂泊回到家乡小城市之后，一直在当地一家国企工作，6年来，没有特别大的起色（中层干部的各项任职条件都早已符合），一个萝卜一个坑，目前看来也没有升职加薪的空间。
          拿着刚刚解决温饱的薪水，过着一眼能望到头的生活，已经到了瓶颈期，温水也快把我煮死了，而且业务上面已经没有太大的突破，
          心里一直有想跳槽的想法和冲动，但孩子还小，正是需要人照顾的时候，如果跳槽的话只能离开家乡去大一点的城市，内心很纠结。
          自三月份我老婆生完小孩以来，家庭关系（婆媳、夫妻之间）相处的很不开心，鸡毛蒜皮碎了一地，经常因为一些小事吵闹，现在闹的放着自己的家不回（没有与父母住一起），在外租房子住，
          雇着保姆也不让我父母看孩子，经济与精神压力都特别大，经常为什么时候回家而吵吵，
          不管找同事还是朋友来劝都不太管用，也不止一次动过离婚的念头。这件事让我身心俱疲，几个月来精神压力巨大，真不知道什么时候是个头。
          `,
    珠玑: `八字分析：丙火日干生在寅月得令，同时八字地支寅卯相贴，木的力量是比较强的，生助日柱力量也很大。且八字年干月干丁壬合化木再生助日柱，力量再得到增强。
          地支寅申冲，而申金被子水泄掉部分力量，冲性仍在，只是八字木旺，申金弱，反而容易受伤，而时柱为土水的组合是泄耗日主的，但日主受生助的力量强于被泄耗的力量，日主明显偏旺，喜克泄耗的五行为用神，以土金水为用神，木火为忌神。
          事业分析：八字日主自坐偏财星，代表你会有一些财运，只是偏财被旺印冲，又被时支正官泄气，财星力量受冲被泄损，而正官可以代表工作单位，天干透出七杀被合化，去杀留官本为吉，只是正官的力量也不是很旺，又被时干戊土盖头，所以整体你的财运不会很大，收入不会太高，但正官得生助，代表工作还是会比较体面，且相对轻松些。
          只是如果想获得加薪升职是有些难度的，需要等到财官比较旺的大运流年才有机会，结合你走的大运来看，现在走伤官大运，后面是食神及比劫大运，对你整体事业发展不利，整体事业层次有限，想获得大的发展较为困难，但总体可以达小康偏上些的水平。
          去年2019己亥年，太岁和大运伏吟，又是伤官和七杀的组合，增加八字食伤的力量，食伤旺代表想法多，不安分且有不满足现状，冲动的想法。而地支亥亥自刑，生助地支印星，代表也是想法多，胡思乱想而没有行动的迹象。且没有财官来通关，所以你的从你的运势来看，也是不利变动的。
          今年2020庚子年，太岁八字大运，食神生财，八字财星透出，财生官，此年对你的事业发展较为有帮助。事业财运易有好转，且有升职加薪的机会。
          明年2021辛丑年，太岁与八字大运同样食神生财，且财星与日主相合，属于得财之象，且丑土为财库，所以财运也还可以的，只是地支子丑合有伤官见官之象，所以要注意人际关系及是非口角。
          而到2022壬寅年，太岁与八字天克地冲，又是与月柱伏吟的运气，此年你的事业财运比较差，虽然有跳槽，变动的迹象，但是属于不好的变动，最好不要轻举妄动，求稳发展为宜。
          从你近几年流年运势来看，没有好的变动的运气，且你的八字七杀被合，又逢食神制杀，地支剩下财官相生，但力量不强，虽然2020年，2021年运气稍好些，但是好景不长，且年柱月柱忌神力量旺无制，所以你虽走食伤运，但是没有财星来通关流通，八字印星又旺，与财星相冲，大的发展很难，虽然你有创业的想法，但不具备创业做生意的运气，建议你还是留在国企单位发展更好些。
          婚姻分析：你的日柱丙申，申金为婚姻宫落偏财星，八字无正财以偏财代表妻子，财星落婚姻宫得正位主吉，且为用神可旺你。但是八字地支正偏印相贴与你的婚姻宫相冲，且婚姻宫申金的力量弱容易被冲伤。这就代表你的婚姻宫不稳定，也容易滋生争吵不合矛盾。同时也代表你的妻子在婚姻家庭中过的不是很舒心。
          而印星分别在年月，十神以及宫位都是代表父母长辈，与婚姻宫相冲，是比较明显的婆媳关系差之象，且矛盾重重，而婚姻宫及妻星力量弱，也代表妻子也会处于不利的地位，而婚姻宫生子女宫，代表妻子的注意力会集中到孩子的身上。暂时分开住也不是什么坏事，如果住一起的话，矛盾会更大，会危机到你们的婚姻。
          而你的八字食伤与财星不能相生，也说明你对妻子不是那么关心，对妻子的体谅不够。而八字印星生助日主，代表你更容易接受父母的看法，或者说因为父母而伤害到妻子，也容易把自己陷入母亲和妻子的两难之中。
          整体来说，从八字看你婆媳问题是很明显的，而且也会是你婚姻危机的定时炸弹，要注意好好处理。结合你的大运走势来看，婆媳关系比较难解决，对你的婚姻也会带来不利影响，但大运八字财星得生助，夫妻的感情还是会比前面会稍微好些。
          大运分析：24岁-33岁走的是己亥大运，此大运为伤官加七杀大运，大运食伤旺，地支寅亥合，食伤旺也代表积极努力辛勤的付出，但食伤也代表想法多，不安分，欲望有些大，总想获得更大的发展。而地支杀印相生，可以解决寅申相冲，对你的发展还是有些帮助的，也可以说财运相对稳定些。只是八字天干食伤旺生不到财，你会空有想法而没有实际切实可行的方向，财运没有明显的增长。
          34岁-43岁走的是戊戌大运，大运八字食神制杀，且被合支，独留正官为吉。只是八字中的官星虽然得财生，但是力量不是很大。好在大运干支为食神可以生到地支中的财星，多少对你的发展是有些帮助的，财运也会获得好的增长，会比之前好些，但这个大运也容易冲动，而急于求成，要注意的。
          44岁及之后你走的是丁酉，丙申，乙未等大运。丁酉大运和丙申大运分别为比劫加正偏财的大运，比劫力量增强，财星力量也增强，而八字天干有食神，对比劫有一定的泄气作用，所以这两个大运虽然竞争大，也容易受人排挤，但只要坚持努力，依然会有得到增长的，只是花销支出也不少。
          而乙未大运半合印克制食伤，对整体事业是不利的，发展缓慢，还要注意工作容易出错，且要注意受骗上当的情况，应保守比较好。
          你的八字格局层次不太高，虽然去杀留官，但八字财官力量不是很旺，财星没有得到食伤生助，却被旺印冲，使得财星力量不强，但官星无伤，所以事业还是可以比较稳定的。而大运一路走食伤，比劫加西方财运之地，后面的事业财运能够有所提升，虽然提升幅度起色不大，但多努力求稳发展，也能够有小康偏上的生活水平。
          整体看来是不建议去创业的，不具备创业的条件，而近几年走的运势来看，也不太有利于变动，变动也难有好的起色，反而容易陷入被动，跳槽离开家里去外地，既照顾不到家人孩子，也会无形中多一笔新的开销，且更多的不确定和不稳定性，建议是留在现在的国企发展更好些。
          `
  }]
}

export default {
  子时
}