const 寅时 = {
  公历: [{
    甲: '1988-02-14 04:30:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   正官   日元   正印',
  天干: '戊(土) 甲(木) 己(土) 丙(火)',
  地支: '辰(土) 寅(木) 亥(水) 寅(木)',
  遁藏: '劫财   正官   正财   正官',
  大运: '乙卯，丙辰，丁巳，戊午，己未，庚申，辛酉，壬戌，癸亥，7岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3060.html',
    命主甲: `男性三十而立的年纪，让我倍感压力。婚姻最近很不顺，争吵不断。时时总是动离婚的念头。但是却迫于孩子一直在拖。
          工作每天也繁琐。我觉得竞争压力特别大。而且我觉得自己总是财进财出。前几年还被别人骗了一笔钱也要不回来了。去年在工作中频频遇到小人，也破了一次财。
          `,
    珠玑: `八字分析：己土生在甲寅月，上下干支一气，是纯正的正官格无疑。年柱为劫财，正官制劫财成格，时柱也为官印。正官格以一位为贵，多则降低等级，像七杀一样给命主带来压力。
          从调侯的角度来看，己土为田园之土，寅月刚进入初春，天气尚有寒气，则己土为湿土也为冻土，喜丙火太阳之火照耀大地来暖土，也喜癸水雨露之水来滋润方可生长万物。
          八字时干丙火透出为吉，起到了化官杀生身的作用。己土坐亥水之上，可以起到滋润己土的作用，故而格局层次不错，好好努力可以有一番作为。
          事业分析：八字属于财官印全的八字，一般这样的组合比较平稳，衣食无忧，五行也较为流通，身弱则喜流通入自身，日支亥水生了寅木，寅木生了丙火，丙火再来生身，为忌神化为用神，财官印流入自身，福禄双全，如果大运来助身则能取得好的发展，就怕大运破坏流通则不吉。
          丙火正印贴身为用，比较注重名誉，也希望通过加强学习，提升内在的涵养，可以通过自己的努力获得一个不错的文凭。
          正官星较多，为人比较自律，对自己要求高，对别人要求也高，但也容易过度注重细节，思虑过重，平时压力较大，适合从事管理工作。
          这种命格适合在机关事业单位上班，偏财去生正官，则有财来养官，官运是很不错的。原局正官星较旺，擅长管理，有机会进入领导层。正官来生正印，寅木为丙火的长生，印星代表“印把子”，即实权，则职位和权力均能得到，财官印都流入自身，代表财官印都能被自己得到。
          时柱为正印星坐国印贵人，则也代表在工作上可以得到实权和职位。且天干甲己相合，正官星合入，能获得一份稳定体面的工作。
          不足之处在于正官旺且多，正官可以当七杀来看，七杀代表小人，月柱正官被日柱合入，也身边的小人较多，做事阻碍多，平常要顶住压力，勇于克服困难才可以。
          月柱和时柱正官临驿马星，则因为工作而奔波大，外出求财为吉，在外地打拼会有好的发展，财运会更好些，感情也会好点。在正式单位上班也适合经常出差或走动的岗位。
          日支亥水为偏财，但原局没有食伤星来生财，财星没了源头，财运一般。
          地支两个寅木争合亥水，且亥水去生了寅木，本来财星在日支为自己的财，但被合走，正官代表工作，则因为工作会花销很大，也代表会因为求财容易招惹是非，在求财过程中，要懂得取财有道。
          身弱难以担财，能有一份相对稳定的工作最好，收入则较为稳定，不会有大的波折。
          正官多为七杀，七杀代表不良人，则为被小人谋财之象，则和朋友、同事涉及资金钱财之事要谨慎为之。
          婚姻分析：命格为财官印流通的组合，这样的组合，为人还是善良仁慈的，较为温和，待人较为宽容和亲和，做人比较重感情，讲人情。且比较积极上进也比较容易满足，则幸福感比较强，这些性格都是有利于你的事业和婚姻的，能非常体谅另一半，去关心和爱护妻子。
          但你的性格也有不利的一面，八字三个正官，真正相处久了会有些多疑，忽视妻子感受，好脾气留给了别人，坏脾气留给了亲密的人。命局不见食伤星，不擅长言辞，不会表达，遇到比较强势的妻子容易压抑委屈，进而爆发口舌之事。
          日支亥水偏财星代表妻子，日支亥水也为妻宫，则为财入主位，八字见一个财星为独财，妻子长相不错。
          地支寅亥相合，亥水被两个寅木争合，则妻子容易有二心和婚外情，其他男人容易干扰你的婚姻，影响到你婚姻的稳定。
          亥水见辰则有入墓之象，妻星入墓的八字一方面妻子身体容易不好，另一方面也代表感情易败，要注意大运再来冲妻宫，会导致婚姻不稳之象。
          大运分析：27岁-36岁走的是丁巳大运，此大运为印星大运，印星为用神，天干丁火可以起到化杀生身的作用为吉，但也有一些不顺之事。地支巳亥相冲，冲了妻宫和妻星，则家庭矛盾，口舌争吵会很多。
          从后面大运来看，57岁后进入庚申大运，地支构成申亥穿害，也会造成婚姻不顺，其余大运没有不利婚姻的信息。
          所以你只要平稳渡过这两个大运，婚姻是可以持续稳定的，在感情中要注意相处，在这个过程中要注意妻子和异性的接触。
          同时，财星被冲，且寅巳穿害，则破坏了原局的流通性，则工作上会遭遇坎坷，有不良之人来阻碍自己的发展，也有破财之象。
          2020年为庚子年，这个流年为食伤生财的大运，财星有了源头还是很不错的，但身弱财旺难以担财，财多为忌反而容易带来祸患，而且此流年和大运丁巳相克，则财来财去不聚财。天干庚金去克甲木造成伤官克官，则在工作上容易犯口舌是非，也会对单位同事和领导产生不满情绪。
          2021年为辛丑年，这个流年天干辛金虽有克甲木之象，但难以构成伤官见官，时干丙火把辛金合入，地支丑土去克了亥水偏财星，构成劫财夺财，从这个角度来看，要注意提防小人，防止被算计，很容易因为小人而破财。
          2022年壬寅年，这个流年财官相生的流年，大运丁巳和流年壬寅天克地害，且壬水正财星虚透天干，则花销较大，难以聚财，事业上家庭上也会有诸多不顺之事，尤其是地支出现三虎，即三个寅木去争合亥水，则一为容易破财，二为防止另一半出现婚外恋。
          37岁-46岁走的是戊午大运，此大运天干戊土劫财透出得制，地支午火来化杀生身，故而在事业上会取得较大发展，这个大运对你来说是事业的黄金期，好好把握可以获得升职的机会。
          47岁-56岁走的是己未大运，天干己土伏吟，甲己相合正官星被合入，则个大运也会遇到升职提拔的机会。但地支未土损了财星，破坏了原局的流通，则有破财之象，妻星被损则也代表妻子身体不好，健康受损。
          你的八字组合还是很不错的，大运走得也还不错，要加强学习，趁年轻多用知识武装头脑，学习是加强印星力量最直接的方式，修学储能对你未来事业的帮助还是很大的，能进入机关事业单位去发展是最好的。
          不过婚姻方面不太好，要注意的是现在27岁-36岁走的丁巳大运和57岁-68岁走的庚申大运，这两步大运家庭矛盾会很多，也有离婚之象，不要因为一时的吵闹就萌生离婚的念头。
          男命官杀星代表子女，时柱为子女宫，则时支寅木代表女儿，日主身弱寅木较旺为忌神，且原局没有食伤来制正官，则和女儿缘分薄，但总归正官星被丙火泄气，又来生身，则大一点之后还是比较孝顺的，晚年可以有靠。
          `
  }]
}

export default {
  寅时
}