const 申时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1988年八月二十三日申时'
  }],
  十神: '正印   比肩   日元   正官',
  天干: '戊(土) 辛(金) 辛(金) 丙(火)',
  地支: '辰(土) 酉(金) 卯(木) 申(金)',
  遁藏: '正印   比肩   偏财   劫财',
  大运: '壬戌，癸亥，甲子，乙丑，丙寅，丁卯，戊辰，己巳，庚午，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/528.html',
    命主甲: `工作一直也算顺利，跟随一个企业规模近50亿的的老板，负责销售。从17年开始经济压力很大，这两年更是工作上相对低谷不顺心，薪资也有下降，跟老板关系也一度处于冰点。也不知道这样的情况要多久，自己是越来越不想继续在这个企业。
          一方面有客户想找我一起创业，不过创业的规模比现在所属企业就好像一个航空母舰跟一艘小帆船，而且资金也需要不少，从大平台销售总监到小作坊当老板，觉得有点落差。另一方面，自己去年已经在尝试电商内衣裤方面，也不知道能不能成功。
          `,
    珠玑: `八字分析：辛金生于酉月，为禄格，禄神逢冲，中年奔波。年柱戊辰为正印，印禄相随，少年时期过得不错。晚年官星制劫财，也算不错，但官星不旺，可能稍有破费的现象。
          事业分析：辛金为珠宝金，喜见水来洗金，方能发出光泽，八字身旺，也喜水来泄身，但命局原局缺水，时干虽然丙火为用神来克身，但丙火与辛金相合，丙火为用神被合拌不吉，日支卯木难以来生丙火，日支卯木财星被月支的酉金比肩，和时支的申金劫财夹克，卯木受损，同时没有水来生木，整体八字原局忌神有力，用神被克，格局层次容易有不稳定波动。
          八字印星旺比劫旺，会比较自我，以自我为中心，逞强好胜，不服输，不怕困难，利于参加激烈的竞争中，不过八字不见食伤，有的时候遇到问题不太婉转迂回，容易顾忌不到他人感受，而得罪人到人，影响人际关系，加上时支申金为羊刃，有时候容易冲动，而影响到人际沟通，导致事业上被排挤。
          天干两个辛金争合丙火正官，事业上竞争较大，想要做出一番成绩需要克服重重困难和障碍，不容易得到领导的赏识，日支卯木为偏财，但地支卯酉相冲，有申金来制卯木，构成比劫夺财，不适合创业投资，也不适合合伙，容易破财。
          日支卯木偏财为命局独财，不见食伤来生财，财运不稳，自主创业或合作求财很容易失败。八字比劫旺，求财会比较辛苦付出多，才有可能致富的命，难得闲在。
          八字丙辛相合，正官合身，在大一点的企业稳定求财较好，身旺财弱，借助大的平台，他人的运气求财比价好，自己去做的话不稳定，现在的状态都很难达到。
          婚姻分析：八字印旺比劫旺，但不见食伤星来泄身，在感情上容易忽视对方，不太会关心体贴对方，有些自私，不会为另一半着想，脾气也不太好，容易和另一半发生冲突矛盾，且比较强硬刚直，即使错了也不会轻易承认，不利于感情的维护。
          八字比肩较旺，地支卯酉相冲，卯木也被申金劫财所制，为比劫夺财的组合，在婚姻和感情上竞争很大，另一半容易出轨，发生婚外情，月令酉金为桃花星，桃花星去冲了婚姻宫，容易有其他男性来影响你的婚姻，发生婚姻变动，这是要注意的。
          地支卯酉相冲，卯木被酉金和申金冲克，不见食伤星来生财，地支卯辰相害，妻子很容易身体不好，运势不佳，夫妻缘分不是很深厚。但日支卯木为用神，也为将星，表示妻子比较能干，有个性，在家庭中喜欢掌权。
          大运分析：33岁-42岁走的是乙丑大运，此大运地支丑土被天干乙木盖头，为财星制印的大运，天干乙木偏财星高透，但被两个辛金所制，钱财上花销很大，不聚财，不适合去去创业投资做生意，容易破财。地支丑土生扶比劫，事业上竞争很大，让你感到压力很大，求稳为上，不宜去折腾。
          43岁-52岁走的是丙寅大运，此大运为财官相生的大运，总体运势有好转，天干丙火正官星高透，坐寅木得生，事业上有贵人相助，可以施展出才华，做出一番业绩，有升职的机会。但地支寅申相冲，有劫财夺财之象，还是不宜创业投资做生意，能跟着其他人做为好。申金羊刃逢冲，要注意意外伤害之事。
          53岁-62岁走的是丁卯大运，此大运为财杀相生的大运，天干丁火七杀星高透，得卯木生扶不弱，七杀来制比肩为吉，事业上可以克服困难和阻碍，取得一番成就，但地支卯酉相冲，比肩夺财，且酉金禄神逢冲，暗示会破财，花销不小，也要注意身体健康。同时，卯木也引动原局婚姻宫逢冲，要注意婚姻不稳定。
          后面的戊辰大运，干支一气为印星运，地支卯辰相害，卯木用神受损，不是很好，同时健康要注意肝胆方面疾病，也要注意妻子身体健康。
          这两年受疫情的影响，不少企业过的很艰难，裁员，甚至倒闭，有的企业看着资产很庞大，但越是庞大，遇到危机的时候越容易动荡，因为公司业绩下滑，收入减少了，但公司的开支，人工成本其实是一样的，开支非常庞大，但现金流减少，不能维持公司原有规模，长时间的撑下去，那只能是从节流上下手，降低公司的运营成本，员工降薪等。
          企业虽然都是谋利的，但作为老板来说，他也想公司业绩能够越来越好，给员工加薪，员工福利待遇好，有干劲，踏实工作，公司才会向着好的方向发展，降薪是无奈之举，老板也不容易，压力很大。
          而负责销售，在公司就是靠业绩说话的，为公司创造可见的利益，业绩不好，腰杆都直不起来，收入也很难上来。
          虽然你和老板只是雇佣关系，但做为老板来说，公司发展好的时候，你享受了公司的红利，公司困难的时候，你就消极工作，这是老板很不喜欢的。公司困难的时候多点理解和付出，公司发展好的时候也不会亏待你。
          `
  }]
}

export default {
  申时
}