const 戌时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '偏财   伤官   日元   偏财',
  天干: '壬(水) 辛(金) 戊(土) 壬(水)',
  地支: '子(水) 亥(水) 子(水) 戌(土)',
  遁藏: '正财   偏财   正财   比肩',
  大运: '壬子 癸丑 甲寅 乙卯 丙辰 丁巳',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/158.html',
    命主甲: `从财不成之破败格局——不从不化、淹留仕路之人
          `,
    珠玑: `此造出生日的日干为戊土，所以属戊土命。生黄历十月立冬之后，亥水当旺之时，这时有二个主要特征，一是水旺土荡，土临绝地；二是寒土寒水，生机岌岌。要解决这二个问题，水旺就要喜见土来止水，和土来帮身；寒土寒水就喜见丙火太阳来照暖，丙火也可生旺戊土。现在就要向其他六个字(除了日主和月支外六个字)中找有没有能解决的五行了。
          看到戊土日主自坐子水，年支又是子水，地支三水连成一片，已成汪洋。天干再见两壬水透出，辛金又泄土气（土生金），且再生旺壬水（金生水）。天上暴雨成灾，地下汪洋一片，戊土日主孤立无援。
          假如此命就批到此为止，便可入“从财格”的特别格局来处理，那反而是好命，因此戊土日主以水为财（我克者为财，财为我享用之物），地支天干全是财星（水），或食伤星（金），日主孤立无根，也无印劫火土帮助，反成弃命从财格（不要自己，跟随命中水多的大形势而去）。
          可惜现在情况是，因为有时支戌土，戌为燥土，可作戊土日主之根，有如茫茫大海中一块礁石，使得此命不能入从财格，而成了：“不从不化、淹留仕路之人”。如果能“得化得从”，便是显达功名之士。
          如果生成这样一个八字，当然不适合去做炒股、合资，或自行创业等冒险事业，唯有老老实实，靠自己的双手去打份工，靠工薪来度日。或者学一技之长，以技能谋生。例如学会计、出纳等，日后从事处理钱财方面的工作。因为八字中财星多且旺，但看得出这些钱财包围着你，只是经过你的手，你并不能真正拥有它。所以最适合的工作就是在银行或公司中管理、处理钱财，大把钱经过你的手，但你只是取得自己付出劳动的那部分工薪而已。万一你起了贪念，将经手的钱财占为己有，那就横祸加身，会应验“财多身弱皆是祸”这句话了。
          行运喜火、土，忌金、水、木。乙卯木运中，木为忌神，结果被他人破财，损失了所有积蓄。此造主要缺点是缺少喜用神，文章开头时写过，戊土生十月，本来就水旺土荡，如果结合其余六字配合后，仍是水旺土衰，则喜土为之堤防；二是寒土寒水，喜火照暖。而这二者在此命中都缺如。
          有人会说，不是有时支戌土吗？戌为燥土，可以止水。戌燥土止水不假，唯放在此造中，地支三水一土，天干二壬一辛，已成汪洋大水，戌土与之相比，不成比例，犹如大水泛滥时水底下有一块大石头而已，只有阻水，不能当堤防。所以此戌土只作日主戊土之根，使其不被大水冲走，岂能去水患？唯有天干透出戊己土，亦即是须有雄厚之土，为之堤防，方可任此旺财旺（水）。其二是无火照暖，生机何在？
          可见，十月戊土，命中配合后仍水多土寒为患，须有厚土以去水患，盛火以温土气，方得身主康强，承此旺财。
          `
  }]
}

export default {
  戌时
}