const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '食神   七杀   日元   正官',
  天干: '壬(水) 丙(火) 庚(金) 丁(火)',
  地支: '午(火) 午(火) 申(金) 丑(土)',
  遁藏: '正官   正官   比肩   正印',
  大运: '丁未 戊申 己酉 庚戌 辛亥 壬子',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/141.html',
    命主甲: `时支能决定一个八字的最后命运
          `,
    珠玑: `此造出生日日干为庚金，所以属庚金命。生在五月，午火火势正盛，庚金力弱，喜金、水助力，忌木、火再多。
          现看见地支二午火，天干丙、丁火齐透出克制日主庚金，好像非常厉害。再看解救之神壬水透出年干，同样坐午火，且被月干丙火所克。壬丙相克，夏月火旺水囚，地支已见两午火，故火胜水败。另一救命之神申金在日主坐下，本是好事，唯被两午火连接相克，看来此造也落得个喜用无力受伤，配合无情，不佳之命了。
          如果是精明的读者，有的可能已经看到了，还有时支丑土未论。是的，很多命造，都是因为时支一个字的不同，就足以改变前面已定的命运。换句话说，一个人出生的时辰，掌握着这个人出生时最后的秘密。
          现在此造时支是丑土，这个丑土为何能起到这么大的作用，能使一个命起死回生，反败呈祥呢？我们知道，丑属湿土，是冰霜湿泥之土，内藏己辛癸，己土是本气，癸水、辛金是余气。最能纳火之烈，养金之锐，晦火之光，从而达到养金护水的目的。
          现在正因为时支有了这个丑土，两个午火就克不到申金，丑土为冰霜湿泥之土，反而收拾了午火猛烈之火气，从而起到生助申金的逢凶化吉，反败呈祥的作用（火生土，土生金）。
          同样，因为有了丑湿土，天干壬水在地支就有了水之余气，又得到绝处逢生的申金的助力（金生水），从而水源不断，不但未能被丙火克倒，反而愤起去救火护主，制住丙火，（壬水克丙火）让日主庚金能去浊留清，反成官贵格。
          因为此造丙、丁火齐透，丙火是日主庚金的偏官（七煞），丁火是正官，是为“官煞混杂”。一个八字最忌“官煞混杂”，尤其是以官煞为忌神时，是为“官多不贵”。现得到了壬水食神的助力，制住丙火七煞，只留下丁火一位正官，“官星一位为贵”，于是反而成就了一个官贵之命。行运仍喜湿土、金、水，忌木、火、燥土。
          `
  }]
}

export default {
  丑时
}