const 申时 = {
  公历: [{
    甲: '1996-12-02 16:50:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正财   七杀   日元   正印',
  天干: '丙(火) 己(土) 癸(水) 庚(金)',
  地支: '子(水) 亥(水) 酉(金) 申(金)',
  遁藏: '比肩   劫财   枭神   正印',
  大运: '戊戌，丁酉，丙申，乙未，甲午，癸巳，壬辰，辛卯，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/402.html',
    命主甲: `2021年刚刚毕业，处于人生非常迷茫的时期。
          我自我感觉我的学习还不错，但是从来没有感觉到自己感兴趣的行业。就是那种我能学好做好是因为我有责任，而不是我有兴趣。但是我总感觉还是需要找到点自己喜欢的东西作为自己的职业的。所以我现在很矛盾也很迷茫。
          最近在工作上其实也有一些机会，一个是金融业相关的，一个就属于生意上的。现在有个问题就是那个生意上的合作需要我先投入一笔不少的费用而且利润暂时无法保障。我不知道我能不能投这笔钱，以后会不会亏。
          从事金融更像是维持日常生活，从我目前的情况来说自然是需要这份工作的。但是我也不确定我能不能同时胜任两份工作。同时，其实这两个我也不能说是非常感兴趣，更多是因为生活上的需要以及想要自己赚点钱。
          至于兴趣方面也还是有，不过跟音乐艺术类的关系更大。目前属于自娱自乐的阶段。不知道我适不适合投入更多精力去创作收获一些成绩。然后就是这份迷茫跟不知所措导致了我根本不敢去谈恋爱，怕耽误别人更怕浪费大家时间。
          `,
    珠玑: `八字分析：癸水日主生于亥月，以劫财立格，劫财格需要制化得宜，否则一生就和破财如影相随。己亥月，己土七杀能够对壬水有一定的克制作用，但不如戊土官星来得有力，八字原局无戊土，只有等到大运流年出现财运才能步入坦途。
          你的八字年上得禄，又有得力的印星生身，福气还算不错的。八字偏印旺，不见偏财克制，性格方面自然也有一点任性甚至偏激。
          事业分析：八字比劫较旺，会比较自信，自我，而脾气也会有些急躁，脾气是不小的，同时正偏印贴身相生，也会比较固执，同时想法也比较多样化，想得多，顾虑多，瞻前顾后，做决定的时候犹豫不决，容易想的多做得少。年干丙火财星，生月干己土七杀，为人还是有上进心，有拼劲，有闯劲的，有事业心的一个人，也有些事业追求，但也容易冲动。
          年干丙火财星，月干己土七杀，年干丙火财星在地支无根，也没有食伤来生财星，八字原局的财星是不旺的，同时丙火财星去生己土七杀，代表会有一定的事业发展，但八字原局的财富不大。
          印旺生比劫，事业发展的竞争压力是比较大的，丙火财星坐下子水比肩，注意小人干扰，以及要注意因为朋友关系考虑不周而破财。
          八字印星旺为忌，事业求财会比较辛苦忙，付出多些才进步收获，有时也容易得不到应有的回报。结合大运走势看，后面大运一路走的是正偏财，食神生财的运气组合，对你发展有帮助，能够有发展提升的空间，总体来说能够过上比大部分人好的生活，有房有车有点小钱没有问题。
          比劫旺印旺身旺，而没有食伤星泄秀，只有财星和七杀虚透，做生意是不太适合的，更不适合与人合伙做，适合上班，到你40岁后开始走食神透出生财的时候做生意才较适合些，现在不适合创业投资。
          你的八字以财官杀为喜神，金融方面是适合的，同时命身旺泄泄秀，也可以往艺术文化及土木工程，经营管理也是可以的。
          婚姻分析：婚姻宫酉金偏印为忌神，时柱庚申印星干支一气，对感情会有些比较敏感多疑，同时印星重也代表会缺乏安全感，想法顾虑多，对感情会有些被动。
          八字印旺生比劫，比劫旺，同时八字见七杀不见正官，桃花星在婚姻宫，也代表在感情中不容易遇到自己各方面满意的对象，容易遇到烂桃花，而遇到相对好些的桃花机会，也容易竞争大，好的对象也有其他选择，而你不那么占优势，注意被人插足的情况发生。
          婚姻宫为忌神，且婚姻宫周围也是忌神，月干虽然透出己土七杀，同时有丙火财星来生，但丙火财星不旺，己土七杀也不旺，七杀虚透无根，难制比劫，感情质量不是很好，对象对你帮助不大。
          你的婚姻运必须等到八字中财星力量增加，生助官杀星且旺的时候才有结婚的运气，未来几年婚姻运都不太旺，要等到2025年天干食神生财，财生七杀，地支财合印的时候，结婚运财比较旺，注意好好把握。
          大运分析：20岁-29岁走的是丁酉大运，此大运天干财星力量增加生助七杀为喜，是吉利的，事业能够有效的发展机会，但地支印旺容易生比劫，竞争也会比较多，且容易钱财容易破耗，虽然辛苦忙碌付出多些，但此大运整体是好的。
          30岁-39岁走的是丙申大运，此大运天干财生七杀，对你事业发展也是有帮助，而地支印星生日主，也代表会比较忙碌付出多才有收获。而大运天干财克地支印，总体来说是有收获的，只是地支子申半合比劫局，工作上的竞争阻碍会比上一个大运更大。
          40岁-49岁走的是乙未大运，此大运天干食神与八字财，七杀相生对你的运势更有帮助，地支七杀克制比劫，又有印星流通，整体运势不错的，能够有进一步发展提升机会，钱财也会更富足。而财生七杀，地支逢七杀，自己也容易有异性桃花，同时也要注意其他女人干扰你的感情。
          甲午大运，天干伤官生财，财生七杀，地支子午冲，对你整体运势发展有些帮助收获，只是会有些起伏波动明显，不过整体运势还是好的。
          癸巳大运，与月柱天克地冲，运势不太平稳，做事也是容易患得患失，财运也是有些小的不稳定波动，晚年运走算是较一般，但也不差。不过婚姻会有些挑剔不满情绪，另外也会疑心重，个人脾气差而导致感情不太好。
          你的八字属于日主旺比劫旺，印旺，八字财弱七杀虚透无力的组合，八字原局财杀不旺，财运不大，八字原局一般。好在一路大运走的还可以，一路走正偏财，食神生财的大运组合，八字财星得生助，后面事业财运能够有持续发展空间，收入也会随之增长，格局层次也可以得到好的提升，但创业投资当下适不适合的，40岁后再考虑比较好。
          `
  }]
}

export default {
  申时
}