const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1994年三月十四日午时'
  }],
  十神: '偏财   枭神   日元   食神',
  天干: '甲(木) 戊(土) 庚(金) 壬(水)',
  地支: '戌(土) 辰(土) 辰(土) 午(火)',
  遁藏: '枭神   枭神   枭神   正官',
  大运: '丁卯，丙寅，乙丑，甲子，癸亥，壬戌，辛酉，庚申，7岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/480.html',
    命主甲: `2016年我考在乡镇当一名老师，同时在学校兼行政类工作，总觉得不愿意一辈子困在这个芝麻大的小山村，今年2月初九去考了佛山市南海区的教师，落榜了，打算明年继续考，考的不是试，考的是未来和对象。
          女大当嫁，如果走不出农村，我觉得自己是不会论婚谈嫁的，所以感情也是一波三折。
          `,
    珠玑: `八字分析：庚金生于辰月，天干透戊土，为偏印格。庚辰日为魁罡，女命魁罡性格比较刚强，对婚姻有一定的影响。你的八字偏印非常重，壬水食神受克严重，全靠甲木偏财疏土救应。
          事业分析：八字中土旺为印星重容易克制八字中的食神，印旺为忌且克食神，想的会比较多，多是胡思乱想，也容易做出些错误的判断，同时也会比较的固执，压抑，闷闷不乐。
          枭神旺而壬水食神弱被制，也很容易有种怀才不遇的心里状态，自己很不服气，实际在努力时又难到达自己想要的结果和目标。
          八字中印旺，事业面会较为辛苦忙碌，疲惫，工作也要兼顾多方面。在一些工作人际关系问题沟通方面，有些不到位，容易人际关系不和谐。
          八字中甲木财星不旺，壬水食神与甲木财星之间不流通，在八字中也没有强根，所以原局的财运不太旺。而印星旺为忌，想法多，有时容易理想化，不切实际，导致现实中很多事情难实现自己的计划，也让自己容易烦闷。
          好在后面大运走得还不错，一路走正偏财，食神，比劫大运，财大运克旺印主吉，晚年有旺金流通八字泄印，也是好的，可以有小康偏上到中产层次。
          壬水食神可以为用神，教育教师行业是适合你的，印旺为忌，喜财来克印也是好的，同时比劫旺流通印星，所以金融财经，行政相关工作也适合你。方位选择上往正西，正东或正北适合你。
          今年辛丑年太岁土金相生，地支土旺，天干金与大运天干相克，学业考试运是不理想的，2022年壬寅，2023年癸卯都属于食伤生财的运气组合，又是喜神运气，这两年可以好好把握。
          婚姻分析：婚姻宫辰土偏印且伏吟，又自刑，婚姻宫为忌且带刑，正官午火在时支生婚姻宫，增强忌神力量，虽然流通，但有时另一半对你也不算太好，印重而克制食神，也会有婚姻烦恼矛盾，顾虑也较多，另一半的出生条件不算太好，对你帮助不太大，印星旺泄耗正官力量，财星也不旺，有点不利夫的组合。日柱庚辰，戊辰月柱又是魁罡，脾气是比较大，也较为固执，不利于感情婚姻的平稳。
          你的结婚运来看，在2022年食神力量增加，食神生财，八字甲木得强根，克印，地支寅午增强夫星力量时，容易遇到且有结婚运气。
          大运分析：27岁-36岁走的是乙丑大运，大运财克印，为喜神克忌神，属于利大于弊的运气组合，地支丑土印星力量增加，也会辛苦忙碌，有时也会不满的情绪，注意调整好个人心态。天干正偏财克印对感情发展也有帮助，当八字五行流通，忌神被克制的时候，有结婚的运气，但财克印，自己的要求顾虑也会多，也容易烦恼矛盾滋生，特别是印旺的年份。
          37岁-46岁走的是甲子大运，大运伤官生财属于用神大运组合，地支子辰半合，天干甲木力量增加，而木克土，土为阻碍，代表自己事业发展会比较的努力，且能获得进步，收入会收入增加，地支见官星，要注意人际关系。
          癸亥大运，为食大运，生助八字财星，属于喜用神力量增加的运气，运势还算平稳，而食伤旺，自己脾气大急躁些，容易对另一半挑剔而比较多矛盾争吵。
          壬戌大运，天干食神地支偏印，偏印力量大且与月支柱天克地冲，运势发展不算太好，宜求稳发展为好，特别是印旺的年份，婚姻宫逢冲，感情也不太和睦，容易分居，分床，闹矛盾。
          辛酉大运，八字日主得强根，土金水流通相生，属于好的运气组合，可以安享晚年。
          你的八字日主在地支没有强根，印星在地支旺，印星透出的八字组合，加上八字财星不旺克印没有什么力量，很容易有土重金埋，土多木折的问题，同时壬水食神也容易被印制约克制，导致事业发展缓慢，辛苦被动。
          好在后面大运走正偏财，食伤及晚年比肩大运，克制八字印星，使得八字五行相对平衡流通些，事业还有发展提升，格局层次不会低。
          `
  }]
}

export default {
  午时
}