const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1996年八月初六卯时'
  }],
  十神: '枭神   正印   日元   正官',
  天干: '丙(火) 丁(火) 戊(土) 乙(木)',
  地支: '子(水) 酉(金) 午(火) 卯(木)',
  遁藏: '正财   伤官   正印   正官',
  大运: '丙申，乙未，甲午，癸巳，壬辰，辛卯，庚寅，己丑，5岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/382.html',
    命主甲: `今年24岁了，但是一直母胎单身哈哈哈，虽然我不急，心里想要奋斗做事业实现梦想，但是一直以来没人追，我也是很哈哈不知道怎么说，我想知道是什么原因是不是性格不招桃花哈哈。
          希望老师帮我看看事业如何（影视表演行业），我的事业心让我想实现梦想，觉得要实现自己的价值才有动力活下去，我的性格里哪方面容易得罪人呢，容易招惹流言蜚语吗？
          我愿意去避免，会问这个问题是因为我上份工作招惹到别人了，有人说我没看场合说话得罪了是非多的人，其实我是对与错划分很清楚，不会那么圆滑讨好。
          `,
    珠玑: `八字分析：戊土生在酉月，是典型的伤官格八字，伤官格八字喜欢配印，或者见财星。你的八字日坐印星午火，天干又透出丁火正印，偏印丙火不喜，但自坐子水也算有所制约。时柱乙卯官星上下一气，地支伤官见官为忌，全靠印星午火在中间斡旋，但子午一冲财星有破印之嫌。
          所以你的八字喜印忌财。天干乙、丙、丁差点为三奇，因此你本身具有极高的艺术才华和天赋。地支子午卯酉为四正，所以你本性正直不喜圆滑，四正又为才华和桃花，所以你是有异性缘的，只是官星在时柱所以婚姻可能会稍微晚一些，缘分的事不必着急。
          性格分析：戊土日主坐阳刃，八字正偏印透出，说明你为人是有些刚强的，会比较直爽，没什么心计 ，在人际交往，职场关系当中，会注意不到人情世故和谦卑，和领导说话有时候没有分寸，说话不得体，得罪人也不知道。
          八字有印星化正官，又生助日柱，说明你为人是有主见的，八字地支有印星克伤官，又有正官克日主，说明对自己是有约束力的，也相对比较踏实传统，有自制力，比较乐观积极向上，对自己有一定要求。只是有的时候也会想得多，顾虑多，患得患失，优柔寡断，地支有财印冲的隐患，有时情绪会不稳定。
          事业分析：以印比为喜用神，八字中无比劫帮身，年干，月干和日支有正偏印生助帮扶戊土日主，天干印星透出贴身生助日主，对你的事业发展是有帮助的。
          乙木正官在时干克日主力量强，代表事业上容易遇到压力，以及任何事的阻碍，天干有印星可以泄掉些正官的力量，对你事业是有帮助的。
          但是日支午火和时支卯木，为火木的组合，而年支子水和月支酉金为金水的组合，两者容易形成冲克的关系，日支午火逢冲，会导致对戊土日主的生助作用被削弱，同时印星和正官逢破，也有财冲印的隐患，容易导致人际关系不和谐，而影响到你的工作状态和情绪，导致对工作不满。
          天干的喜用神是起到好的作用，但地支用神的力量被削弱些，帮扶力量减弱，结合大运走势看，天干走官杀财的大运，地支走南方火的运气，而天干有木火通关，大运对你还是有帮助的，结合大运来看，整体格局层次不差。
          以印比为用神，官星透出且日主偏弱，从事印比（木火）的行业比较好，八字火为印星也主文化文明，也代表广告影视传媒，可以往影视传媒发展。
          婚姻分析：婚姻宫为午火，午火与月令和时支两两相破，年支月支金水相生欲冲婚姻宫，婚姻宫的状态是不好的，婚姻宫不稳定，也导致你难有好的感情。
          天干透印，地支逢印，印星且贴身日主，伤官又被克破，在感情上会有些想得多，敏感，被动，对感情会有些反应慢，加上八字印星，伤官在年月，夫星不是太旺，也不是很弱，被印星伤官削弱，且又临时柱，时柱主晚，所以你的感情会来得晚些。
          婚姻宫为喜，且印星透出可以泄掉一些正官忌神的力量，但又制不尽，且婚姻宫逢破，所以丈夫对你是有些帮助的，家庭条件一般。
          你现在走的是甲午大运，与八字形成官杀混杂的组合，地支午火增加印星的力量，且临婚姻宫，到流年引动，合动婚姻宫的时候有结婚的运气，2022年天干水木火相生，地支寅午半合婚姻宫被引动，且生助地支婚姻宫的时候，有结婚运气。
          对象175左右，脸型有些方圆，皮肤还算白净，大眼睛，双眼皮，眉毛不是很浓密，五官俊秀，鼻头肉多，嘴唇不厚，声音敞亮，看起来比较的有精神。
          大运分析：25岁-34岁走的是甲午大运，大运杀印相生，力量集中在午火上，午火为喜神，对你发展是有帮助的，但天干与八字形成官杀混杂，也代表做事会有压力，也容易遇到困难阻碍，好在天干印星透出流通，代表遇到问题通过自己的努力可以解决，事业最终可以收获进步，属于好事多磨。
          只是地支有午卯破，也要注意人际关系不太好。而八字地支增加婚姻宫的力量，且八字木火土流通，官杀混杂，代表有桃花运气，但也容易烂桃花，同时午火与地支卯夫星逢破，婚姻宫自刑，感情上会有些分歧矛盾不和谐的争吵。
          35岁-44岁走的是癸巳大运，此大运为财加禄神的大运，大运天干有财生官流通，地支日禄帮身泄正官，力量主要集中在日禄，且没有刑冲破，此大运你的事业会更平稳些，发展进步和收获也会更大。大运官禄相生，五行流通，感情也比较平稳。
          壬辰大运，天干财官流通，丁壬合会有些小的不稳定，地支比肩帮身对整体运势也是有帮助。
          辛卯大运天干有伤官见官的组合，地支卯酉冲，也是不稳定的信息，容易招惹口水是非纠纷，故而运势有所回落宜求稳发展比较好。
          庚寅大运，天干乙庚合，地支寅午半合，八字喜用神无克破，晚年运还可以。
          你的八字日主虽然失令，日主偏弱逢正官贴身而克，但日支逢正印，八字正偏印透出在年干，月干，喜用神在年月引领八字，对正官也有泄化的作用，八字中的喜用神没有严重的冲克，大运的天干虽然不太好，但大运的力量主要集中在地支，且八字五行财官印相对流通，虽然事业上会有压力和阻碍，但通过自己的努力，可以拨云见明月，能够发展进步，比普通人好很多。
          朋友愿意直言不讳的指出你的问题，这样的朋友要好好珍惜，因为他是希望你进步的，你应该好好反思下，到底哪里没做好，虚心请教下自己怎样做更好。而不是固执认为自己是对的，不愿意去改变。如果你做错事了，说错话了，没人指正你，你可能很久都不会意识到自己问题，也很难有提升和进步。
          圆滑其实也是一种换位思考，懂得他人所想的能力。如果你只有一种方法去处理身边的人和事，照顾不到别人感受，沟通中已经让人反感，那么你想要做的事情也很难达成，容易做事受阻，甚至处处不受欢迎。
          但圆滑也是有前提的，对待大的事情要有自己的原则和底线，如果毫无原则，变成了见风使舵，墙头草，也是不好。
          `
  }]
}

export default {
  卯时
}