const 子时 = {
  公历: [{
    甲: '1996-05-14 00:30:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正官   食神   日元   正印',
  天干: '丙(火) 癸(水) 辛(金) 戊(土)',
  地支: '子(水) 巳(火) 亥(水) 子(水)',
  遁藏: '食神   正官   伤官   食神',
  大运: '甲午，乙未，丙申，丁酉，戊戌，己亥，庚子，辛丑，壬寅，8岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3173.html',
    命主甲: `初中时期成绩优异（中考成绩能排全县前5），但在高中文理分科时，由于家长和班主任的原因，最终还是选择了自己不喜欢的理科。由于当时是在理科实验班，虽然成绩在班里中上，但是努努力考个重点还是没问题的。
          结果14年高考的时候，考得特别差，自己都不敢相信。复读了一年之后，仍然达不到期望，能上211但没去。后来18、19年考研，也没考上名校。
          `,
    珠玑: `八字分析：辛金生于巳月，年干透出丙火本气，正官格无疑。正官是吉神，是正气之星，需要得到妥善的保护，否则就是落魄的凤凰不如鸡。子水食神合官本是贵气，但坐下伤官亥水伤官与巳火相冲，大运流年很容易引发伤官见官。
          并且，辛金虽生已火月，但地支全是亥子水，已火之光不再，空有一个聪明的脑袋，却不切实际，无力发挥才能。
          事业分析：八字水多成势，食神高透，食伤贴身，人比较聪明伶俐，喜欢自由，不喜欢被束缚，不适合朝九晚五的工作。食伤较多为忌神，容易目标过高，不切实际，不容易满足，给自己带来很多烦恼和压力。
          原局为正官格，丙火和巳火为正官得令较旺，时干戊土为正印，但天干癸水食神，地支子水食神，亥水伤官均来制了官星，事业心较重，内心不是很安分，比较有能力，也代表控制欲较强，性格急躁，比较急于求成。
          但地支子水食神去克了巳火正官，事业发展中容易犯口舌，对领导和同事不满，招惹是非，这是要注意的。
          巳火正官也为驿马，正官代表工作，地支巳亥相冲，为驿马逢冲，快马加鞭，代表奔波操劳，也代表工作变动较多，难以在一个行业或一个岗位稳定，也适合外出求财，在外地发展。
          辛金在地支无根，且地支一片水，也是代表一生漂泊，难以稳定的信息。八字水多金沉，则才华容易被埋没，不容易出头，贵人运和机遇要差点。
          日主辛金身弱，时干透出戊土正印，但戊土坐子水之上虚透无力，且戊癸相合戊土被合拌，天干虽有丙火，但丙辛相合，丙火难以去生戊土，戊土生扶的力量较小。八字不见财星，只有日支亥水中暗藏一个甲木正财，且寅卯空，则财星空亡。为身弱财弱之命，财运不济，做生意是不适合的。
          八字丙辛相合，丙火为正官，则为正官合身，代表能得到一份不错的工作。但原局无财，则无财之官非真官，不适合去考公务员或入公职行业，也不适合从事管理相关岗位，难以在这方面有所建树。
          你的八字食伤去制了官星，执行力创新力比较强，身弱以印星为用，适合从事学术研究，将来有机会能取得一定学历和文凭，进入科研机构或高校是非常好的。
          但从事学术研究最起码要博士以上学历，从你的八字来看，戊土正印虚透且被合拌，天干丙火正官被合拌无法去生印，则取得博士学历学位是较难的，研究生靠努力还是可以得到，但目标不宜定太高，一般的学校就可以。
          戊土为用来贴身，学习戊土相关专业或从事相关行业要好点，如金融，银行，地产，矿业，农业等，考研究生的话可以考虑相关的专业。
          婚姻分析：八字为正官格，性格比较优柔寡断，依赖性强，人比较多疑，则会为一些小事和对方发生矛盾和争吵，也容易揪着不放，你也是一个好面子的人，婚姻中遇到问题，难以给对方台阶下，则不利于婚姻。
          八字不见财星，只有日支亥水中暗藏一个甲木正财，以亥水代表妻星，妻星不显则异性缘分较差，或求妻的欲望不是很大。但原局食伤较多，一旦谈恋爱，相处久了，又对另一半要求会很高，容易挑剔，不太容易满意。
          日支亥水暗藏甲木正财，为财入主位，是一个对待感情比较专一的人。地支巳亥相冲，冲了妻宫和妻星，代表婚后会有一些不和之事，容易发生争吵和口角。驿马来冲妻宫，也有婚姻变动之象。
          你未来的妻子聪明灵动，身材丰腴，个子较高，长相一般，长发飘飘，行事温雅，人比较阳光，有上进心，从事财务会计，新闻教育，政府机关相关职业。
          地支巳亥相冲，流年逢合才能解冲，2022年壬寅年，地支寅亥相合，寅木正财被合入，则有婚姻缘分要好好把握。
          大运分析：18岁-27岁走的是乙未大运，此大运地支未土被天干乙木盖头，乙木见未土有财星入墓之象，地支子未穿害，未土印星受损，未为财库财星也受损，姻缘较差，印星受损学业受阻，考学运较差，求学路上有很多波折。
          2024年甲辰年，天干水木火土相生，地支辰土正印，这一年考运也很好。
          28岁-37岁走的是丙申大运，此大运为驿马大运，地支申金和巳火相合，又和亥水相穿害，巳火为正官，代表工作会有变动，不稳定，不容易在一个领域长久坚持，在工作上也不会太顺心。
          亥水食神被引动去冲巳火，代表自己想法较多，对工作和上司，同事容易不满，人际关系不好，也容易发生口角是非，导致工作不稳定。申亥穿害也伤害了妻宫，则家庭矛盾会很多，争吵也不断，不利于婚姻的稳定。
          38岁-47岁走的是丁酉大运，地支酉金为辛金的禄神，走禄神大运则财运很好，巳酉半合则正官合身，事业上会比之前要稳定一些，也会取得一定发展。但比肩大运，身体上会比较劳累辛苦。
          48岁-57岁走的是戊戌大运，此大运干支一气为印星大运，天干戊癸相合，戊土被合拌，地支戌土可以去制食伤，官印相生，起到了通关的作用，运势会好很多，此大运要好好把握，有升职加薪的机会。
          后面的己亥大运，庚子大运，己亥大运地支两个亥水去冲巳火，庚子大运地支子水食神去克了巳火正官，不太好，适合养老。
          对你来说，要懂得知足少欲，欲望才不会吞噬你的智慧，则学习，事业，婚姻才能一切吉祥。
          `
  }]
}

export default {
  子时
}