const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正官   七杀   日元   正财',
  天干: '癸(水) 壬(水) 丙(火) 辛(金)',
  地支: '巳(火) 戌(土) 辰(土) 卯(木)',
  遁藏: '比肩   食神   食神   正印',
  大运: '辛酉 庚申 己未 戊午 丁巳 丙辰',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/66.html',
    命主甲: ``,
    珠玑: `此造出生日日干为丙火，所以属丙火命，生在九月，土旺之地，火之墓库，虽有余晖，气极微弱。这是指出生在九个月里的丙火命，一生下来先天就属火弱。弱则喜生扶，不喜再见到有其它削弱火的五行，所以最喜命中其余六个字中有甲木，因甲木为参天大树，松拍之木，既能生火，又能疏土；丙火最忌土重晦光，见有甲木则一举两得。
          现看此造，不见有甲木，只见时支有一卯木（卯中内藏乙木），乃花草灌木，无论生火和疏土，其力皆逊色于甲木，且见辛金盖头（金克木之嫌），其力亦减，无甲用乙，姑且用之。
          再见丙火自坐辰土，更泄火气。幸得年支巳火，丙火日主禄旺之地，是为有根，挽回一分。可惜见癸水盖头（癸水在巳火之上），犹如乌云阴雨遮日，且巳火与日主丙火远隔，其力亦减。
          现转看天干，一辛金生旺壬、癸水，水能克火，用六神用语表达为：财生杀旺克身，自然不是好事。丙辛见合，但不能化水（月令土旺），反被辛金绊合，火力受绊。
          总结上述的五行生克的论述，此造丙火日主身弱，受二个当旺之土泄气，又见金生水旺来克身，只得时支一卯木生扶，和年支一巳火帮助，但两者皆远离日主，且两者都被忌神盖头，可见这二个喜用神都无力。而忌神土、金、水得时，得地，得势。
          得时指忌神土当令，得地指戌、辰土占了地支重要的位置（月支力最重，日支是丙火日主的直接坐下），得势是指忌神二土、一辛金、二水在八个字中占尽优势，可见不会是一个富贵好命。
          因为格局用神的高低为论富贵贫贱吉凶寿夭的主要根据。此造格局配合无情，体现在日主丙火周围全被忌神包围（左边、右边、下方是金、水、土），喜用神在日主丙火的外围（在时支和年支），且被盖头和远隔，这同是也是指用神无力了。
          可能有读者会记得，不是说过，时支像一把称的称陀，称陀虽小压千斤吗？此造中的时支卯木怎么会是远隔无力呢？
          因为这种“称陀虽小压千斤”的情况，只适用于财多身弱的“归禄格”（建禄在时支），或“时刃格”（阳刃在时支），因为经过大量的经验实践，它们已经成为一种可验证的格局了。除此之外，普通平常的格局，时支的力量离日主较远，不够团结，仍当一般地支的力量来看待。
          但假如仅是如此的话，此命只不过是不能致身于青云而取富贵而已，滔滔天下皆是，一生无所发达，也无刑凶。
          不知懂命理的读者注意到了没有，此命还有一个重大的隐患，就是月柱和日柱同时天克地冲，天干壬水克丙火，地冲辰戌相冲。一个八字只有四柱，现其中就有二柱在互相打架，占了半壁江山；犹如有一半的国土在地动天摇，你说会怎样？就是命中的结构不稳定，内中有一条暗藏的裂痕。
          如果这对相冲是对日主或用神有利的话，例如在此造中假如是喜水忌火，则天干壬水克丙火，则是克去忌神，地支辰戌相冲，朋冲土更重，土重可泄火气，则影响就小些。但实际上刚好相反，此造喜火忌水土，则壬水克丙火，就是克去用神；地支辰戌相冲，朋冲土重更泄火气，就显然不利了。
          如果八字的配合在中等以上的格局，这种裂痕还可忍受，不过是应人生某些方面不稳定，某个阶段多变动，不会因裂痕而断裂。但如八字的配合属中等以下的话，就要注意了，尤其在不好的大运或流年，或再遇到有大运或流年冲命中的其它干支时，就可能出现危险，以致生命断裂。
          犹如一辆车刚出厂，内部的机件就带有裂痕，如果此车是靓车的话，还问题不大，万一遇到冲撞，也可顶得过去。如果此车本身就是质量不好的廉价车，在内部的机件里还有一道裂痕时，再发生冲撞，破裂就难免了。
          而此命局属于中等以下的范围（因格局用神属低下），所以再遇到忌神的大运和流年时，就须小心出事了。此命因丙火身弱，命中土、金、水多，取用神当然是喜木、火为用，忌金、水、土。
          查其大运，一出来就遇二十年金运（忌运），八字已不好，再遇这么长时间的忌运，这将怎么过？命中已有一对相冲，再遇到冲就麻烦了。
          查其酉金运与命中卯木相冲（卯酉相冲），金克木，卯木又是命中的用神。秋天刚好是金旺、木死，此两相冲，必然金胜木败，卯木用神被伤，伤用神甚于伤身（日主丙火），危机已伏。
          再查酉运中的流年，有辛亥流年，亥水能冲命中巳火（巳亥相冲），秋天水相、火囚，且命中和大运都金、水有力，此一冲，亦是水胜火灭，喜神巳火被灭。
          `
  }]
}

export default {
  卯时
}