const 寅时 = {
  公历: [{
    甲: '1995-06-03 03:30:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '比肩   七杀   日元   正财',
  天干: '乙(木) 辛(金) 乙(木) 戊(土)',
  地支: '亥(水) 巳(火) 丑(土) 寅(木)',
  遁藏: '正印   伤官   偏财   劫财',
  大运: '壬午，癸未，甲申，乙酉，丙戌，丁亥，戊子，己丑，庚寅，10岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/446.html',
    命主甲: `生于吉林省双辽市。我一直觉得自己命很不好，由于早产，我自小身体虚弱，加上母亲要求严格，父母经常吵架，养成了内向敏感的性格。
          祖/外祖父母去世很早，家境贫寒，父母不得不2007年前往山东烟台打工，在这里我开始了中学生涯。虽然家庭仍然贫穷，但这6年我比较开心，学习成绩也好起来，交到了朋友，在学校小有名气，慢慢恢复了自信。
          2014年我回到老家吉林读大学，好运也再次消失，最近三年尤甚。保研被有关系的同学挤了下来，经过自己努力我仍然考上了研究生，却跟了不好的导师。本来有读博的打算，可导师不给力不得不作罢，现在已经准备找工作。
          我交往过3个男朋友，几乎都是被分手。我前任们都比较一般，而我长相不差，朋友们也说我温和善良，脾气很好。尤其是最近一次分手，没有争执，前任说完分手直接消失，杳无音讯，三个月了我仍然非常难过，再一次陷入自卑的感觉中，不知道为什么遇不到好男孩。
          `,
    珠玑: `八字分析：乙木日主生于已月，天干透戊，可立为正财格。年干透出比肩分财，有辛金七杀克去为吉，但戊土坐下寅木为劫财，而且寅已相刑，戊土的根气被刑坏了，所以正财格破了。然后，我们只有找七杀辛金，天干没有明透丙、丁制杀，地支已亥冲，寅已刑也伤了丙火的根，所以伤官制杀层次也打了折扣。
          日主坐下丑土为杀库，遇到的都不是正缘，寅丑合劫财，对方很容易出轨。
          地支巳亥相冲，巳火得令有力，则亥水受冲不吉，寅巳穿害，则寅木受损不吉。月干辛金得到天干戊土生扶，又来克损乙木，原局用神受损，忌神无制，八字原局一般。
          事业分析：食伤代表执行力落实力，印星代表蓝图计划。八字年支亥水被巳冲克，体现为有时候自己的想法和做法容易不一致，内心较为烦躁，容易对他人不满，且在情绪上表现出来。食伤冲印，做事容易急于求成，缺乏规划，则事业发展会有些辛苦，忙碌吃力，内心的压力相对较大。
          古人看八字，以年柱代表少年时期，月柱代表青年时期，日柱代表中年时期，时柱代表晚年时期。从这个角度来看，早年走印比大运，则学习成绩还可以，但青年时期月柱与年柱天克地冲，印星受损则考学升学运不佳，印星也可以代表导师，导师不吉。
          年柱空亡则祖上不吉，难以得到祖上帮助。印星为用神被冲，而印星代表母亲，母亲不吉，体现为母亲多灾。年柱和月柱天克地冲，则父母不和。
          年柱和月柱均临驿马星，驿马相冲则为辛苦奔波劳碌之象，这样的组合多为外出求财之象，远离家乡对你比较好，才能取得发展，方位上，你适合去北方、东方、东南方，江浙、福建等南方省份不适合你。
          八字身弱财旺，地支巳火去生了丑土，为食伤生财，日主乙木被丑土偏财和戊土正财包身，求财的欲望是较大的，比较注重钱财，也为以后从事多份职业之象。
          戊土在时柱，丑土在日柱，为财入主位，时支寅木劫财去制了财星，财运不错能得财。日主乙木被忌神包身，用神空亡受损，贵人运要差点，难以遇到好的机遇，或遇到机遇却难以把握住。
          你的命格是适合当老师的，时干透出戊土贴身，戊土可以代表讲台，日干乙木可以代表粉笔。八字印星为用，伤官较旺，食伤可以代表付出，奉献，也可以代表学生。
          月干透出辛金七杀星，坐巳火之上，七杀也被制些，适合当班主任或辅导员，在学校从事管理工作。你的八字印星为用，学校也为印，在学校从事教学对你的运势是很有帮助的。
          年干乙木为用，为比肩帮身，要寻求大的平台和合作伙伴求财为宜，不适宜单打独斗。
          分析婚姻：巳火之中暗藏庚金正官，月干透出辛金七杀，为官藏而杀透，这样的组合一方面是要注意婚外桃花，其次是要预防离婚隐患，官藏杀透对于女命婚姻来说是不好的，如同官杀混杂，婚姻感情有离婚的隐患。
          七杀贴身代表青年时期容易遇到不好的缘分，或烂桃花，天干辛金处于两个乙木中间，为争夺之象，也代表早年感情容易失败。而正官暗藏也代表需要你自己主动才可以求得缘分。
          八字食伤冲印，且日坐偏财星，正财贴身，对另一半要求较高，对未来婚姻会有些幻想主义，理想主义，要降低标准和要求，切合实际才可以。日支丑土夫宫中暗藏辛金七杀，也代表婚后心里容易有其他男人。
          月柱辛金七杀坐巳火之上，为伤官克制官杀，容易对丈夫不满，心生抱怨。日柱临华盖，在对待感情上，性格较为内向，内心会有些孤独，这些都是不利婚姻的信息，晚婚比较好，不宜早婚。
          月干辛金见丑则入墓库，则为夫星入墓，你未来的丈夫能力不强，长相一般，身材比较敦厚结实，性格比较有阳刚之气，耿直果断，对你帮助不大。
          大运分析：22岁-31岁走的是甲申大运，此大运天干甲木被地支申金戳脚，地支巳申相合，伤官去合了正官，对追求婚姻和学业的欲望较大。但地支寅巳申三刑，且申亥穿害，原局也有寅巳穿害，寅木阳刃逢冲害，体现为健康不好，也容易发生手术或利刃伤身之事。
          三刑大运则内心压力较大，心里较为郁闷，起色不大，同时这步大运寅申巳亥四匹马全了，奔波动荡比较多。
          32岁-41岁走的是乙酉大运，此大运天干乙木被地支酉金戳脚，地支巳酉丑合金局，去损了寅木。寅木为乙木的根不喜被损，根被损则身体不好，也要防止意外伤害。官杀攻身则压力较大，事业上竞争比较大。天干三个乙木比肩，也要注意其他女性影响你的婚姻和家庭。但比肩帮身的大运，遇到可靠的合作伙伴或平台，也可以去合作求财。
          一般夫星入墓的八字要大运流年冲开墓库，才有利于婚姻落实，2026年为丙午年，地支丑午穿害，且午火为桃花，则异性缘分不错，好好把握可以结婚。2027年为丁未年，地支丑未相冲，冲开了墓库，婚姻缘分也可以，这两年主动找人多介绍，结婚概率很大。
          42岁-51岁走的是丙戌大运，此大运为伤官生财的大运，身弱不担财则要谨慎求财，不能去盲目投资。这步大运也是空亡大运，多做少成，不适合折腾，投资容易破财。天干丙辛相合为伤官克官，则要注意婚姻家庭方面容易不合，甚至会离婚。
          后面走的丁亥、戊子大运运势稍微好一点，丁亥大运天干丁火去克了辛金，地支亥水去生了寅木去制财，这个大运财运不错，但巳亥相冲，印星受损，注意身体健康。戊子大运，天干戊土财星伏吟，地支亥子丑三会水局，去生了寅木，寅木去制财，财运也比较不错。
          你的八字最大的问题是健康和婚姻问题，事业上趁年轻加强学习是改变运势的不二法门，学历、证书、学识等均为印星，可以帮身，能去读博建议尽量争取，博士或博士后读出来去高校去当老师是非常好的。
          晚婚对你好的，八字为晚婚，也适合晚婚。现在把心思用在学习上，30岁出头那时候要把握住缘分，遇到心仪的人不能“守株待兔”，要主动出击，则成功的概率很大，但在择偶上有时候容易幻想理想主义，要注意调整，找一个对自己好的，能包容自己的，
          结婚后多注意脾气经营，不要凡事吹毛求疵，也要适当改变自己的性格，家庭有吵闹是正常的，夫妻更多是床头打架床尾和，过了也就没了，只要不违背大的原则则不要去揪着矛盾不放，这是有利于婚姻稳定的。
          八字劫财在原局和大运中多次被刑冲克害，出行尽量少去开车，平时出行要注意安全，不要去危险的地方，防止意外之事，每年能去医院体检一次最好，注意饮食健康，学习之余多健身，培养一个有益的体育爱好，对你的身体是有利的。
          `
  }]
}

export default {
  寅时
}