const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正官   偏财   日元   食神',
  天干: '庚(金) 己(土) 乙(木) 丁(火)',
  地支: '辰(土) 丑(土) 亥(水) 亥(水)',
  遁藏: '正财   偏财   正印   正印',
  大运: '戊子 丁亥 丙戌 乙酉 甲申 癸未',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/122.html',
    命主甲: `
          `,
    珠玑: `此造出生日的日干为乙木，所以属乙木命，生十二月寒土当令之时，木临衰位，身弱且寒，首喜见火取暖。时干丁火透出，以为可用。
          年、月三土一金，财（土）生官（金）旺，日主乙木身弱，喜印、比扶身为用，刚好见到乙木自坐亥水长生位，以为得地有根，再得时辰亥水生扶（水生木），日主弱而不弱，可享前面财官之福禄。
          日主天干乙木生丁火，指可发挥能力；丁火生己土，能用才能挣到钱财；己土生庚金，通过钱财能得到职位；庚金生亥水，官印相生，有职又有权；亥水再生乙木，印绶帮身，五行周流不滞，以为是好命。
          其实这只是“金玉其外”，从外表上看似乎是好命，实际上分析下来，却是“败絮其中”。
          因为冬令寒木向阳，调候取暖，专取丙火太阳之火，原局无丙，不得已用丁，亦须丁火须通根于午、未、寅、巳等为根；或附丽于甲木，则亦可用。
          而此造地支全无一火、木之根，全是湿土寒水，日主乙木寒湿，时干一点丁火，力微无补于暖，虽有若无。用此似有若无的丁火（才能）去发挥求名利，得到的也必然是虚名假利而己，只是外表上做给别人看，其实是什么也得不到。
          再从地支来看，原先以为两亥水（印星）可以生助日主乙木（水生木），在通常月份下可以这样运用，唯在冬令木寒水冻，日主乙木经此两亥水的浸淫，寒木见水，反生为克。试想下在严冬下将花卉草木泡浸在冰水下的情形，就知是反生为剋了。
          如此一来，乙木日主在八个字中无所适从，身弱且寒这两个问题无法解决：原以为丁火可取暖，无奈地支无灯油、烛腊来支持，怎么也烧不起来。又原以为亥水可以生身，却反而是冻水来伤乙木，再加上年月财官重压下无法化解，而成为忌神，于是一生破财、事非等事难免了。
          取运仍喜木、火、燥土，忌金、水、湿土，中年西方金运，因夫位亥水、夫星庚金皆为忌神，二次离婚，而且二次都反目成仇。
    `
  }]
}

export default {
  亥时
}