const 未时 = {
  公历: [{
    甲: '1995-11-06 13:10:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '偏财   正官   日元   偏财',
  天干: '乙(木) 丙(火) 辛(金) 乙(木)',
  地支: '亥(水) 戌(土) 丑(土) 未(土)',
  遁藏: '伤官   正印   枭神   枭神',
  大运: '丁亥，戊子，己丑，庚寅，辛卯，壬辰，癸巳，甲午，乙未，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/445.html',
    命主甲: `我在当地的一个还不错的二本学校读的大学，但是我以前读书有点反复，主要体现在补习和多读了一年，导致现在我比同龄人晚两年毕业，19年毕业。
          我是19年考入体制内，事业编，当年真的挺幸运的，还没毕业然后回家乡考试，当时笔试是第三，面试时觉得翻盘好难，后来第一名上岸公务员后没来，第二名也觉得第一名太厉害也没来，后来就顺其自然是我得到了这个岗位，
          目前还是想往公务员走，且想往好的城市走，有些命理师说我不适合从政，创业较好，有些师傅又说明年定能考上，且有贵气并能当上领导。
          恋爱一直不顺利，都是昙花一现居多，去年也谈了两个，都是以分手告终。婚姻方面，很多师傅都说我可能以后会离婚多，要破解的话能嫁个二婚的或者异地或者岁数较大的，可以有效避免，所以我对婚姻的期望值也不是很高，
          但是目前是有一位很优秀的且比我大12岁的国企老总追我，我不知道是拒绝还是考虑，一是年纪相差太大，且容貌气质一直不是我所追求的。二是他二婚，但是前面只是领证三个月就又离婚了。因为算命都说我婚姻不是很平稳，所以我就很纠结，因为他人对我确实很好，资产也可以。
          `,
    珠玑: `八字分析：辛金日主生于戌月，为正印格。丙火官星坐戌库有力合身，丑未戌三型旺了火土，官印相生格局成立，只是官弱印旺，有些不平衡，不过从政是一定的，不管你是否愿意，命运就是这样安排的。八字土重，幸好有亥未拱卯财星制约旺土，从而助起官星，整体而言是个不错的八字。
          从调侯的角度来看，辛金为成型的珠宝，好比是金银首饰，自然是怕土太旺了，会弄脏珠宝，没有了光芒，最怕土多金埋，则才华难以外露，喜水来洗金，才可以现出光芒。
          从原局来看，戌月出生土得令较旺，地支一片土气，则土重金埋。年支虽见亥水，但亥水在地支被土所克，没有金来生水，水难以洗金，格局层次不高。
          事业分析：原局天干相合，地支冲刑，天干多为用，地支多为忌，则性格上表面光鲜，内心纠结，也表现为表里不一。而地支丑戌未三刑，土土相战，旺了印星，也代表人比较固执，本质上脾气比较差，容易焦虑，敏感多虑，思想比较极端，容易冲动。
          水为食伤，水也代表智慧才华，土多损水，思维比较僵化，容易一根筋。丑戌未为恃势之刑，也为无恩之刑，且为忌神，容易和人反目成仇。
          《滴天髓》上对丑戌未三刑也有论及，只要不透天干戊己则不凶，你的八字不见戊己透出，倒也算吉的地方，大的灾祸是不会有的。
          但八字有三刑为忌，内心会较为郁闷，而且易生暗疾，年支亥水被克损，亥水食伤为寿元，构成枭神夺食，则健康受损，容易有慢性病，尤其是脾胃容易出现疾病。
          土旺水弱，也容易有结石和肾脏、肝胆的疾病。但地支相刑也代表你人是比较上进的，也有吉的一面。
          天干乙木为财星，乙木见未则入库，未土在时支，则为财星入库，又有亥水食伤来生财，财运本还是不错的。但乙木财星透天干挂两头，一个入墓，一个财源被印克，为不聚财，漏财之象，赚得多花得多，所以不适合去投资创业，也容易发生过失。
          天干丙辛相合，丙火贴身为正官星，则为正官合身，八字财官印全，且财星乙木来生了丙火正官星，有财之官为“真官”，很适合在机关事业单位上班，考公务员是很适合你的，只要用心去努力便可以获得。
          一旦考上公务员要加强自省自警自励，因为你的八字三刑很容易犯口舌，犯是非官非，违背原则和纪律的事一律不能碰，一定要切记。
          婚姻分析：你的八字丑戌未三刑，日时丑未相冲，则婚姻宫受损，容易有离婚问题，婚后幸福感较低。日柱和时柱临华盖，也代表自己会有些对感情看淡，孤独之象，早年会有几次失败的感情，不过也相当于应验了八字所带不利感情的信息，早年感情失败，后面会好些。
          而八字印星较多，印星也是守护神，也代表自我保护，但印星太多，且被三刑刑旺，则说明有的时候容易过度保护，放不开，思想比较保守和传统。
          土旺而克水，对待感情不够聪明，比较多疑敏感。容易沉浸在一些感情幻想当中，并且放松警惕的时候容易过度相信他人，在感情上容易吃亏。
          月干丙火正官代表丈夫，丙火见戌土则入墓，为夫星入墓，地支印星也是来泄正官的，但地支丑戌未三刑把丈夫解救出来了，故而也为婚姻不顺之象，结婚的过程会遇到很多波折，尽量晚婚为吉，早婚则婚姻易败。
          你的命格是有不利子女的信息，月令戌土去克了年支亥水，构成枭神夺食，且时柱又见未土枭神，则子女缘分弱，子女迟。年支亥水被克损严重，且无金来生水，容易患肾脏、妇科方面疾病，在要孩子的时候最好先调理好身体。
          大运分析：22岁-31岁走的是己丑大运，此大运为印星大运，原局土太旺则不喜再见土来加强印星力量，前面讲过，地支丑戌未三刑，则天干不喜见再戊己土，这步大运地支丑土引动丑戌未三刑，土土大战，对你是不利的，要注意是非纠纷，凡事退让为吉，不要参加危险的活动运动，注意出行安全，也要注意母亲身体健康。这步大运自己心情容易不好，也容易烦躁不安，甚至自我封闭，情绪不稳定，要注意调整。
          32岁-41岁走的是庚寅大运，此大运为比劫克财的大运，地支寅木去合了亥水，用神不喜被合，被合则不吉。亥水被合则天干乙木没了元神，又乙庚相合，庚金去克了乙木，则工作上竞争压力比较大，事情也比较繁多，也为破财之象，这个大运要注意理财。
          42岁-51岁走的是辛卯大运，此大运也为比劫克财的大运，这步大运有吉也有不吉，吉的地方在于地支亥卯未合木局，木来疏土为吉，也解了原局的丑戌未三刑。不吉的地方在于天干丙辛相合，则两个辛金来争夺丙火正官星，则一方面工作上竞争压力大，另一方面丈夫容易有出轨之事。
          52岁-61岁走的是壬辰大运，此大运为印克伤官的大运，伤官为思想，则这十年烦恼会比较多。尤其需要提醒你的是，地支辰戌丑未全了，则女命逢之不吉，辰戌丑未会土局，地支全是土来克亥水，枭神夺食，身体健康会出问题。
          婚姻上则看淡一些，你需要的是一个家，对感情期望越大，越在乎则越会受到伤害，反不如放下执念，心平气和对待。
          找一个比你大一点的人结婚是可以的，你的性格很容易相信别人，建议要多方面接触考察，找熟人朋友介绍更好些，知根知底，一定要人品各方面要信得过才可以。
          `
  }]
}

export default {
  未时
}