const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   七杀   日元   食神',
  天干: '辛(金) 丙(火) 庚(金) 壬(水)',
  地支: '酉(金) 申(金) 戌(土) 午(火)',
  遁藏: '劫财   比肩   枭神   正官',
  大运: '丁酉 戊戌 己亥 庚子 辛丑 壬寅',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/57.html',
    命主甲: ``,
    珠玑: `此造出生日日干为庚金，所以属庚金命。庚金属阳，最为刚健，可以想像为钢铁、剑戟之类。生在七月，刚好又是申金当令之时，刚锐极矣。
          再看年柱是辛金、酉金年，再得两金相助；自坐戌土，地支更成申酉戌三合金局，刚上加硬了。常人中有一种说法，说某人命硬，如果自己日主的五行在八字中过于强旺，克泄无力，这就是命硬的其中一种。
          但凡事凡物，过刚则易折，不是好事，正格以中和为贵。此造金过于强旺，极需见火炼方成大器，化顽铁而成精金。
          现见此造丙火透出，植根于午火可用，虽说锻炼庚金，专用丁火（炉火）。无丁，不得已用丙，亦为可用。唯丙辛一合，火已失力，更见时干壬水相克，丙火受伤。
          地支虽见午戌半合火局，但不敌申酉戌三合金局，七月丙火病地，金旺、火囚，不见有木来化水生火。全局金过旺，火过弱，无力炼金，且已看到丙火为壬水所克，用神无力、受克，不会是佳造。
          用个故事来比喻的话，此命就像一大堆废铜烂铁（庚辛申酉金），想将它炼成钢，但缺少炉火（丁火），也没有木柴（木），只靠一个秋日的太阳（七月丙火）来夕照，且太阳又被大水（壬水）遮挡，你说怎炼成钢？这个命就是这样子了。
          这个是女命，在这个女命中是以火为丈夫，金为自已（可参考命理书六亲部分），通过上面分析，自己实在过于强硬；丈夫过于孱弱，丈夫在八字中处于病、囚之地位，假如只是这样，只是表现出“妻管严”的欺夫之象而已。
          但现在天干又出现了壬水克丙火，丙火是夫星，秋月水相、火囚，且命中金多生水，这个丙火夫星就能被壬水克倒。所以就从这个八字中已经看到了夫星病囚孱弱，且会被克倒的现象了。
          至于出现时间，在中年庚子大运，庚子流年，双重子水冲走午火夫星之火根，双重庚金生旺命中壬水，加强了水力，克灭了夫星丙火。
          `
  }]
}

export default {
  午时
}