const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1996年十一月十二日卯时'
  }],
  十神: '正财   正印   日元   食神',
  天干: '丙(火) 庚(金) 癸(水) 乙(木)',
  地支: '子(水) 子(水) 巳(火) 卯(木)',
  遁藏: '比肩   比肩   正财   食神',
  大运: '己亥、戊戌、丁酉、丙申、乙未、甲午、癸巳、壬辰、辛卯，7岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/531.html',
    命主甲: `目前是一个宝妈，觉得人生很没有方向感，感觉不积极了。
          从小我觉得我爸爸很吓人，我看到他都是躲着，他一瞪眼我就立马吓哭。他对我的态度很不好。反正童年他对我来说是可怕的。
          我16年结婚，17年18年怀孕二次都没有保住胎，过不了三个月就胎停育了。那二年一直是我最黑暗的二年！当时觉得为什么我要这么苦。我现在的老公对我挺好的。这也是我觉得老天对我还不算太差。就是我俩喜欢争吵。吵过也就好了。
          目前大女儿二岁多了属狗，儿子六七个月属鼠
          我们最近几年财运很差干什么赔什么。不是在那个城市就是在这个城市。觉得很奔波没有个定所。我老公是做美发的可是不挣钱的工资很少。现在美发也不干了正在迷茫期。
          `,
    珠玑: `八字分析：癸水生于子月，为建禄格，年支也为子水，禄神两重。子卯相刑，禄神和食神两个吉神有点不合。乙卯食神，丙火、已火正财，食神生财，走木火运比较好。
          事业分析：八字身旺比肩旺，为人会自尊心强，要面子，主观意识强，比较固执，比肩旺而无制，庚金正印贴身，气量会较小，也容易导致影响到人际关系。时柱乙卯食神泄秀，乙木食神高透，则野心较大，不安于现状的一个人，但也代表具备做出一番事业必备的坚持和坚韧。
          癸巳日出生为日贵格，日支巳火临天乙贵人为吉，八字水旺，无土制水，本偏湿偏寒，但年干透出丙火，起到了很好的暖局之用，《滴天髓》将这种格局称为“一阳解冻冰，龙吐气成云”，被称为中国易学传播第一人的邵伟华先生和你的八字类似，也是这种格局，有机会在事业有所成就。
          时柱乙卯食神泄秀，临文昌贵人，天乙贵人和学堂，口才较好，可以依靠才华去立身，有机会获得名气，天干丙火有文化之意，丙火在年，卯时出生，有声名传播四海之象。能从事艺术，文化教育，技术等相关行业，有机会成就自己，你现在还年轻，从现在开始努力，一切都不晚。
          但美中不足的是，八字天干乙庚相合，地支子卯相刑，乙卯食神被刑克，在事业发展中会遇到不少的阻碍，并不顺利，要付出更多努力才有机会。
          地支卯木去生巳火，为食神生财的组合，财星得生旺，但巳火正财被两个子水比肩所制，构成比肩夺财，巳火临元辰，代表耗费花销很大，年柱丙子也为比肩夺财的组合，丙火从巳火中透天干，也有花销多的象，这个财很难为自己所得，会因为身边的亲戚朋友而花掉。
          年月子水为比肩星，也为禄神，禄神重重则不贵，会比较奔波辛苦，但辛苦并非是坏事，有回报的付出就不是真辛苦，想做好任何事不付出辛苦努力难有成就。天干丙火去制庚金，为财星制印的格局，可以开店求财，但不能合作求财。八字食神泄秀，不见官杀星，可以发展自己的事业，方位选择东，南，东南，东北，西南这几个方位比较旺你。
          婚姻分析：月干庚金印星贴身为忌，比肩得令较旺，喜欢以自我为中心，不容易妥协退让，夫妻间很容易相处不快，八字金水较旺，肾气较足，会有些好色的一个人，要多注意。
          八字不见官杀，只有日支巳火中暗藏戊土正官星，正官藏而不显，丈夫条件较为一般，也表示婚姻较为稳定，不易发生二婚，巳火临天乙贵人，且巳火正财为用，丈夫人较为善良，对你较为不错，夫妻感情总体较为融洽。
          子女分析：八字身旺，乙卯食神泄秀，乙卯食神在子女宫，临天乙贵人，文昌贵人，学堂，比较旺女儿，未来女儿有出息，有能力，比较聪明伶俐，孝顺父母，晚年有靠，从儿女属相来看，不克父母。
          2017丁酉年，地支卯酉相冲，造成枭神夺食，不利怀孕，即使怀上，也很容易发生流产，保胎较难，逢鸡年要特别注意女儿身体健康。
          大运分析：27岁-36岁走的是丁酉大运，此大运地支酉金被天干丁火盖头，为财星制印的大运，天干丁火去制庚金印星为吉，但正偏财双透，开销较大，财星制印则会因为买房花销较大。地支卯酉相冲，卯木食神被冲克，事业上会有阻碍，财源受损，求财比较波折，容易破财，也造成枭神夺食，要注意自己和女儿身体健康。
          37岁-46岁走的是丙申大运，此大运地支申金被天干丙火盖头，地支巳申相合，也为财星制印的组合，此大运财运好转。但地支巳申相合，合动日支婚姻宫，要注意第三者插足干扰你的婚姻。
          47岁-56岁走的是乙未大运，此大运地支未土被天干乙木盖头，为食神制杀的大运，在事业上能有一番作为，但天干乙庚相合，乙木被合克，表示困难和阻碍还是不少，需要付出一定努力，地支子未相害，要注意肾脏，脾胃方面诱发疾病。
          甲午大运，为伤官生财的大运，总体财运不差，可以赚到钱，但地支子午相冲，有比肩夺财之象，不要轻易投资，也不要借钱给人。癸巳大运，地支巳火被天干癸水盖头，为比肩夺财的大运，则花销较大，要注意理财。
          `
  }]
}

export default {
  卯时
}