const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   七杀   日元   伤官',
  天干: '壬(水) 壬(水) 丙(火) 己(土)',
  地支: '午(火) 子(水) 申(金) 丑(土)',
  遁藏: '劫财   正官   偏财   伤官',
  大运: '癸丑 甲寅 乙卯 丙辰 丁巳 戊午',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/70.html',
    命主甲: `夕阳无限好，哪怕近黄昏`,
    珠玑: `此造出生日的日干为丙火，所以属丙火命，生冬令十一月，子水当旺之时。时值寒冬，体绝忘形，日主丙火，孱弱极矣。想像一下，如冬天十一月的太阳，你站在户外，即使在阳光照射下，你也不会感受到温暖，可见火力孱弱。
          再见自坐申金位，更是丙火病地。天干透出二壬水克火，犹如站在冬日的太阳下，已不觉温暖，此时还有两桶水从上面淋下来。再见时柱是己丑湿土，一点阳威，亦泄之殆尽。此时丙火有即是无，想必入“从弱”的特别格局来处理。
          八字论命格局有正有变，正者就是普通的格局，乃循五行的常理取用。变者就是特别的格局，从五行的气势而取用。凡百事物，均有这种现象。唯八字之中，正格十有八九，变格不过一二而已。
          举例来说，水在通常状态下是液体，在一个大气压下，加热到100度以上时，就会成气体（水蒸气），或温度下降到零摄氏度时开始结冰，成为固体。假如将这液体的水称为正格，那么气体的蒸汽或固体的冰就相当于变格，其蒸汽可象征是“从强、从旺”等特别格局，冰块可象征为“从财、官、食伤、从势等从弱格”.
          当然，比喻可能不十分适当，因为从弱格是变化了日主的性质，而冰块还是由水分子组成的。例如此造如果是当从金、水、土强势之从势格，就不当丙火日主来算，而是跟随了土金水的大气势来算了。
          看到这里，可能有明眼的读者会发现，还有年支午火你未算进去，午火是日主丙火之强根，帝旺阳刃之地，有此强根的支持，不能入从势格，正如命书说：阳干从气不从势，阴干从势无情义。
          是的，只要有午火强根，丙火日主之气未绝，就不能入从弱的特别格局。唯在此造中，月令子水冲午火（子午相冲），冬月水最旺、火最衰；且地支再见申子半合水局，加强了冲午火之力；午火头顶盖着两个壬水，全局金水汽势鼎盛，午火孤掌难鸣，火之气已灭，故此一冲，必旺神冲衰，衰者拔，就有可能将午火冲去，而成“假从势格”,从土金水旺神。
          但假如换成午火在月支、子水在年支，同样子午冲，但月支是提纲，力重。午月是夏天五月，夏月火最旺，水囚（次衰），丙火日主深得月令之气，尽管周围金水势力众多，也不能从，就是“阳干从气不从势”的意思了。
          上面是从字面上的分析，但气有进退，也有天时、地利、人和的影响，例如出生在大陆南方的海南岛，那里冬天十一月也不太冷，火之原质犹存，就有可能不入特别格局的从势格，所以也不是绝对的。
          看过许多命学前辈论的命，有些看上去明明不会入从格（特别格局），却是当从格算。有些看来必入从格的命，偏偏又不从，仍当正常格局来算。所以，执著于字面的争论于事无补，不如将其人已过去的经历套进大运去验证，以此反证法，便可轻易地得出从与不从的结论来。因为一个八字当作正常格局来算，或当特别格局中的从格来算，其所取的喜、忌神很多时候是正好相反的。
          例如此造，如不当从金水土旺势的从势格来算，仍当正常格局八字来算，则明显丙火身弱，喜木、火大运为用，忌土、金、水运。那未，最好的运应该是青年的甲寅，乙卯木运，及中晚年的丁巳、午火运。晚年走己未、庚申、辛酉土金忌运，必然日落西山，暮气沉沉，晚景不佳。这是正常格局的运势。
          现看其本人亲身经历，甲寅木运中二十岁丧父，从此承担了一家大小的生计，仅有小学学历。可见早年木运不利。后来的午火运中再一次受打击，一无所有，证得火运不佳。
          反而在六十五岁的己未土运时东山再起，经过庚申金、辛酉金，二三十年的土金运，成功地重创事业，到九十一岁才卸下职位，享年九十八岁。可见，此造是假从势格，因喜土、金、水运，忌木、火运。
          此造青年走木运，中年走火运，即六十五岁前基本上是逆运，早年艰辛，中年事业反复无常，得而复失，一无所有。正当绝望之时，六十五岁后才东山再起，晚年才入好运三十年，正是谁能笑到最后，才是笑得最好。
          此例给于人们的启示是：一个人少年、青年不走运，中年也劳碌奔波，一事无成，未必是坏事。只要不是一个意外早夭或凶险的命，每个人总有一段属于他自己的好运，就看这段好运摆在什么时期。
          因为大运是从月令数起，顺行或逆数，像此造冬天出生，先顺行走东方三十年木运，到中年三十年火运，再到晚年三十年金运。如果是正常格局喜木、火，则好运就摆在前面六十五岁前，风生水起，赚个盆满碟满，得心应手，左右逢源。但到晚年六十五岁后运入土、金忌运之地，气运逆转，要不是事业破败、家庭破碎，就是身体不适。
          什么高血压、心脏病、糖尿病、帕金森综合症都上来了，或瘫痪在床，你有过亿家产又如何呢？人到晚年，身体健康才是最大的财富，没有了身体健康，其它的一切都是零，豪宅、名车、豪饮、豪食、过亿家产也无福享受。
          所以一个人好运不要来得太早，早年、青年艰苦些能承受得起，当作磨练自已，积累知识和人生经历，不要羡慕他人，不要和早成功的人比较，每个人的开花结果期不同而已。君子固穷，但千万不要为了钱，而做出缺德害人的事，否则日后好运来时，就行不起了。经受得起考验后，终有一段属于自己的好日子。即使不成富贵，但晚年迎来个衣食住无忧，身体健康，悠闲自在度日，亦不枉此生。
          `
  }]
}

export default {
  丑时
}