const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1995年十月十九日酉时'
  }],
  十神: '比肩   正财   日元   比肩',
  天干: '乙(木) 戊(土) 乙(木) 乙(木)',
  地支: '亥(水) 子(水) 亥(水) 酉(金)',
  遁藏: '正印   枭神   正印   七杀',
  大运: '丁亥，丙戌，乙酉，甲申，癸未，壬午，辛巳，庚辰，己卯，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/540.html',
    命主甲: `从事装修设计行业，从我实习的时候说起。2017年10月大学校友给我介绍一个比我小一届女孩，跟她相处一段时间，我那会觉得两个人都还小，恰巧我要出去实习不能耽误她学习，所以就没在一起。2017年11月外出实习，找的第一份工作还是可以，虽然苦了一点，但对未来满怀期待。直到后来2018年3月跟公司领导发生口角，我一气之下主动辞职，辞职申请时人事看我各项还是挺不错的，就暗自操作进行了门店内部的调换。
          2018年3月到6月这段时间就返校完成学校的任务。2018年7月大学毕业，来到这新门店，上班前几天感觉这里的环境比之前门更适合自己，也是我想要的那种工作状态，所以就一直在这里工作很久。那个时候和一位同学相处，不过是异地城市，见面几次，对她追求的想法，却被她拒绝。此后联系便少了。2019年3月同事给我介绍一个女孩子，也是刚相处一个月不到就出现争吵，后来也没成。
          2020年1月再一次偶然机会又跟2017年认识的那个姑娘好起来，后来见过几次面，那会处于异地，不过到了7月出现了矛盾，女孩觉得跟我相处看不到未来，而且她也不想远嫁，觉得跟我在一块有点浪费时间，她妈也不同意远嫁。为这个小女孩我辞去了这份工作，要去她的城市找份工作，可是我辞职女孩也不让我去她那边。
          2020年下半年工作也辞职了，自己也抑郁了一段时间，吃不下饭，天天躺在床上。十月份才逐渐好转。有同事给我介绍了新的一家公司，待了几个月，发现并不是我想要的，还不如我的第一个公司，和那些同事相处不来，我那会很后悔自己冲动辞职，我对自己没信心了就一心想着回家发展。
          2021年初在家里找的那个工作，还是一开始不错，后来老板没有按时兑现承诺，发工资也不是很准时，工资三个多月才发两次，对于每个月要还7k房贷的我觉得在那上班就是浪费时间，我自己主动辞职后来就一直在家，就在家办公，现在很迷茫不知未来什么样子。
          从毕业这些年在工作上遇到很多不顺心的事情，也会觉得跟自己性格有关系，也有时候觉得命中注定。我在第一公司上班这些年，比别人吃苦很多，经常一个人加班很晚才回去睡觉，一个人扛着很多事情，每天的任务很多，特别地累，没有自己的时间，每周休息的时间都拿来上班了，只有这样才能达到自己想要的收入。
          而且这些年接触过很多女孩子，都很难成功，往往出现了我喜欢的追求不到，喜欢我的我却一点感觉都没有，自己这些年经历的感情折磨，都害怕再去接触新的女生，自己在婚姻上比自己工作更迷茫，也不知道什么时候能遇到自己的另一半。
          `,
    珠玑: `八字分析：乙木生于子月，为偏印格，左右亥水正印，又有酉金生之，一片汪洋大水，戊土虚又无火，虽然天干三透乙木，但有水泛土漂之嫌。
          事业分析：八字子水枭神得令较旺，人不够大气豁达，天干乙木比肩，有的时候比较固执，个性要强，缺乏圆融，容易死板，钻牛角尖，也容易思虑重重，想法较多，有的事情决定了，不到黄河心不死，即使别人好的意见，也听不进去，不撞南墙不回头。
          八字不见食伤，不会迂回婉转，比较直肠子，不太会与人打交道，人际关系不太好，与人相处上容易吃亏，地支亥亥自刑，遇到事情容易想不开，也容易抑郁纠结，要预防心理疾病。
          比劫多，事业上竞争大，容易犯小人，遇人不淑，与人合作容易被排挤针对，相互之间多以不愉快告终，不适合合作求财，上班求财也要注意人际关系。
          月干戊土为正财，八字不见食伤来生财，财星较弱，财源不稳，求财的机会和门路较少，容易产生负债，年支和日支亥水，月支子水，五行水旺，虽然月干透出戊土，但戊土无力制水，成为漂浮之财、虚透之财，命理的财富能量不大，财富波动较大。
          天干三个乙木去制戊土，构成比肩夺财，付出辛苦努力，但收获甚微，辛苦挣来的钱容易因为各种原因花出去，财星虚透天干不聚财，花销大，为财来财去之命，平常要注意理财比较好。
          八字比肩多，从事的工作多比较辛苦，需要付出更多体力劳动才可得财，一分耕耘一分收获，不宜有太多妄想，安稳上班求财，能有一技傍身最好。
          你之前从事装修设计行业属火，是适合你，尽力把业务学精，靠本事吃饭为好。但你八字乙木日主在地支无根，地支水太旺，逢金水流年运气，容易水多木漂，做事会不坚定，半途而废，不够踏实，也有走捷径的想法，这是要克服的。
          婚姻分析：八字印旺比肩多，性格脾气不太好，也比较细腻敏感，疑心较重，心眼不大，内心缺乏安全感，控制欲比较强，恋爱中容易表现出强势的一面，久而久之给对方不自在，不舒服的感觉。
          八字枭神得令，命局缺火，容易有一些阴暗的想法，脾气有时候古怪，感情中喜欢去试探对方，搞的大家都很累，八字不见食伤星，情商不高，不太会关心体贴人，另一半感受不到温暖，不利于感情的维护。
          月干虽然是戊土正财代表另一半，戊土坐子水月令且地支无强根，身边异性不容易把握住，擦肩而过，错失良缘，同时天干三个乙木比肩去制戊土，也代表感情竞争阻碍大，自己在感情相处中，不那么占优势，自己看的上的，看不上自己，容易被其他男性夺去，一方面自己要克制感情中不好的毛病，另外一方面多主动为好。
          戊土正财坐子水桃花，要注意另一半身边的异性缘分，防止其他男性干扰，被其他男性所吸引，日支婚姻宫为亥水忌神，亥亥自刑，婚姻宫被刑伤，婚后夫妻感情较为一般，磕磕绊绊较多。
          对象相貌朴实，脸型较圆，肤色白中透黄，体型偏胖，个子不高，和你年龄相仿，原生家庭一般，对你有帮助，但帮助有限。
          今年辛丑年，地支丑土为偏财星，亥子丑三会水局，会动婚姻宫，异性缘分不差，2022壬寅年，地支寅亥相合，合动婚姻宫有结婚之象。后面2024甲辰年，地支辰土为正财星，红鸾星入命，也有结婚的运气。
          大运分析：22岁-31岁走的是乙酉大运，此大运天干乙木被地支酉金截脚，天干四个乙木，事业上竞争非常大，地支酉金七杀虽然可以克比劫，但也生水，容易遇到两面性小人，与人相处有很多障碍和不快，不顺心之事时有发生，很容易被排挤坑害算计，人际关系达到“冰点”，这是要注意的。四个乙木去制戊土，比肩夺财，容易被朋友同事，上司把钱财夺去，金钱往来上要谨慎。
          32岁-41岁走的是甲申大运，此大运天干甲木被地支申金截脚，天干甲木和乙木产生竞争的态势，甲木为乙木之依仗，事业上容易被其他人抢风头，占先机，自己不容易出头，劫财也去夺财，花销也比较多，不聚财。地支申亥相害，婚姻宫亥水受损，婚姻环境不太好，夫妻矛盾多，幸福感不高，要学会忍让包容，克制自己的性格缺点。
          42岁-51岁走的是癸未大运，此大运天干癸水被地支未土截脚，为财星制印的大运，天干戊癸相合，戊土财星被合拌不吉，用神被合要注意身体健康，地支子未相害，未土财星受损，容易有花销，未土为湿土克水，也有些小的发展进步，但提升幅度不大。
          壬午大运，地支午火被天干壬水盖头，天干壬水旺了乙木比肩星，地支子午相冲，午火食神受损，枭神夺食，要注意心脏，血液系统等方面疾病，午火为财之源，财源逢冲，财运不好，赚不到什么钱，财运波动大，花销也不少。
          辛巳大运，天干辛金被地支巳火截脚，和命局日柱天克地冲，命运容易发生较大波折，地支巳亥相冲，巳火被冲克，则要注意心血液方面疾病，也要注意调试心理健康，此大运财运也较为一般，前期要注意好理财。
          你的八字人际关系方面是要注意的，也容易工作不稳定，频繁多变，不利于你的积累发展，自己也要认清当下现实，看清楚自己的能力，年轻人参加工作很多时候不是自己选择别人，而是别人选择自己。
          `
  }]
}

export default {
  酉时
}