const 戌时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '伤官   枭神   日元   食神',
  天干: '己(土) 甲(木) 丙(火) 戊(土)',
  地支: '未(土) 戌(土) 申(金) 戌(土)',
  遁藏: '伤官   食神   偏财   食神',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/219.html',
    命主甲: ``,
    珠玑: `此造出生日的日干为丙火，所以属丙火命。生于九月，墓库之地（指火势衰弱），虽有余晖，然土旺主事，火气极微弱。犹如九秋的太阳，浮云无光。
          再见自坐申金病位，年未、时戌，再添二土，丙火日主在地支中无强根（无午、巳火），也不见有木（印）生扶，反见三土一金，日主极度衰弱无援。
          再看天干，透出戊、己两土，此时全被旺土所包围。忽见有一甲木在月干，以为救兵已到，可以用甲木来破土生丙火，试图解救围城之困。谁知走近细看，却大失所望，原来甲木是叛将，对方使用美人计，将己土嫁给甲木，和甲木联婚，甲己合而化土（因月令戌土当旺，又地支三土，干透二土，全局土之气势旺盛，足能化土）。
          联婚后的甲木已化土，投靠敌方，当然不能去解救丙火了。就是说：甲木原想来救丙火日主，解围城之困，谁知大军来到城下，却见敌军势力重重，寡不敌众，
          敌军首领戊又以自己的妹妹（己土）嫁给甲木（戊和己分别是阳土和阴土，两者就像兄妹一样。甲木本来可克戊土，戊土将己土给甲木做妻子，就像古代的和亲一样，甲木与戊土成了亲家，当然是弃甲投降化为土了。因为甲己结合后可化成土）。
          如此一来，日主丙火在众土包围之下，救兵又投入了敌阵，完全没有生存的机会下，只好向敌军（众土）举白旗投降，顺其众土的大势而去，这就构成了特别格局中的从土格，而土在这个八字中是丙火日主的食神、伤官星，所以可称为“从食伤格”，而火能生土，土是火日主的儿女，又可称“从儿格”。
          从食伤（儿）格的构成：日干不通根地支，且不见印、比劫、禄刃的帮助，食伤一定要在月令提纲，或地支会合食伤局，天干竞透或四柱多见食伤，旺气偏于食伤一行，日干盗泄太甚，弱不堪扶，则应以从食伤格论。
          行运喜食伤、财，比劫无妨。行印运因能克制旺神食伤，祸患立至。行官杀运与食伤对敌并能生印克身，亦以为忌。
          这里要注意的是：从格中除从强、从旺或从气以外，其他各种从格，例如从官煞、从财、从势等，都忌比劫，只有从儿格，不忌比劫。因比劫能助食伤，故不以为忌。
          所以有“从儿不管身强弱，只要吾儿又见儿”的说法。就是说，从儿格四柱虽有比劫，但比劫仍去生助食伤，所以不忌（当然比劫力量不能多过食伤）。但局中必要有财星，以成生育之意，因食伤可以生财星，这就是“吾儿又见儿”的意思。
          在此例中，日支申金就是财星。全局之富贵就在于有此申金，假以将申金换成戌土，虽地支四土，但不能流通土气，且地支四土全是燥土（未土是六月之燥土），从格虽真，然火炎土燥，燥土万物不长，反而是不佳之命。
          此造全凭有此申金，申金内藏庚金、壬水，庚金可泄旺土之气，壬水可润戌土之燥，庚金是财星，壬水是官星，能发挥才能取得富贵，俱在此矣。
          命书《滴天髓》云：从神还有吉和凶，木火伤官气最燥，若无金水木化灰，火土伤官命也亏。可见，不是一入从食伤（儿）格，就必定是吉命，还须看全局气势。所以从儿格中以水木、土金、金水从儿为美，若木火，则木被火焚；火土，则土多火晦，或火炎土燥，子旺反伤其母，必非佳造。除非像此例见有申金财星，有金水润泽，方能富贵。
          所以此造行运喜土（食伤）、金（财），火（比劫）无妨。忌行木（印）运，因能克制旺神土（食伤），祸患立至。行水（官杀）运与土（食伤）对敌并能生木（印），本以为忌。但此造出于调候润土，亦为可行。因为燥土遇水，虽土水相克，但水能起润土作用，水被润土吸收，反而有利之故。
          `
  }]
}

export default {
  戌时
}