const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '伤官   伤官   日元   枭神',
  天干: '壬(水) 壬(水) 辛(金) 己(土)',
  地支: '戌(土) 子(水) 巳(火) 丑(土)',
  遁藏: '正印   食神   正官   枭神',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/339.html',
    命主甲: `一直以来我开着一家小的服装店，但是由于现在实体生意真的不大好做了，加上还要替丈夫还他的那些赌债，所以，经济压力实在是太大了。
          我现在的丈夫品性的确是不太好，这也是我结婚之后才发现的，由于他是家庭的独子，自小没有吃过什么苦，所以让他去工厂上班，是根本坚持不下去的。有一次我发现他在网上赌博，我劝他不要沾染这些，但是他不听我的劝告，依然执意这样做，很快就拖垮了家庭，导致欠了很多的外债，现在一个人跑去外地躲着了。
          最主要的是孩子也跟着一起遭罪，跟着我受尽了苦楚，我原本不想再走下一步的，可是我在丈夫的身上实在是看不到任何的希望了，觉得自己应该努力的赚钱，彻底的离开丈夫，看到老师说我适合做旅游方面的工作，所以我也考虑转行，希望尽快能够买一套属于自己的房子，让孩子有一个安稳的家，也希望以后能够遇到一个好的缘分，不再受到伤害。
          `,
    珠玑: `八字分析：日干辛金在子月不得令，且年干月干有两个壬水耗泄自身，年支戊土可以来克水，但是力量太弱，辛金坐巳火也可以耗日主，巳火生时柱丑土，丑土可以生身，所以是流通的小组合，本是吉祥的，但是子月为火之绝地，所以巳火根本起不到实际的作用，
          为此，你是偏弱之命，八字喜金、土为用，忌神为水木，要注意的是如果土太旺也是不吉的，特别是戊土专门克水，所以会破坏八字的平衡。不过如果有食伤过旺的话，还是需要土来制的。
          你八字五行较为流通，主食伤生财，力量一直不断，你是不缺财源的，而你一路走得大运是印星和官杀，对你 有好有坏，虽然不会发大财，但是财运会有转机，过日子是不用担心的。
          你八字带有伤官配印，伤官主流通性和走动，食伤为口才和表达，所你适合旅游方面的工作，而八字印为喜神，所以可以向印星方面的行业发展，伤官为技能、计算、技术，说明你八字有技术技能和经营生意的信息，会有所发展。伤官配印也说明可以做培训教育方面的工作，还可以做销售经营类的工作。
          你八字中巳火为婚姻宫，但是巳火暗藏劫财庚金，所以夫星合劫财混杂，说明丈夫有劫财心理，且丑土来泄巳火，说明夫星很弱，被克泄的很严重，也没有什么生助，所以丈夫的能力不强，很难约束好自己，容易有不好的习惯和爱好，不是很踏实，不想付出就像得到回报，不会脚踏实地的去吃苦，老是想走捷径，自制力不强。
          大运分析：你在37岁-46岁走的为戊申大运，为正印大运，对自身有很大的生助，土金的力量加强，金水也能相生，所以事业是会得到很好的发展的，八字地支子申半合，水变的很旺，还好大运的戊土可以来制水，所以水不至于过旺，对于你的财运是很有利的，自己的能力能完全的发挥出来，所以财运会有大大的好转。
          你在47岁-56岁走的为丁未大运，此大运丁壬合，克制七杀，加上和八字构成三刑，八字土旺克月令子水，八字原有的平衡被打破，最终形成了土重金埋的格局，可以克制食伤，所以财运发展受阻，做任何事都不顺利，有怀才不遇的感觉。不过虽然大运不好，但是流年组合还是不错的，可以弥补大运的不吉。不过在2028、2033以及2036、2037这几年要特别的注意。
          你在57岁-66岁走的为丙午大运，午戌半合，地支丙辛合，大运为不吉。八字地支火生土旺，可了伤官，合住了天干辛金，所以本来流通的组合被打破了，所以对于求财是不利的，且会有是非纠纷和官非，一定 要特别的谨慎。
          你晚年走的大运为正偏财，伤官生财得以流通发展，财运会变好，晚年生活还是很稳定平顺的。
          你的八字原局本来不差，有伤官配印，虽然为身弱之命，但八字五行流通的组合不被打破，你的事业还是会有发展的，但是后面的大运影响了这个流通的组合，不利于你去求财，所以是发不了财的，但是养家糊口是没有问题的。
          你的八字正官坐正位，为唯一的夫星，说明你比较的看重婚姻和丈夫，所以和丈夫分开对你来说其实是很痛苦的，虽然说在婚姻上一般是劝和的，但由于你的丈夫有 很大的赌瘾，所以建议你最好不要再走下去了，因为一个人即使再有钱，但是沾染这种嗜好是肯定会败家的，丈夫不顾你和孩子的生活，一直沉迷于赌博，不仅不能养家，还欠了债务，这样怎么有未来呢？
          你八字伤官旺而无制克了婚姻，一般会遇到人品不好的丈夫或对象，加上你夫星微弱，所以婚姻的大的发展方向是已经定下了，也就是说你后面遇到的对象或多或少还是会有问题的，不过你现在的大运为戊申，戊土可以克壬水，伤官有制，加上巳申合，大运食伤有制，所以你会在较晚的时候遇见好些的对象。而八字中伤官旺克夫星，婚姻宫和夫星有很弱，
          所以将来的丈夫各方面是不会都让你满意的，你如果再婚，最好找一个老实本分的，这样是对你比较好的
          `
  }]
}

export default {
  丑时
}