const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1996年十一月初六午时'
  }],
  十神: '劫财   正财   日元   劫财',
  天干: '丙(火) 庚(金) 丁(火) 丙(火)',
  地支: '子(水) 子(水) 亥(水) 午(火)',
  遁藏: '七杀   七杀   正官   比肩',
  大运: '辛丑，壬寅，癸卯，甲辰，乙巳，丙午，丁未，戊申，己酉，8岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3065.html',
    命主甲: `家庭一般，在小时候家里也挺穷，父母欠债，每次出去工作不顺心就开始吵架，所以感觉和他们不太亲近。也被他们说过是薄情的人。
          于2015年无意间选读中医专业，毕业后想考研，奈何考研期间一直感觉不舒服。时不时有鬼压床，夜间突然间难受。2020年考研没上，到2021年考的时候，也有算命先生说可以考上，当时刚刚好英语过线，进入复试，导师都邀请加微信了，结果还是别刷掉。
          期间入职医院工作，但还是想考研，就职掉工作，准备考研，报考了中医外科学。期间也给人免费看病。
          `,
    珠玑: `八字分析：丁火生在子月，为七杀格，年支子水，月支亥水，官杀混杂不吉，水太重而火弱，午亥合官星合禄，晚年运气不错。这是典型的杀重身轻命格，无木化杀，无土制杀，七杀无制化必伤身。
          事业分析：八字子水七杀得令较旺，伏吟年支，日支又见亥水正官，加上月干有庚金财星来生官杀，官杀是比较旺的，而命局没有印星通关，化官杀生身，八字身弱，官杀攻身，则压力会很大，烦恼较多，负面情绪较重，想法有时候也容易极端。
          官杀旺克身得不到解救，也容易缺乏魄力，内心有些自卑，缺乏自信心，做事想前想后，顾虑非常多，做事拖拉，犹豫不决，导致容易错失一些机会。
          八字身弱官杀旺，加上地支子午相冲，午火是丁火的禄神，禄神被冲克，容易疲劳，精神状态不好，也容易因为想的多，有时候精神太过于紧张，自己给自己的压力大，导致睡眠不好，你睡觉“鬼压床”也和这方面有关系，注意心理调节，调节心态，作息的规律。
          官杀攻身，杀重身轻，命局不见印星来化杀生身，一般多靠自己去发展事业，家里对自己帮助不大， 没有什么可以依靠的，往往也比较缺乏父母的关爱，月令子水七杀伏吟到年柱，七杀为忌神，往往家里出生条件也不太好，家里不富有。
          地支子午相冲，午火禄神代表自己，年柱代表祖上家里，和家里的的缘分不深，感情比较淡，相处也容易不和谐，矛盾多，容易和家里分开，在外地发展。八字官杀星较旺，不见食伤制官杀，不见印星化官杀，在与人交往的的关心体贴人方面比较缺乏，会有些冷漠，这方面是要注意的，与家里人，或者与他人相处，要多换位思考下，多主动关心为好。
          八字时柱是丙午空亡，同时官杀混杂，子水七杀临桃花，为人是比较聪明的，同时也比较适合做一些偏门冷门一些的工作，丁亥暗合，也有去杀留官之象，亥水正官临天医星，暗示从事中医相关的事业是比较适合的。
          月干庚金正财高透，天干丙丁火比劫来制财，依靠他人依靠团队的力量发展比较有利，不适合单打独斗，你现在处于考研过渡期，条件允许还是回到医院上班比较好，上岸后再辞职。
          八字身弱喜印，但命局不见印星，考学运较为一般，学习压力较大，付出较多，但学习成效不理想。现在走的是壬寅大运，和命局日柱天合地合，地支寅亥相合，寅木印星被合入，大运对你考学是有利的，明年壬寅年，岁运并临，可以好好把握，有机会上岸。
          大运分析：18岁-27岁走的是壬寅大运，此大运为官印相生的大运，大运和命局日柱天合地合，地支寅亥相合，寅木印星被合入，起到了化杀生身之用，总体运势还可以，可以得到这个印，考研能够上岸，正官合身，也有机会落实工作，但压力还是比较大的。
          28岁-37岁走的是癸卯大运，此大运为杀印相生的大运，地支卯木也起到化杀生身之用，但子卯相刑，卯木印星受损，此大运考学是不利的，所以要考研的话要在壬寅运去把握，此大运卯木印星受损，学业和事业压力阻碍都比较大，贵人运一般，要注意口舌是非，小人算计。
          38岁-47岁走的是甲辰大运，此大运地支辰土被天干甲木盖头，地支辰土来制官杀为吉，天干甲木印星透出，压力方面有所减轻，事业有发展的机会，也有贵人相助，总体事业财运不差，好好把握。
          48岁-57岁走的是乙巳大运，此大运天干乙木枭神高透，八字身弱，乙庚相合，乙木被合克，要注意身体健康，尤其是肝胆、经络方面疾病。地支巳火引动命局子午相冲，午火禄神被冲克，要注意心脑血管疾病。
          对于你现在来说，理清思路，顺应运势是非常重要的，而不是想起什么，就做什么。从你的运势来看，明年可以去争取下学历，还是安心上班为好，很多医院也鼓励脱产深造的，以后可逐步落实学历。
          `
  }]
}

export default {
  午时
}