const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1996年十一月二十六日午时'
  }],
  十神: '劫财   正财   日元   正印',
  天干: '丙(火) 庚(金) 丁(火) 甲(木)',
  地支: '子(水) 子(水) 未(土) 辰(土)',
  遁藏: '七杀   七杀   食神   伤官',
  大运: '辛丑，壬寅，癸卯，甲辰，乙巳，丙午，丁未，戊申，1岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/409.html',
    命主甲: `在2013年至2017年期间身体状况一直不佳，四处求治西医中医，医疗花费很大，但结果总是反反复复，疗效很不理想，不过所幸2016年考上一所二本院校（当时选择了一门工科专业），并在2017年3月在就读城市遇到一位老中医，经过一年多的治疗我的身体也渐渐痊愈，且今年六月份毕业，算是有了一纸文凭。
          但由于在求医治病的过程当中对中医产生了极大的兴趣，在上大学期间由于跨行于中医学的难度太大（需要八年），就打消了这个念头。但是在前段时间一个偶然的机会看见师承五年可以从事中医临床，便心中有了想要从事中医的念头，便对父母提出了这个想法，结果是母亲同意但父亲反对。
          想到自己这几年求医治病花费巨大对家庭有愧，不好忤逆父亲的意愿（因为是长子感觉现在该挣钱养家了），就将此事从心里压了下来，但此后的几个月里自己总是难以放下对中医的热爱。
          一边是家庭的担子，一边是自己喜爱的中医事业，我一时不知道该如何去抉择。
          `,
    珠玑: `八字分析：丁火生于子月子年，七杀格无疑，而且七杀非常旺，这里坐下的未土就显得非常重要了，它既是丁火的根本，又是制杀的食神，子未穿制未土压不过子水，食神被穿身体健康就会出现问题。
          事业分析：地支子水七杀旺，七杀为凶神，需要制化，而日支和时支为未土辰土食伤，可以克制子水七杀，同时时干有甲木正印生助丁火日干，为人还是有想法主见的，有能力和魄力，不喜被人太多约束。
          八字有正印又有食伤，领悟能力和学习能力也比较强，喜欢亲力亲为，七杀虽然有食伤克制，但七杀比食伤旺，七杀也代表困难阻碍，容易有好事多磨的情况，想做的事情，总会有遇到不少困难，挫折，多付出才能够达成所愿。
          地支未土辰土食伤旺，日主弱财印相见，有的时候容易急躁，遇到困难的时候很容易负面不满情绪，缺乏持之以恒的毅力耐心，而中途放弃，导致半途而废，这是你要注意调整的。
          地支子水七杀旺，七杀为凶神，喜制化，有未土辰土食伤克制七杀为吉，对你事业发展是有帮助的，同时食伤透出甲木正印贴身生日主也是吉的，代表可以通过个人能力，以及专业技术知识在事业上取得些成绩。
          但是食伤在克七杀凶神的同时，也在泄耗丁火日干，也代表会让你忙碌疲惫，付出多，同时七杀力量旺，也代表你遇到的求财过程中会遇到不少困难阻碍，需要自己不断付出努力，持之以恒去克服才可以。
          七杀虽然得庚金财星生助，但好在庚金财星不旺，且被丙火克制，庚金没什么力量，生助子水七杀的力量不强，同时也冲克不了时干甲木印星，八字中喜用神没有明显受伤，是吉利的。
          结合你的大运走势看，对你的事业有持续发展帮助，钱财收入会持续增加，可以取得些成绩。
          八字七杀在地支，被地支食伤制，这样的组合一般代表在公检法，军警，医药相关发展是适合你的，加上你的八字印比相生为木火的组合又是喜神，同时丁火坐未土为印库，丁火有根，木代表中医，火代表文明传播，薪火相传，也代表你在中医方面的缘分，
          而八字中没有天医星，加上时干逢正印，正印一般代表西医，偏印代表中医，同时七杀劫财偏星一般主刀枪，代表你和医药有缘分，中医也适合，但更多偏向于西医方面多些，可以作为兴趣爱好，中西医结合去研究。
          大运分析：21岁-30岁走的是癸卯大运，此大运癸水七杀为忌透出，坐下卯木泄气，天干又有正印甲木，八字杀印相生，对你的事业是吉利的，而七杀透出，也代表事业阻碍苦难多，但地支卯木印星为喜神，天干也有印星，五行流通，对你事业发展有帮助，钱财收入也会增加，有发展提升机会。
          31岁-40岁走的甲辰大运，此大运甲木正印力量增加生助日主，地支伤官旺克七杀为吉，但辰土伤官也泄日主力量，代表自己要付出比较多精力努力取得进步，同时食伤旺，也容易急躁，急于求成，情绪不稳定，而影响到工作状态和人际关系，大运甲木盖头辰土，整体运势还是好的组合。
          41岁后分别走乙巳，丙午，丁未几个大运，地支七杀被克制，对你事业求财都有利，大运走的都不错，能够持续提升，晚年生活也比较稳定的，可安享晚年。
          你的八字丁火日干生在子月失令，年月支七杀旺，而八字身弱，七杀为凶神喜制，地支有食伤制七杀，七杀被制对你的运势发展是有帮助的，自己有能力有干劲，同时时干甲木正印贴身相生，自己也比较积极努力上进，加上后面大运走的木火大运，整体八字格局层次还不错的。
          `
  }]
}

export default {
  辰时
}