const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '比肩   偏财   日元   七杀',
  天干: '丁(火) 辛(金) 丁(火) 癸(水)',
  地支: '丑(土) 亥(水) 巳(火) 卯(木)',
  遁藏: '食神   正官   劫财   枭神',
  大运: '壬子，癸丑，甲寅，乙卯，丙辰，丁巳，戊午，己未，庚申，10岁',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3334.html',
    命主甲: `从小生在广西一个贫困的家庭家中姊妹多，因为贫困我一直努力学习，成绩还可以，2016年考上本科药学专业。2020年毕业在医院工作 2022辞职了。
          2018年暑假认识了一个92年的男孩比我大五岁，毕业前一年他生意失败，母亲癌症晚期，男孩提出分手不想拖累我。于是就分开了。
          目前压力很大，经常失眠，超希望能在事业上有所突破，改变目前困窘的生活状态。
          `,
    珠玑: `八字分析：丁火日主生在亥月，为正官格，天干透癸水，藏官露杀。八字亥水当令较旺，最喜见木来通关生身，木为最重要的用神，火虽帮身，但在天干地支容易组成水火相战，同时在地支生土不吉。
          八字日支巳火为用神，但地支巳亥相冲，为忌神制用神，年干丁火为用，神但丁火被丑土泄气，力量不强，好在时支卯木得癸水生扶，又来生巳火，为吉的一面。
          结合大运走势来看，早年走的是壬子大运，癸丑大运，运势较为一般，有一些阻碍，未来转东方木运，运势较为吉利，后转丙辰大运，运势有所走低，丁巳大运，运势转好。
          事业分析：八字亥水官星当令较旺，时干又见癸水七杀，时支虽见卯木印星，但离丁火日主太远，难起到通关的作用，且八字身弱，有官杀攻身之象，会体现为压力较大，思虑重重，有时候也容易优柔寡断，负面情绪和思想较重，容易走极端，不够自信，这是要注意的。
          丁巳日出生，丁火日主在地支有根，巳火为羊刃，但巳亥相冲，巳火被亥水冲克，加上八字为官杀混杂的组合，做事很难坚持到底，容易半途而废，也缺乏魄力，容易因此错失一些机会，日坐巳火羊刃逢冲，性格也偏急躁，这也是要注意的。
          八字丁巳日出生，日坐巳火羊刃为用，身弱羊刃帮身为吉，但地支巳亥相冲，巳火羊刃逢冲，故羊刃反而发凶。一般来说，羊刃为忌，逢冲伤人。羊刃为用，逢冲伤己，再加上日坐巳火临四废，官杀攻身，说明容易有意外伤害的潜在信息，平日和出行都要小心，尤其大运流年引动的时候要特别注意。
          这种组合适合通过职业来化解，比如从事偏武职行业、文章创作或从医都是非常好的，也即手握“枪杆子”、“笔杆子”或“手术刀”的职业更容易趋吉避凶。故通过八字来分析事业走向，一个思路是最擅长什么职业，另一个思路是做什么职业对自己最有利。
          这种组合加上你八字官杀混杂而攻身，丁火日主被癸水七杀和巳火羊刃贴身，时支卯木为枭神，年支丑土食神临华盖且空亡，也代表自己比较适合从医，能在大学选择这个专业非常幸运，虽现在从医院辞职，但再找工作，建议还要去医院上班。
          你八字官杀混杂，地支又见六冲，容易心性不定，自己还是要尽力降服，在这个行业沉下心来。亥水官星临驿马，巳亥相冲，驿马逢冲，快马加鞭，年支丑土为财库，年干丁火为用神，很适合外出求财，出生地东方，南方，东南方比较适合你。
          月柱辛亥，财官相生，辛金偏财临驿马，故命中有快财，一方面容易“不劳而获”，另外一方面辛金得年干丁火比肩来制，比肩在年为用可为贵人，领导等能力更强之人，也可以得到别人帮助自己得到的财，尤其丑土财库在年，更代表外出才有这个机会，在家乡很难有这个运气。
          在身体健康上要注意调节睡眠，少熬夜，主要要防范意外伤害的问题，甲寅大运，地支寅巳相害，要多注意，60岁后转丁巳大运，引动八字巳亥相冲，更要多注意。另外，逢猪年，蛇年，虎年也要多注意，你五行俱全，金为忌神，不建议佩戴金银首饰，不适合你。可以佩戴一些木的，比如紫檀木，绿檀木，或者红玛瑙，鸡血石材质饰品。
          姻缘分析：八字亥水官星当令，时干见癸水七杀，为官杀混杂的组合，尤其地支巳亥相冲，对待感情心有不定，加上年支丑土空亡临华盖，丁巳日出生临女孤鸾煞，均为不利婚姻感情的体现。
          八字官杀混杂，月令亥水官星和日支巳火劫财相冲，婚姻宫也逢冲，时干又见癸水七杀，这种组合表示容易遭遇二婚，早年如果经历失败的感情，能够化解一些，有利于后面婚姻的稳定。
          月柱辛亥，财官相生，亥水官星临驿马，未来丈夫多为外地人，从事的工作奔波较多，巳亥相冲，婚后也很容易聚少离多，有财来生官，丈夫有一定财运，不过总体对你帮助较为有限。
          今年壬寅年，官印相生，天干丁壬相合，正官合身，地支寅亥相合，亥水夫星被合动，且为印星出现的年份，又红鸾星入命，故可以遇到结婚的运气，要好好把握。
          接下来走的是甲寅大运，地支寅巳相害，婚姻有一些不利，夫妻矛盾较多，要多克服，丁巳大运，巳火引动八字巳亥相冲，婚姻也有一定波动，其余大运夫妻较为和顺。
          六亲分析：女命以食伤代表子女，年支为丑土食神，暗藏己土，日坐巳火暗藏戊土伤官，单纯从你八字来看，有两女一儿，但丑土临空亡，又巳亥相冲，戊土伤官受损，丁火在卯木临病地，故子女缘分不是很强，生育方面不那么顺利，容易有波折，胎儿不稳的情况，要孩子前最好先调理好身体。
          女命以偏印代表母亲，时支卯木枭神可为母亲，丁火在卯木临病地，临灾煞，丧门和吊客，这三个神煞主灾祸孝丧之事，之前有人说你克母是因为看到这几个神煞。
          但实际上有些片面，结合八字来看，时柱杀印相生，卯木枭神代表母亲，被保护得很好，判断六亲也以五行生克为主，神煞是辅助判断，不能本末倒置，所以克母的说法并不准确的，不用太担心，不过逢龙年和鸡年要注意母亲健康。
          大运分析：2016年-2025年走的是癸丑大运，食神制杀，和八字构成官杀混杂，一方面容易想法多，且想法会比较多变，压力较大，也容易睡眠不好，事业不稳定，容易变动，求财不容易。
          2026年-2045年走的是甲寅大运，和乙卯大运，这两个大运都是印运，事业运和财运均有较好的发展，有升职机会，可以做出成绩，要好好把握。
          2046年-2055年走的是丙辰大运，天干丙辛相合，丙火劫财虽帮身，但也夺财，财运走低，花销也较大，不易聚财，丙火见丁火也容易掩盖丁火光芒，事业运不是很好，加上地支卯辰相害，卯木印星受损，贵人运也较为缺乏，自己很难把握住机遇，求稳为好。
          `
  }]
}

export default {
  卯时
}