const 寅时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '偏财   食神   日元   食神',
  天干: '戊(土) 丙(火) 甲(木) 丙(火)',
  地支: '辰(土) 辰(土) 寅(木) 寅(木)',
  遁藏: '偏财   偏财   比肩   比肩',
  大运: '乙卯，甲寅，癸丑，壬子，辛亥，庚戌，己酉，戊申，8岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/422.html',
    命主甲: `婚姻方面是我的一块心病，我之前一直觉得自己的桃花还可以，
          跟父母关系不太好，我从小心思就比较重，缺乏安全感，所以我对婚姻寄予很大的希望，以前觉得自己桃花还可以，但是恋爱的次数很少，现在不知道是不是自己心里作用，感觉自己这辈子得不到真爱，心里很难过。
          `,
    珠玑: `八字分析：甲木生辰月，为偏财格，偏财在月上有食神生财，年干支皆为偏财，那么你要怎么得到这些偏财为我所用呢？我们看到，甲坐下为寅木比肩，时支也为寅木，两个禄神对两个偏财。
          比肩是分福的，所以命中的财自己得不全。八字有财运，有机会，但往往存在一定的合作和竞争。
          婚姻分析：以五行金代表甲木你的官杀夫星，甲木是参天大树，且你的八字木旺，如果逢金的话，可以修剪甲木，对你是有利的。因为也可以克制你八字中的比劫，以免掠夺财星。
          但是你的八字缺金，官杀夫星不显，加上甲木左右是丙火食神，丙火长生于寅木之中，丙火力量是比较旺的，当遇到庚金七杀的时候，丙火克庚金，而遇到辛金正官的时候，丙合绊住。导致庚金辛金官杀被克掉，难进入婚姻。
          八字木旺比劫旺，代表感情竞争大，难遇到自己满意的对象，但也不愿意轻易将就。同时你在感情上，性格脾气比较大，过于刚直，容易胡搅蛮缠，既想找个努力上进的，又想找个对自己百依百顺的对象，对你的感情是不利的。
          婚姻宫寅木是丙火的长生之地，也是官杀夫星的忌神，导致感情无法合入你婚姻宫，影响你的婚姻落实，迟迟不得缘分，加上走的感情运不太好，适当降低要求才可以。
          事业分析：你的八字原局还可以，但前面的四步大运走水木印比大运，可以说大运一直走的不太好，对你的出生，学习，工作都不太有利，出社会也容易奔波不定，在一个地方待不久，难得稳定岗位。
          48岁走辛亥大运，但辛丙合绊住食神，也不是太好，整体组合比较普通，但晚年走庚戌大运，和己酉大运对你有利，晚年好很多。
          大运分析：28岁-38岁走的是癸丑大运，此大运天癸水在丑土中有根，天干戊癸合财星被合拌住而不化，对你的求财是不利的，地支正财寅丑暗合，财运会有点增加，但开支破耗也多。而天干戊癸合，地支寅丑暗合，入婚姻宫，有些桃花运，但地支木旺，为木克土的组合，所以感情不稳定，难把握住。
          38岁-47岁走的是壬子大运，此大运为偏印大运，大运天干壬水印星冲八字中丙火食神，二者相冲强者可胜，壬水被戊土克制，使印星无法生扶甲木日主，但子水印星生扶寅木比劫，对求财和感情是不利的。
          48岁-57岁走的是辛亥大运，丙火和辛金合绊住，本来八字身旺比劫旺，需要丙火食神泄气生财为用，但这个大运丙火被合绊住，丙火不能好好的泄比劫的量，好比是一身莽荒之力无处发泄，以致比劫任意掠夺命局中的财星，也代表此大运会破耗钱财，影响感情婚姻，因为辛金正官本来是甲木的正官，但丙火食神争合绊住后，则失去了原有的作用。
          58岁-67岁走的是庚戌大运，庚戌土金相生组合大运，为命局八字中的喜用神，庚金七杀透出克制着甲木日主的比劫，以致不夺财星，同时甲木日主身旺生丙火食神，食神生财星，财星生旺庚金七杀，五行有流通作用，对你晚年生活是比较有利的。
          你的八字感情组合方面不太理想，五行缺金，金为你的官杀夫星，八字夫星不显，虽然有财生官，但食神多且力量比较强，当遇到庚金辛金官杀的时候，容易被克，同时八字比劫旺，竞争阻碍大，导致你的婚姻难落实。
          穷则变，变则通，通则久，你现在事业不稳定，失业在家可以先找份其他工作先做着再等待其他机会，而不是一直被动等待，以前找工作可能会有靠关系的成分，现在更多是考量个人能力，如果自己能力不行，即使托关系也不会长久，靠山山会倒，靠水水会流，只有靠自己，才能走下去。
          现代男女关系平等，女人顶半边天，婚姻从某种角度来说也是价值的结合，这种价值比如是你的性格为人，才华，外貌，事业等，如果在各方面都比身边人落后差很多，别人为什么要选择你呢？你应该对自己有个清醒的定位和规划，尽量先把事业先做好，那样对你婚姻落实也有些帮助。
          `
  }]
}

export default {
  寅时
}