const 未时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '劫财   食神   日元   比肩',
  天干: '丙(火) 己(土) 丁(火) 丁(火)',
  地支: '戌(土) 丑(土) 酉(金) 未(土)',
  遁藏: '伤官   食神   偏财   食神',
  大运: '庚寅 辛卯 壬辰 癸巳 甲午 乙未',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/197.html',
    命主甲: `身太弱的人不宜炒股票，丁火男命炒股身败名裂卖房子还债
          `,
    珠玑: `丁火命，生十二月天寒土冻之时，十二月为丑土，寒湿之冻土，冬天的火，显然不得时，火生土泄火气，日主丁火先天上就属弱。
          再看其余三个地支，一戌土，一未土，一酉金，不见有木、火相助，亦不得地。也许有人说，戌中不是有丁火，未中有丁火吗，但这只是丁火之墓库和余气，戌未中还是以本气土为主，至多只能算是微根，不能当作整个丁火之根来论。
          再看天干，有丙火、丁火透出，连自己共有三火，有些初学者就会以为丁火身强，或至少认为不弱。须知八字之中，干多不如支重，天干得一比肩（这里即指一丁火），
          不如地支得一余气、墓库（这造里指一未、戌土）。得二比肩（两丁火），不如地支中得一长生，禄旺（此造指一寅、卯木或巳、午火等）。
          因为比肩有如朋友之相扶，地支通根则如家室之可托，故干多不如根重，这是分析八字时须牢记的。故此造天干虽透出丙、丁火相助，但地支无木、火为根，亦指不得势。
          可见，这个丁火命，既不得时，也不得地，亦不得势。天干有丙、丁火透出，地支有微根，又见酉金财星，非满盘食伤，故不入从弱格等特殊格局，只能当身太弱之正格。
          八字中四土一金泄弱日主丁火，成身弱（丁火弱），伤（土）旺之象。日元丁火，几如一盏快燃尽的灯，非添以膏油，焉能复明？故行运喜木、火，忌土、金、水。
          身太弱无法承受更多财、官之负荷。假如不自量力的去炒股、赌博，追求超过自身负荷之名利，岂不身败名裂，名利皆损？犹以大运和流年为土、金、水忌神时，破财、病、滞即见。
          癸巳大运，庚申流年，金水齐见，炒股亏损无数，要卖房子偿还债务。有人说巳属火，应该好运。唯巳火与命中酉丑三合金局，由火化合成金，先好后坏，先是有些小赢利，引你下注，一旦到下大赌注时，立即反转，成一破财之陷井也。
          `
  }]
}

export default {
  未时
}