const 丑时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正官   偏财   日元   正官',
  天干: '庚(金) 己(土) 乙(木) 庚(金)',
  地支: '戌(土) 丑(土) 未(土) 巳(火)',
  遁藏: '正财   偏财   偏财   伤官',
  大运: '庚寅 辛卯 壬辰 癸巳 甲午 乙未',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/131.html',
    命主甲: `乙木“从财格”得时势助力 大发财利
          `,
    珠玑: `此造也是乙木命，生在冬天十二月天寒地冻之时。前面几篇文章已经论述过了，冬天出生的人，先不论财、官、印、食伤，首看命中八个字有火无火？如果一点火星都没有，只能是寒儒贫命。有了火，再看日干强弱，和与其它干支比较，看其格局的配合、用神的高低如何？才判断出是好命或坏命。
          现看此命时支巳火，未、戌燥土中也内藏丁火，虽生在十二月暮冬之时，火亦够用了。
          现再看第二个问题，日干强弱的问题。十二丑土当令，木临衰地，一生下来，乙木日主就属身弱。再看到地支三土（戌丑未土），一巳火，全无一点印劫（水木）的扶助。再移到看天干，也是一己土二金（庚、辛金），也是全无一点水木（印劫）的帮助，只剩下乙木日主自己一个人，孤零零地寡助无援，怎么办？
          如果在三四十年（1976年前），想找人算这样的命，也只能说是命中缺水木，喜水木为用，忌土金火。但在今天，许多人都知道这是“从财格”了。
          命理界对从格，往往有滥用之嫌。动不动就问：我这个八字是不是从格呀？或问：我是“炎上格”，某某歌星也是“炎上格”，那为何我不能富贵呀？其实天底下并没有那么多的“从格”，即使入了“从格”，也没有人写包票能保你大富大贵，可见仍有许多人对“从格”的命存在些误解。
          “从格”是八字命理中“特别格局”中的一种，其论命的根据与正常格局不同，但所占的比例很少，通常十分之一还不到，而且有严格的要求，不是随便想从就从的。
          以此例来说，是“从财格”，其基本的要求是：干支财（土）多而旺，特别地支更须财（土）旺。日干乙木失令，弱而无根（无木根），也无印星（水）和比劫（木）生扶，不得已弃命，以从财星（土）之旺势。其实此例天干透出两庚辛金官星，得己土之生，也可以叫“从财官格”。
          如原局四柱见比劫（木）或印星（水），则格破，仍作正格看。既已弃命从财，行运最忌比劫（木）来克旺神（土），也忌印（水）来生发日干乙木。运喜食伤（火）来生财（土），次喜逢财乡（土）兴发，则功名显达，官（金）运也有利。
          如从财格内见有官星（金），财可生官（土生金），则富而贵；官星越有力，官职越大。又乙木生丑月令（如此例），如四柱全然无半点火星，即使能入“从财格”，也只能是寒儒贫穷命，不足取也。但此造前面说过，有巳火和戌未中丁火取暖，不在此列，自当能富贵了。
          此命早年走寅、卯东方木运，克犯命中旺神（土），高中中途退学帮助家业；中年巳午未三十年南方火运，把握商机，大发财利。
          `
  }]
}

export default {
  丑时
}