const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1999年五月十六日午时'
  }],
  十神: '正官   枭神   日元   偏财',
  天干: '己(土) 庚(金) 壬(水) 丙(火)',
  地支: '卯(木) 午(火) 子(水) 午(火)',
  遁藏: '伤官   正财   劫财   正财',
  大运: '辛未，壬申，癸酉，甲戌，乙亥，丙子，丁丑，戊寅，己卯，4岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3108.html',
    命主甲: `一直以来，整个家庭无论是爷爷奶奶还是我的父母对于我的教育始终都予以高度的关注。他们对我的功课的要求很多时候是严格，乃至有些严苛的。课余娱乐是不被允许的，长期也要为上课外班而奔波。他们也经常进行争吵。也因此，为了我可以进入更好的学校，经常举家搬迁，期中好像还因房屋问题打过官司。
          我的考运和交友运势一直以来算不上佳。上学期间遇上心思不好的老师和同学，甚至遭其霸凌也不算新鲜之事。重大考试也经常阴长阳错错过属于我的机会。平常的运气也不好，在我身上也不存在所谓“侥幸”。我只能去努力，但得到的成果往往是称不上努力的。
          后来因为我重度的偏科，决定走编导艺考。在统考成绩不错的情况下，校考却失利了。我几度想去复读，但最终作罢。基于种种，我最终还是在大学期间爆发了抑郁症和植物神经紊乱。后来也是通过某些机缘巧合才可以说步入正轨，也让我重新思考了很多。
          如今，我在准备去赴日留学的事宜，而趋吉避凶应该也算是命理的一部分。
          `,
    珠玑: `八字分析：壬水生于午月，为正财格。午月午时，火旺之极，财旺需要身旺，否则也得不到这个财。壬水自坐子水，为阳刃，也为半个禄，刚好可以助身取财。但夏月火旺，子水虽在座下，却犹如杯水车薪，需要大运流年之旺水助力才行。
          事业分析：八字午火财星得令较旺，时柱丙午干支一气也为财星，又得卯木生扶，地支子午相冲，弱水难敌强火，反而会驳火之怒，子水羊刃为用神，被两个午火所冲，反而会滋生软弱，故而容易遭遇欺凌，有的时候也容易逆来顺受。
          命局天干风平浪静，地支子卯相刑，子午相冲，午午自刑，水火相战，天干代表外在，地支代表内心，会有点双重性格，内心容易纠结郁闷，遇到事情想不开，地支午午自刑，午火为神经系统，也容易得抑郁方面的精神问题，容易扰乱心神，这是要注意的，平常注意不要给自己太大压力，否则影响到身体和心理健康，就得不偿失了。
          庚金偏印为用贴身，有保护之意，但是被制则内心比较玻璃心，遇到事情容易承受不住挫折，顶不住压力，自己要注意调整下， 到社会上压力和挫折会更多，一个人的心理承受能力，抗压能力是进入社会的必修课。
          月柱庚午组成财星破印的组合，印星为用被克是不利学业的，容易因为外界的影响，导致学习状态不佳，学习注意力不集中，收获不佳，成绩不太好，特别是脱离学校，参加工作的话，更加难把心思放在学习上。
          月干庚金偏印高透为用，偏印贴身，是比较喜欢钻研的人，相对而言，对较为偏门冷门的专业比较感兴趣，也有天赋，有艺术方面的灵感，故而选择艺考是正确的，可以坚持下去。
          你现在走的是壬申大运，天干壬水来制丙火偏财，地支申金来生子水，总体考学运还是不差的。
          但今年辛丑年，天干丙辛相合，丙火和辛金被合拌，地支子丑相合，子水被合克，且丑午相害，午火受损，学业压力不小，考学运较为一般。
          明年开始走的是癸酉大运，天干癸水来制丙火偏财，地支酉金来生子水为吉，但地支午酉相破，酉金印星受损，考学运稍有欠缺，不如上步大运。2022壬寅年，2023癸卯年，虽有壬癸水来制丙火财星，但地支寅卯木旺了午火财星来制印，对学业不太有利。
          2024甲辰年，2025乙巳年，2026丙午年，均木火两旺，火旺制金，不利考学。2028戊申年，地支申金来生水，考学运稍好。在此之前建议明后年可以尽力争取下留学，如不成就早点找工作为好。
          接下来的癸酉大运，总体事业运相对不差，可以找到较为理想的工作，也有贵人相助。命局卯木伤官生财，丙午财星入门户，壬子日出生，壬水日主在地支有根，可以担财，财运必查，伤官生财则可以依靠艺术才华去得财，要把自身的专业技能学精为好。
          八字身弱，天干己土正官星来生庚金偏印，官印相生，则能去一些大的企业较好。年柱己卯，己土被卯木截脚，构成伤官克官，则内心喜欢偏自由一点的工作，伤官生财，会有创业的想法，但从大运来看，癸酉大运还可以尝试，之后大运不太好，总体上班为好。
          大运分析：24岁-33岁走的是癸酉大运，此大运行金水之地，天干癸水来制丙火，地支酉金来生子水，总体运势对你来说还算不错，大运助身，可以担财，此大运有比较不错的财运，可以依靠艺术才华去求财，也有贵人相助，但是午酉相破，酉金受损，财星破印，对考学不太有利，目标不宜过高。
          34岁-43岁走的是甲戌大运，此大运地支戌土被天干甲木盖头，为食神制杀的大运，天干甲己相合，己土正官被合克，地支卯戌相合，卯木伤官来合克戌土七杀，事业上易有变动，不太稳定，容易对工作不满，也要注意口舌是非。大运不助身，财运一般，上班求财比较好，不太适合折腾。
          44岁-53岁走的是乙亥大运，此大运行水木，天干乙木伤官高透，乙庚相合，庚金偏印被合拌不吉，此大运比较低谷，事业上难把握住机遇，也难以得到贵人相助，难施展才华做出成绩。庚金偏印被合拌，也要注意身体健康，尤其是肺部，肠道方面疾病，心理方面问题也要注意。
          54岁-63岁走的是丙子大运，此大运天干丙火被地支子水截脚，天干丙火偏财制庚金印星，要注意肺，肠道方面疾病，以及心理方面问题，地支子水引动命局子午相冲，子水羊刃逢冲，子水为用逢冲，要注意肾脏，妇科泌尿系统方面疾病，也要注意手术和意外伤害。
          俗话讲：心有多大，舞台就有多大。也就是说，心态的好坏，承受能力的强弱，决定了你人生可以达到的高度有多高，这个世界上除了情商、智商比较重要，还有逆商，考验你的就是在逆境中如何应对压力，被压力压垮，还是越挫越勇，以后人生的路还长，这一关必须要过，心宽而后天地宽。
          `
  }]
}

export default {
  午时
}