const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1991年四月二十酉时'
  }],
  十神: '枭神   比肩   日元   枭神',
  天干: '辛(金) 癸(水) 癸(水) 辛(金)',
  地支: '未(土) 巳(火) 卯(木) 酉(金)',
  遁藏: '七杀   正财   食神   枭神',
  大运: '甲午，乙未，丙申，丁酉，戊戌，己亥，庚子，辛丑，癸巳，壬寅，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3308.html',
    命主甲: `从小性格内向，安静，不活泼，不爱与人争抢，也不善结交朋友。生在农村，父母为人很好，家庭氛围也很好，从小没经历过什么磨难，读书一般，上了所普通二本。2014年大学毕业，从事会计行业，虽然第一份工作不太好，但刚毕业还算有上进心，也在积极考取证书。
          也是同年，遇到我老公，他家境很差，还有大额负债，喜欢撒谎，说话总是自相矛盾，但脾气很好，对我也算照顾，所以即使我们俩一直磕磕绊绊，最后还是在17年结婚了。
          婚后经济条件一直不好，他工作没定性，换来换去，我工作也一般，但负担了大部分家庭开销。日子虽贫，但还算平静。到了20年，才得知他做了违法的事，某天被警方逮捕，直到今年才被宣判，有期徒刑7年半，同时给我留下了三十万贷款。
          起初他入狱，我对他还抱有幻想，替他处理了二十多万欠款，一年半后，冷静了许多，然后决定放弃婚姻。之后的一段时间，前所未有的彷徨，阴差阳错开启了另一段见不得光的感情（那时候我的婚姻关系还没结束），
          现在想来非常后悔，在那种极度迷茫的时点上做了一个特别错误的决定，对方既没有担当，也很不负责，只是玩我而已。所以半年后，我再次受到伤害。
          这两年和之前二十多年的生活相比，犹如地狱和天堂。我从来没有遭遇过这种打击，不仅破财，还伤了身体，甚至连累父母子女。
          现在已经恢复单身，感情方面也逐渐放下了，想先好好发展自己的事业，但行动力欠缺，工作也因前几年结婚生娃状态散漫等原因一直停滞不前，学习也没跟上，导致现在上班总是力不从心。
          `,
    珠玑: `八字分析：癸水日主生在巳月，为正财格，坐支卯木食神生财，财旺又转生杀，财格需用印，杀旺也需印化，时柱辛酉就显得特别关键。夫宫为食神，紧贴被偏印克入未墓，福气和配偶皆有损伤。
          事业分析：八字巳火财星当令较旺，巳火为正财，地支卯木食神生财，有一定求财的欲望，但财为正财，又辛金印星贴身为用，懂得知足知止，可以得到父母的疼爱关心，辛金为枭神用神贴身，地支卯酉相冲，酉金来制卯木食神，
          又巳火空亡，癸水为阴水，年支未土临华盖，性格相对较为内向，人比较稳重。时支酉金临天德贵人，且印星贴身为用，比较仁慈善良的一个人。
          八字五行比较流通，卯木生巳火，巳火生未土，未土生辛金，辛金生癸水比肩，流通生入日主，八字中和偏弱喜流通，这种组合也表示相对较为和顺，但是如果遇到大运流年五行介入，阻断五行流通的时候，则不吉，容易发生大的波折和阻碍，为有利有弊的地方。
          结合大运走势来看，早年走的是甲午，乙未，丙申大运，甲午大运，地支巳午未三会火局，虽流通有所阻断，但没有损害辛金印星，乙未大运也没有阻断流通，故早年相对较为顺利，没有太大烦恼。
          但丙申大运，丙辛相合，财星克印，地支巳申相合，五行流通的局面被打断，且印星被合克，所以运势不吉，很容易有大的波折。
          接下来走的是丁酉，戊戌，己亥大运，丁酉大运没有阻断流通，戊戌大运虽戊癸相合，卯戌相合，但不影响大的流通，己亥大运，地支巳亥相冲，有一些波折，但总体而言，最不顺的时候基本已经过去，为值得欣慰的一面。当然，这只是大运的影响，也要结合具体流年来看，不过大方向是好的。
          癸水日主在地支无根，八字总体偏弱，时支虽见酉金印星，但还是有气无力，酉金力量也不强，癸水属于是漂浮之水、无根之水。
          加上癸水本身是雨露之水，雨露之水的特点就是不持久，阳光一出来，很快就会消散了，加上癸水又无根，这样的组合也代表做事缺乏坚持，容易变来变去，浅尝辄止，做事很难专注，在遇到大事需要决策的时候，摇摆不定，缺乏主见，都是不利事业发展的地方，要着力克服。
          癸水日主在地支无根，八字偏弱，不能担财，八字巳火财星当令，得卯木食神生扶较旺，身弱难胜财官，代表求财辛苦，得到的财非常有限，操心操劳较多。
          巳火财临驿马，为动财，也有财来财去，过路财神之象，这种组合非常适合财务会计行业，过手很多钱却不是自己的，可以在一定程度上化解个人钱财的破耗花销，有利聚财。
          且八字印星为用，印入门户，日坐卯木食神，食神生财，能尽力去考会计资格证书，提升专业技术，对于事业发展和财运提升非常有利。但从你八字来看，要克服三心二意的心理，把一个领域和专业做好则可，不可东一榔头西一棒槌，专注一个领域，不要去发展副业。
          月柱癸巳为比肩制财的组合，表示要跟着别人做，才有更好的财运，进大一点的平台公司为好。
          但要特别注意的是，八字五行虽流通，但更多五行之气流通入癸水比肩，为“双刃剑”，虽然代表能够得到贵人的帮助，但也容易遭遇小人，钱财方面要谨慎处之。
          日支卯木食神可代表女儿，地支卯酉相冲，子女宫和子女星相冲，为女儿远走之象，很容易不在身边，女儿比较聪明伶俐，仁慈善良，未来发展较好。
          你现在走的是丁酉大运，地支酉金被天干丁火盖头，为财星制印的大运，想买到理想的房子较为困难，最早2024年，或2028年，2029年，2030年有机会买到理想的房子。换工作的话，2022年，2023年财运不太稳定，能求稳为好，2024年后可考虑换工作。
          婚姻分析：年支未土为七杀，月令巳火暗藏戊土正官，未土七杀在年，又巳火临驿马，属于会远嫁他乡，和原生家庭不会很近。
          癸卯日出生，日坐卯木食神，又辛金印星贴身，癸水在地支无根，巳火当令较旺为情根代表容易动感情，在感情上没有主见没有定力，容易相信花言巧语，也容易被表象所欺骗，难以看透本质，这是要注意的。
          日支婚姻宫为卯木食神忌神，代表会为了家庭和子女而操心操劳很多，相对配偶，自己是付出更多的那个人。
          年支未土七杀代表丈夫，七杀为忌，代表丈夫能力不强，但未土七杀来生辛金印星，流通入日主，代表丈夫对自己和家庭是有一定帮助的。地支卯木为食神忌神，卯酉相冲，婚姻宫逢冲，婚姻易有波动。
          2023癸卯年，和日柱伏吟，卯木引动八字卯酉相冲，2024甲辰年，地支辰土官星出现，酉辰相合，这两年可以有缘分遇到。
          大运分析：32岁-41岁走的是丁酉大运，此大运地支酉金被天干丁火盖头，为财星制印的大运，虽不阻断流通，但代表财运较为一般，且财运不稳，时好时坏，花销破耗较多，但也有买房的机会。地支酉金引动八字卯酉相冲，婚姻宫逢冲，有再婚的运气，但也要注意感情和婚姻的波动。
          42岁-51岁走的是戊戌大运，此大运干支一气为官星，和八字日柱天合地合，正官合身，代表婚姻感情较为和顺，夫妻较为和睦，幸福感不差。事业上总体也趋于稳定，可以上班求财，但工作上难免有一些压力，地支酉戌相害，酉金受损，要防钱财破耗。
          52岁-61岁走的是己亥大运，此大运地支亥水被天干己土盖头，地支亥卯未三合，解了八字卯酉相冲，表示婚姻感情相对较为和谐，家庭比较和睦，事业上也相对稳定，能稳定求财最好，可以安享晚年。
          你尤其在感情上要特别注意这一点，已经在一块石头上绊倒两次，但希望不要再绊倒第三次，再遇良缘也要多方考察，知己知彼后再定终身，这对于后半生事业、家庭、孩子都至关重要。
          `
  }]
}

export default {
  酉时
}