const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '枭神   正财   日元   正财',
  天干: '辛(金) 丙(火) 癸(水) 丙(火)',
  地支: '酉(金) 申(金) 酉(金) 辰(土)',
  遁藏: '枭神   正印   枭神   正官',
  大运: '乙未，甲午，癸巳，壬辰，辛卯，庚寅，己丑，戊子，6岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/355.html',
    命主甲: `2020家里情况特别的糟，我老公是主做砂石料生意的，人家做这个都能挣钱，但是他这几年的摊子有点多，没挣到钱，反而欠了一屁股债，经济压力特别大，外债特别多，每天都有催债的电话信息什么的。
          婚姻处在离婚边缘，他和我谈过离婚的事，理由是为了孩子们好，为了我好。我时常觉得他这个人难以托付，不可靠，我也有很多缺点，我们交流不多，
          但为了两个孩子我还是愿意和他过下去，如果是真的离婚我现在也能想得开，唯一怕的就是我帮他借的钱能否还上。
          `,
    珠玑: `八字分析：癸水日主生于申月，为正印格，但年支和日支均为酉金，年干又透出辛金，偏印过重。时支辰土和酉金一合，更加重了偏印酉金的力量。综观全局，只有两个虚透的丙火财星，地支没有火来制约偏印，所以一旦出现食神偏印就会夺食。
          并且，偏印也代表头脑，偏印配置适当人会很聪明，但为忌时往往聪明反被聪明误，容易受骗犯糊涂。
          事业分析：八字印星多且旺，想法会比较多，但容易想当然，把事情理想化，缺乏现实实际，而且主见不够强，容易被别人动摇，这是做生意的大忌。同时八字财合印，代表自己会有想要自己做的信息，
          只是八字组合上，财弱印旺，容易想当然，自己想的和现实情况有差距，考虑不不周而戳不及手，导致破财亏本。而八字印星重，时柱杀印相生，又比较固执，听不进别人的劝。
          年柱，日支全是偏印忌神，时柱丙辰虽然财官印相生，但八字印星旺导致泄正官太过，同时印旺生日主，也消耗了财星力量，八字中虚透两个正财，月干的丙火财星被年干辛金偏印贪合力量全无，时上丙火正财被泄，力量也打折扣，虽然日主左右财星，但财星力量很弱，又没有食伤来生财，命里的财运不旺，原八字的格局层次不高。
          结合大运走势看，一路走的比劫，正偏印的大运，大运也不是很好，多对八字原局没有好的帮助，容易辛苦忙碌，付出多，而没有太多收获，加上有劫财大运，如果踏踏实实还好些，做生意很容易血本无归，破财欠债。
          他目前走的是壬辰大运，劫财克财，地支辰自刑，且辰酉化金，增加偏印的力量，代表是闹经济纠纷矛盾的信息，容易举债过日子，从他的运势发展看，后面个别年份相对好些，能够还清债务，但时间比较久，要有过苦日子的心理准备，踏踏实实才可以了。
          婚姻分析：八字酉金为婚姻宫，婚姻宫酉酉自刑，且辰酉合，婚姻宫刑而逢合，婚姻宫时好时坏不太稳定，也容易滋生不合的烦恼矛盾，同时他八字印旺，也比较固执，有时候偏激，夫妻相处之间，沟通不太好。
          婚姻宫为忌，而月干透出的丙火正财妻星被合，时干丙火正财也被泄耗，属于妻星弱且被制，与妻子的感情缘分不深，也有些克感情婚姻，不利妻的信息。
          而印星过重，在事业代表忙碌操劳，在感情代表烦恼，也容易因为婚姻的事情而懊恼，烦闷，有分离的危机隐患。
          大运分析：36岁-45岁他走的是壬辰大运，大运与时柱天克地刑，大运劫财克八字中的财星，属于财运受阻的运气。而地支正官泄财生印，对于做生意来说也属于钱财损耗，破财的信息，同时印旺官星自刑，也很容易发生经济纠纷。此大运他的财运明显不好，做生意是不好的，只有个别流年好些，但好的也是有限。
          46岁-55岁他走的是辛卯大运，大运天干地支枭神夺食，且原八字年月干丙辛合，大运与时干丙辛合，八字财星双双被合，代表没有什么现金，资金被占用非常大的，加上地支卯酉冲，又是枭神夺食的组合，求财易受阻，且决策也容易失误，导致困难重重，不适合搞经营，此大运整体也不理想。
          56岁后庚寅大运，正印生日主，地支伤官被克，财源在地支难生到日主，且被印冲克整体运势也好。己丑大运与八字财生杀印相生，增强印的力量，此大运也是不好。
          他的八字印旺为忌生日主，虽然透财星本为喜，但财星无强根，又没有强旺的食伤星来生财，导致命中财运不旺，而印旺与财相合，所以会有投资创业的行为，但财星被合，被正官泄太过，同时财弱也被泄，说明财源是不旺的，老老实实上班还好，做生意容易破财债务纠纷，
          加上大运走的不是很好，虽然能够慢慢还清，但会长时间陷入生活拮据的情况，要有心理准备。
          他乡花似锦，我去不逢春。只看到别人做的事业好像挺赚钱，似乎挺轻松，其实只是看到表象，任何一份事业，只要做的好，都有背后你看不到的付出，无法想象的努力，真正要了解的是别人是怎样做的，付出了什么。
          某种角度来说，一个人成功的程度，和对这个世界认知有关，之所以会破财亏钱，是对这个世界，对你要做的事情认知不够，认知有缺陷，赚不到超出你认知范围之外的钱，即使因为偶然赚到钱，也会因为认知不够而亏掉。
          `
  }]
}

export default {
  辰时
}