const 申时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   伤官   日元   正官',
  天干: '丁(火) 壬(水) 辛(金) 丙(火)',
  地支: '酉(金) 寅(木) 未(土) 申(金)',
  遁藏: '比肩   正财   枭神   劫财',
  大运: '癸卯 甲辰 乙巳 丙午 丁未 戊申',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/102.html',
    命主甲: `去杀留官得清纯，夫荣妻贵好运随`,
    珠玑: `此造出生日日干为辛金，属辛金命，生于初春正月寅木当旺之时，这时会有什么主要特征呢？这个很重要，因为它决定了你需要什么？不需要什么？所以论命便可以从这里开始，作为入门的窗口。
          首先从春、夏、秋、冬四时来看，春天木最旺（旺），火次旺（相），土最衰（死），金次衰（囚），水衰（休）。这里是辛金命，生正月，便可知辛金日主出生时就属衰竭，这就需要有土、金来帮身。其次，初春犹有余寒，喜见有火来解寒取暖。
          于是用上面两个条件，看在其余六个字中（除了日干和月支的六个字）来去衡量，有没有满足到此条件。
          观其八字，天干透出丙、丁两个火，地支有寅木为根（寅中藏甲木、丙火、戊土），这已经不寒了。又看日主辛金自坐未土，未中己土可生金。年支是酉金，时支是申金，这两个金是辛金日主在十二地支中最强的根，一个叫临官（禄），一个是帝旺（旺），辛金日主得此禄、旺之强根，和己土之生，便由弱中转旺了。
          现在综合起来看，此辛金命由初春的衰竭余寒，经八个字的整体配合后，已经转弱为强，由寒变暖了。
          这个是女命，以火（官）为夫，天干透出两个火，女命官杀混杂，当然不会是好事了，夫多不贵。未婚前，等于有两个男朋友，不知挑选哪一个才合适，有招嫁不定的意思。在婚后，指除了丈夫之外，还会有一个男人，岂不是会应婚外情？所以在此命中，天干透出两个火（官）不是好事。
          但现在又看到有一壬水在丁火旁边，这壬水是辛金命的发挥星，又叫伤官，因为它能克制丙火正官星（水克火），如果两星（正官与伤官）同见，谓之伤官见官，指会有伤害丈夫（克夫）之症。
          也就是说，在此命的配合中，丁火官星是多余的，因为取暖有丙火太阳就够了，多了丁火，就会应验官（夫）多不贵的现象。同时，壬水伤官会伤害丙火丈夫星，也是不吉。
          但现在刚好看到这两颗不利的星连在一起，便会产生一种“丁壬合化木”的现象，但在此造中，由于地支有申、酉两强金，化木不会成，但丁壬合而不化，两者各失其用，即伤官壬水不会去伤害丙火夫星了，而丁火官星被壬水合住，也就不会产生婚外情或招嫁不定等夫多不贵的现象，这就是配合得宜的好现象了。
          由于地支中有申、酉两强金，和己土生金，使得此造辛金日主属强，强则喜克或泄，正格以中和为贵。现壬水被合，不能用泄，唯用丙火克制强金为用。即身旺喜财（木）生官（火）为用。
          此造月令寅木藏甲木、丙火、戊土，唯见丙火透出天干，丙火是辛金日主的正官星，于是取为正官格。正官乃天地之正气，忠信的尊号，治国齐家的要道，为各种格局之首。
          唯正官格最怕官杀混杂，即正官和偏官（七杀）同透天干，刚好此造就是丙火正官和丁火偏官（七杀）同时透出天干。正官格也怕伤官见官，为祸百端，刚好此造也是壬水伤官见到丙火正官。
          但幸好此两颗凶星（丁火七杀和壬水伤官）连在一起，而成“丁壬合而不化”，等于七杀与伤官同归于尽，成全了格局纯正，配合得宜。身强以月令寅木生丙火为用，用神得时得力，合于命局的需要，于是便成为富贵吉寿之好命了。
          此命喜木、火，忌土、金、水，早年一路东南木火运，夫荣妻贵。
          `
  }]
}

export default {
  申时
}