const 申时 = {
  公历: [{
    甲: '1986-02-14 16:30:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '正印   伤官   日元   正财',
  天干: '丙(火) 庚(金) 己(土) 壬(水)',
  地支: '寅(木) 寅(木) 丑(土) 申(金)',
  遁藏: '正官   正官   比肩   伤官',
  大运: '',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/324.html',
    命主甲: `目前是一名公务员，不知道自己是一辈子在基层，还是有机会往上走，将来能够做到什么级别。
          一直以来我的考运不好，特别是在考研究生时，一共参加了三次考试，但是结果都不好，后来在2014年考取了教师，但是觉得自己不适合这条路，所以就去考公务员，五年后终于考过了，但是这时自己也30多岁了，
          总的来说自己在年轻的时候真的道路曲折，很不如意，如今自己年龄很大，但是资历很浅，也没有入党，所以前途上很是渺茫，看到师傅建议我提升学历，所以我决定去参加在职研究生的学习，提升自己的学历，好对自己的事业有帮助。
          `,
    珠玑: `八字分析：日干己土，在正月出生不得令，初春季节木旺土弱，尚有寒气，故喜火来暖局为吉。八字日干不旺，命中有丙火可以生己土，也可以庚金，庚金为忌神也为伤官星，所以伤官配印，整个八字的组合还是很不错的，一生的际遇很好，可以遇见很多的贵人。
          由于伤官无制，生了壬水财星，为财星无制的命，八字中官星太重，又生在初春，喜火来泄官生身，喜土来帮身制财。八字中用神为火土，忌神为金水木。
          仕途分析：一个人的官运如何，是要看官星和印星的，如果八字中没有这两个符号，说明自己没有太大的欲望当官。如果官印很多，说明自己有很大的欲望，十分的渴望权力，会想尽一切办法得到它。
          你的八字中正官当令，且为正印格，时干透正财，坐申有气，一般这样的八字适合在单位上班，从事比较稳定的工作为好，但是这样的命格如果想去创业，则是要顾虑很多的，会很困难。
          因为你的正星旺，往往没有什么魄力，不敢去冒险，比较喜欢稳定，这样的性格会和机遇擦身而过。一般这样的八字比较喜欢上班不太想去创业，也没有这样的念头，如果一个人的八字偏星很旺，那么他就算是在单位上班，也会想去搞一些投资或者是副业，不满意这些工资的收入。
          你八字的格局还是不错的，也是非常利文化的八字，有正官和正印，是可以有升职的机会的，如果在走印旺的大运时，就会获得更好的职位。由于伤官坐财，伤官本身又是驿马，所以这样的命格适合去外地工作求财会更好一些。
          伤官加驿马，也说明你的思想不太稳定，有很多的想法，伤官生财，求财的欲望极大，但是偏财运不好，所以不太容易获得那些意外之财。
          大运分析：你在26-36岁走的为癸巳大运，癸水为偏财，和命局中的正财构成财星混杂，花销很大不容易聚财，是很不利财运的。另外偏财透出说明会有桃花，自己一定要多注意，应该娶远方的女子，比自己小一些为好。
          这期间财星破印，也是不利学业和事业的，财星受制说明自己的事业没什么发展，总是被压着无法出头。
          特别是今年和大运相克冲，是不太顺利的，亥水为驿马和财，所以奔波走动很多，非常的劳累。亥水冲印则说明妈妈和自己的健康不好，考试运不好。不过你八字喜印，所以多提升文凭对你的事业是很有帮助的。
          你在36-46岁走的为甲午大运，这十年运势非常不错，可惜大运空亡，要减少一半的吉祥，更要多付出努力才可以。甲木为正官，也为忌神虚透，而甲己相合，说明你可以获得这个官，是有升职之运的。
          午火为印可以生身，所以机会变多，阻碍减少。整个大运是非常不错的，不过走仕途不单是能力的问题，还是得学会交际，处理好和同事的关系，维护好和领导的关系，做人圆融一点才可以走的更远。这一个大运一定要好好的把握，在事业上是有提升的机会的。
          你在46-56岁走的是乙未大运，和日柱克冲，则原局中土更弱，加上官杀混杂，所以这十年的变动很大，尤其是和同事朋友之间，千万要多注意，因为容易关系破裂，有小人生事。
          在46岁后，就不要太执着于职位的升迁了，应该顺应缘分，做好自己的分内事就可以了，以退为进是最好的路。所以你只有在36-46岁这十年可以奋斗，过了46岁后，就要减少野心，以稳定为主。
          `
  }]
}

export default {
  申时
}