const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '一九八四年三月初八卯时'
  }],
  十神: '食神   七杀   日元   劫财',
  天干: '甲(木) 戊(土) 壬(水) 癸(水)',
  地支: '子(水) 辰(土) 申(金) 卯(木)',
  遁藏: '劫财   七杀   枭神   伤官',
  大运: '丁卯，丙寅，乙丑，甲子，癸亥，壬戌，辛酉，庚申，2岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/356.html',
    命主甲: `小时候家里穷，父母常吵架打架，更谈不上得到关爱，再到弟弟出生，家里重男轻女，不知美好童年为何物。刚上高中，父母闹离婚寻死觅活，闹得我也无心读书，辍学打工，所幸父母没离婚，我们长大后家庭条件也好了，一家人也算和和美美。
          我以为我会像很多人一样过完平凡幸福的一生。第一次谈恋爱的对象因为我母亲不同意分分合合几年他劈腿分了。转眼28认识了前夫，婚后他想当老板到处借贷，没有收入，无论怎样劝说无效，还去了其他城市闯荡，他的不务实和长年分居，无小孩维系感情，年复一年借贷抵押车子房子，我耗尽了心力，6年的婚姻走到了尽头。
          后来又认识一人，殊不知他跟一女孩和前妻纠缠不清，在原谅和放手之间纠结的时候找老师合婚，老师不建议继续，遂放手。
          经过这些，无心感情婚姻之事，每当闲暇，环顾周围的朋友，都家庭幸福，妹妹有房和车，弟弟有父母赠予的房和车，反观自己，一无所有，父亲常叹我不争气，想起这些非常自卑，对未来迷茫恐惧。
          `,
    珠玑: `八字分析：壬水日主生在辰月的失令，而且戊土透出在月干上，月柱干支一气克日主，而地支表面上是申子辰三合水局生壬水日主，但实际上月令土透出，所以这三合不成局的，而壬水坐下申金且有辰土生助，为土金相生的组合对日主有一定帮助作用，同时年干甲木坐下子水，甲木力量也不弱，甲木克戊土护身，也是有好的作用。
          而戊土和癸水贪合，也削弱了克日柱的量，但这两者本身都是克耗日主的五行，而地支虽然有子水，但被月令辰土阻隔，所以子辰论合克。而时干癸水虽然贴身帮日主，但坐下卯木泄水，所以癸水的力量是比较弱的，所以总体而论壬水日主是偏弱的，喜生助的五行为金水五行为用神，以火土的五行为忌神。
          事业分析：你的八字当中，天干的癸水劫财为用神，但是被月干的戊土七杀所合，代表忌神和用神相互制约的局面，有所损耗，对你事业属于有吉有凶的组合。而日支为申金偏印，有杀印相生的组合，同时天干有食神制杀，且劫财于七杀相合抗七杀，说明你是比较有事业心的，对待事业也比较积极努力，在求财过程中容易有贵人缘帮助，对你的事业有好处。
          这样的八字组合，也就代表你在遇到困难的时候，只要自己食神制杀积极进取的作用，再借助他人的力量来抵抗七杀，那么你遇到的困难最终是可以解决。
          结合你的大运走势来看，早年两步运走的是财星大运，属于忌神的运势，且七杀得到生助，所以你小时候生活条件不太好。而你后面开始走食伤，比劫，正偏印的大运，对你的发展是帮助比较大的，也代表你的家庭经济条件也会好转，宽松。
          从你的命组合看，你八字印比为用，故而比较适合从事些文印，整理后勤，健身养生，物资采购方面的工作。同时八字食神制杀，地支杀印相生，所以你也有一定的管理能力和魄力，适合往经营管理及文化教育，经营销售方面去发展。
          婚姻分析：你的八字壬水日主坐下申金为长生之地，地支杀印相生，年支为阳刃，代表你比较有主见，但也因为地支杀印相生的关系，天干食神制杀的关系，七杀得有制化，这就让你对感情方面会有些错觉，对感情会有些想当然，过于自信的问题，会觉得自己能把控住对方，认为对方总会对自己好。
          而实际上你的八字见七杀不见正官，七杀代表的就是不那么正的缘分，容易遭遇烂桃花，比如一脚踏两船，有不良嗜好，人品不太好的男人。
          而八字天干戊癸合，地支子辰合，癸水和子水都为劫财，劫财代表的是其他女人，又与你八字七杀星都有相合的关系，且婚姻宫申金与时干劫财的宫位卯申暗合，同样也是代表你很容易遇到烂桃花，被其他女人插足，对象也有出轨方面的信息。
          你的八字七杀为男人，虽然也有制化，但戊土七杀和癸水劫财又贪合而多情，所以很容易有沾花惹草，会有花心，一脚踏两条船的信息，人品不是很好。也容易因为这些因素导致你的婚姻不稳定，存在会有危机，有离婚信息。
          你现在走的是甲子大运，大运与年柱伏吟，地支子水为劫财与婚姻宫相合，对你的婚姻更不利，感情更容易被其他女人插足，你与目前的对象很难走到一起。
          结合你后面走的大运来看，对感情发展也不太有利，想遇到好的感情结婚也是比较难，感情会比较曲折多阻碍和挫折。在2021年的官印相生感情运相对好些， 有遇到机会。
          对象方型脸，身材微高，肤色微黄中带白，眼睛比较大，也比较的有神。鼻子挺直鼻尖肉多，嘴唇微厚，眉毛浓密，声音不是非常的宏亮，身高在178厘米左右。职业与金融财经，生意经营，技术研究相关。
          大运分析：32岁-41岁走的是甲子大运，此大运与八字年柱伏吟，同时食神透出代表你的想法比较多，也不太稳定，且容易有些急于求成，反复矛盾的想法。而地支劫财帮身，对求财还是有帮助的，也能得到别人的帮助而获得发展收获，但是不要太急躁，会因为缺乏耐心而导致事业不稳定。同时地支子卯刑，也代表要注意人际关系不太好。
          而感情方面食神旺而多现，地支走劫财伏吟运气，婚姻宫被劫财合入，所以你的故婚姻运是不太好的，容易烂桃花，也容易被人插足，感情运也比较弱，且不太稳定。
          42岁-51岁走的是癸亥大运，此大运与月干戊癸合，地支亥水为甲木长生之地，八字劫财抗七杀，而食神力量的生助，地支亥卯半合助食伤。八字大运比劫帮身，食神为财源，代表你比较积极努力上进，也容易获得他人帮助，事业可以往更好的方面发展。
          而感情方面此大运走的比劫大运，而且比劫旺，婚姻宫又是申亥穿害，对于你的感情也是不好，同样要注意婚外恋，第三者插足的问题，争吵矛盾也比较多。
          后面的壬戌大运，为比肩加七杀的大运，比肩帮身为吉，而地支辰戌冲土旺，对你求财不太有利，运势发展也不太平稳，属于吉凶参半的运气，而此大运七杀被冲动，代表相处也是不和谐，矛盾口角多。感情运比较一般。
          辛酉大运和庚申大运为正偏印大运，八字正偏印生身对你整体发展是比较有帮助的，只是在在想法上会比较多，容易操心劳累，顾虑多，晚年整体运气一般。
          你对感情一旦投入进去会比较用心，但你的八字又很容易遇到烂桃花，加上劫财合七杀，婚姻宫又与时干劫财的宫位又暗合，也代表感情容易被第三者干扰。
          地支杀印相生，天干食神制杀的关系，七杀被制化，代表你遇到烂桃花的时候，又会有种对自己感情能够把控住的错觉，对感情有些过于自信，择偶能力或者说择偶眼光不太好，也导致了你目前的感情状态。
          一个男人在你不舒服的时候嘘寒问暖，给你打热水，大半夜给你买宵夜，体贴入微让人感动，但其实这些很容易做到，真正应该考察的是他的谈吐，修养，责任心，对自己情绪的控制能力，掌控人生方向的能力等，一个人要伪装这些不容易，要保持则更难。
          择偶上建议你首先考虑可以过日子的，而不是考虑多优秀，多有情趣，因为你很难把握住，降低要求找个人搭伙过日子还可以，如果要求太高，婚姻还是会出问题。你的八字婚姻宫为偏印，地支杀印相生，且申中藏壬水，代表的是结过婚的，年纪比你大一些的会更好一些。
          你的八字月柱七杀干支一气力量强，有食神制杀，劫财合杀的组合，为八字七杀贪合，容易出现劫财合杀，而食神制不全七杀 ，地支七杀贪合而生助七杀也容易受到干扰。所以八字七杀星旺，好在有一定的制化，且得比劫来帮扶合拌七杀，加上后面大运走的也还算可以，对你的事业有好的帮助，事业能不错的发展收获，你后面事业也能更上一层楼。
          `
  }]
}

export default {
  卯时
}