const 酉时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   正官   日元   劫财',
  天干: '壬(水) 癸(水) 丙(火) 丁(火)',
  地支: '申(金) 卯(木) 午(火) 酉(金)',
  遁藏: '偏财   正印   劫财   正财',
  大运: '壬寅，辛丑，庚子，己亥，戊戌，丁酉，丙申，乙未，9岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/493.html',
    命主甲: `这两年开始回想从小到大的一些经历，刚出生脐带没剪好，母亲听邻居的偏方至使肚脐偏上一点烫伤愈合后疤痕上只有很薄的一层皮，不知是否会影响以后生育？
          好像从起运每年的农历10月或11月总有不好的事发生；还有每年的7月总是有是非是命带犯小人吗？身体健康一直还好但意外也没少，右手有严重刀伤9岁手拿刀走路摔跤自己割伤，腿骨折过。
          家境贫困15岁母亲病逝，小时候挺内向的依赖性也比较强，母亲走的早对我心理影响很大，今年又经历父亲离去真是体会到了父母在人生尚有来处，父母去人生只剩归途更加伤心难过，很想知道我跟六亲的关系和我的性格，细算和家人相处时间都不长，但相处的过程和经历一些事情后让我苦恼感觉六亲缘浅无靠。
          这几年工作不稳定遇到不少挫折，父母的婚姻不幸福让我很恐婚也一直没有谈过恋爱，现在年龄不小了可选择的可能性也不多更担心遇人不淑。
          `,
    珠玑: `八字分析：丙午日坐阳刃，平时磕磕碰碰难免，对婚姻也有一定程度的影响。丙午卯月，印星和阳刃相破，而且卯酉冲，印星代表住所和工作单位，家庭贫困、父母离婚都是体现，同时婚姻宫被破，再一次说明了婚姻的曲折。地支四正居多，也为桃花，但一旦配合不好就是烂桃花，感情注定波折。
          事业分析：日主坐阳刃，月令正印为人较为传统，也比较的正直爽朗，做人做事比较直接，不懂得拐弯抹角，也比较的固执刚毅。
          官印相生，比劫对抗官杀，自己抗压能力也是较强的，脾气有时也不小，有些急躁，月柱官印流通，劫财合七杀，年支，时支见财星，所以自己也是有事业心，上进心的一个人，且控制欲强，事业心重。
          八字有明显的财克印的组合，父母的关系不是太和谐，问题矛盾也多。同时八字火旺焚木，比劫旺克财星，命里也有不利父母六亲的信息。
          地支也有火克金，金木相克的组合，所以个人健康方面也要多注意些肺部，皮肤病及肝胆，磕磕碰碰受伤，四肢关节的问题。
          丙午日柱，以食伤为子女星，八字中子女星隐藏不显，以子女宫作为子女的参考，子女宫见劫财，子女宫逢午酉破，丁火盖头酉金，命里也有不利子女的信息，八字原局来看子女运一般，缘分不太深，好在大运走的是利子女运的运气，大运弥补子女缘分不足的问题，对子女运也有帮助，也有些子女方面的福分。
          日主偏旺，而印当令劫财旺透出，八字中印比劫力量大，对你的运势不太有利，时支的酉金正财被劫财围困，被劫财克制，钱财收入不会太多，事业竞争大，也容易招惹小人，也容易不聚财，留不住财。
          年柱壬申是偏财生七杀，月干正官，官杀得生助克八字中的比劫，代表发展中也能获得他人的帮扶，官杀在年柱长辈，同时也代表领导，所以要注意维护好与领导的关系，才能在工作中帮你一把，月柱官印相生，命里是会有定职位的，只是日主偏旺虽然不惧官杀混杂，但杂而不纯影响层次。
          结合大运走势来看，一路走北方水到西方的大运组合，对你的发展还是有帮助的。
          八字比劫旺，正财在地支被克制，有官杀透出克比劫，对你的发展有帮助，以财官杀为用神，用神干支相生在年柱，适合一些经营管理，国企事业单位及金融财会方面发展。
          婚姻分析：婚姻宫午火劫财，女命婚姻宫为劫财，鸠占鹊巢，其他女人入住了你婚姻宫的正位，容易有其他女人干扰你的婚姻。
          年干，月干见官杀，先七杀后正官，也容易遇到烂桃花或者容易遭遇感情的挫折后才有好的感情运气，早婚容易有离婚的危机。
          月令和时支为年日支的桃花，只是月令桃花生劫财，时支酉金桃花之上也是丁火劫财，所以你的整体婚姻要注意外界干扰，也容易遇到烂桃花，提防遇到脚踏两条船的人。
          你目前走庚子大运，财生官，生助夫星，当2023年太岁流年正官再透出时有结婚的运气。你的婚姻宫劫财为忌神，代表另一半家庭条件一般，对你帮助不大，或者存在隔阂矛盾，而月柱官印相生，五行流通，为人能力是不差的，婚后通过努力也能够更好些。
          对象身高中等，脸型方正，肤色微红润，眼睛有点大，双眼皮，炯炯有神，鼻尖丰隆，有财气，嘴唇不厚，声音洪亮，身高在175左右。
          大运分析：29岁-38岁走的是庚子大运，此大运属于喜神的运气组合，但此大运与日柱天克地冲，引动比劫，同时地支子申半合官杀局旺，官杀混杂，存在克战关系，地支有卯木流通会也会有些收获，同时天干劫财被克制为吉，但同时也要注意理财 ，容易财来财去。
          大运财生官，夫星临地支冲入婚姻宫，有结婚运气，同时官杀混杂力量增加，也会遇到烂桃花，地支冲动劫财，也要注意第三者干扰。
          39岁-48岁走的是己亥大运，天干伤官见官，地支亥卯半合，金水木火流通相生，对你的事业也有帮助，会有相应的进步收获。但伤官见官，要特别注意口舌是非。大运伤官见官，地支午亥暗合，一方面婚姻矛盾争吵会多，要预防第三者，自己也会有桃花运，容易有感情误会及纠缠。
          戊戌大运，泄劫财，制官杀泄秀，同时地支财星力量得生助，财运会有所增加，属于好的运气组合，钱财也会富足些。官杀被合，且食神合入婚姻宫，感情分歧矛盾时有发生，但此大运问题不大，注意通即可。
          丁酉大运，丙申大运，天干比劫，地支财星力量增加，属于有利有弊的运气组合，八字中喜用神没有明显受伤，晚年运不会太差，也会有发展收获，注意理财，防止不必要的支出破耗，也不要借钱给他人。
          你的八字日主当令，得印生助，日支又坐强根阳刃，时干透出劫财帮身，官印相生，生助日主，日主旺能任财官，年柱财生七杀克合劫财，对你的事业是有帮助的。
          但地支正财被劫财克破，容易财来财去不聚财，提防小人损友，不要轻易借钱给他人，大的金钱父母，不要轻信他人，容易破财。
          结合八字大运走势看，八字一路走财，食伤及北方，西方地支大运，对你整体发展有帮助，你后面事业有发展提升空间，钱财收入也还会更好些。
          `
  }]
}

export default {
  酉时
}