const 寅时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1992年二月十七日寅时'
  }],
  十神: '正印   枭神   日元   正财',
  天干: '壬(水) 癸(水) 乙(木) 戊(土)',
  地支: '申(金) 卯(木) 未(土) 寅(木)',
  遁藏: '正官   比肩   偏财   正财',
  大运: '壬寅，辛丑，庚子，己亥，戊戌，丁酉，丙申，乙未，6岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/342.html',
    命主甲: `亲生父亲重男轻女，后面他出轨，我9岁父母离异，我跟着母亲过，从小性格内向，不善言辞。读书也不开窍，普通专科毕业。早早踏入社会，因机缘巧合考上三支一扶，想稳定走编制内发展，可能好运气用完一直考不上。
          读书期间没有谈过恋爱，工作后，母亲催促23岁就结婚了。我先生比我大几岁，他童年也不幸福，成长经历复杂。虽然大家都有性格上的小毛病，但他还是比较包容我。
          可刚在一起的前几年，2天一小吵，3天一大吵。以前有师傅说我婚姻不好，容易二婚。不知是不是这个原因。或者是我自己性格不好，特别暴躁。
          19年意外怀孕，起初我不想要，觉得养不起，我妈硬要我生二胎，受她的话影响。后面妥协，然后辞职，现在待在家带孩子。虽然我母亲一直补贴我，但我不想一直啃老，靠先生一个人养家，想自己找个工作减轻压力。
          但是20疫情影响，工作不好找，自己也没有什么技能。
          `,
    珠玑: `八字分析：乙木生在卯月得令，卯月为春季木最旺的月份，木气强旺，而年柱是壬申，金水相生五行力量集中在壬水上，同时月干透出癸水，且天干壬癸水相邻，增加水的力量去生日主，对八字有明显的生助力，
          而时支又逢寅木阳刃强根，虽然日支是未土，但在地支被两木夹克，时干戊土又坐寅木被截脚，八字日主明显偏旺，喜克泄耗的五行，而八字戊土财星，所以喜火土为用神，金的话容易贪生水而不克木，所以用金不太好。
          乙木得月令，命局年柱官印相生，性曲直而上，为人一般较有上进心，故而你也是个有事业心的人。同时比劫多现，一般为人也较为重情重义，加上印星透出贴身生日主也有比较细腻的思想和行为，同时又是顾虑也不小，想得多。
          而命局日主旺而得印来生，所以有时也会有些急躁，而缺乏耐心；有时做事也不喜欢拖泥带水，效率高，而脾气方面较大，容易心烦气躁而暴躁。
          事业分析：你的八字财星为喜，日支未土是偏财，时干透出戊土正财，八字财星在自己的宫位上，说明你命里是有一定财富的。
          不过你年月都是是印星和比劫的组合，印星双透，且时支是寅木劫财，地支卯木和寅木比劫旺，日支未土偏财左右受克，好比你命里虽然有财，但总有人和你竞争瓜分，且竞争的力量比较大，自己在竞争当中没有太大优势，印星透出也代表事业求财会相对辛苦忙碌，一分耕耘一份收获，赚钱辛苦些。
          天干虽然没有透出比劫克财，但是透出两个壬水印星，对戊土财星也是一种消耗作用，导致戊土力量不强。有时付出没有太大的回报，有时候开支花销比较多。
          从八字原局来看，格局层次高不高，但结合大运走势还算可以，会有所提升，可以达到小康左右的级别。
          国家饭方面，从你八字组合及运势来看，印星双透而比劫忌神旺难制，没有公务员或考入事业单位运势，但45岁后有做生意的信息。
          婚姻分析：未土婚姻宫为喜神，但婚姻宫左右逢比劫围克，所以丈夫对你的帮助不大，且日支婚姻宫是配偶所在的宫位，被围克说明丈夫在婚姻当中不那么好受，而你也比较固执，有时候敏感多疑，控制欲强，而影响到感情关系，平常相处要注意沟通方法，多体现温女人温柔的一面，
          八字比劫旺与婚姻宫相合克，比劫为忌，代表其他女人，要注意第三者女人插足。婚姻组合不是太顺，有潜在的二婚危机。
          现在走的是庚子大运，大运与日柱天干相合克，地支穿害，婚姻宫不太平稳，要注意婚姻矛盾的发生，比如2021年太岁与日柱天克地冲，以及2024年第三者插足，2026年太岁与大运伤官见官，容易有分离的危机。
          健康分析：五行水木相生，木最旺克土，同时地支金木相克，五行金绝力量也是较弱的，木旺泄水，水的五行力量也不旺，健康方面要注意肝胆及肠胃消化，皮肤，气血不足，关节伤痛，肺部方面问题，比如在2022年，2023年，2028年，2029年，2035年及2045年，2053年，2070年的时候要注意。
          子女分析：八字以食伤为子女，子女星藏在未土和寅木中，八字木旺为忌，而火弱，子女运较一般，且子女宫属于土木的干支组合，子女宫没有明显的受克，天干为喜神，加上八字中年大运走的是喜神运，所以中晚年后子女运势还可以，晚年走食伤运，也有子女福分。
          大运分析：26岁-35岁走的是庚子大运，此大运正官被印泄，虽然天干乙庚合，但地支子申半合印局，印生比劫，对你发展不太有帮助，属于比较一般的运气，发展运势被动缓慢，没有什么大的提升。而婚姻宫被子水穿害，婚姻宫不太稳定，加上正官透出，要注意伤官旺及婚姻宫逢冲的年份对婚姻不利，比如2021年和2024年，2026年的时候。
          36岁-45岁走的是己亥大运，此大运偏财透出，但地支亥卯未三会比劫局，运势表面好点，而实际危机重重，竞争大，小人阻碍也多，开支花销也比较大，特别是水木旺的年份，2032年-2035年的时候要多注意下。另外此大运婚姻宫被大运化为比劫，对你的婚姻也是不利的，尤其是2032年，2034年和2035年要注意。
          46岁后分别走戊戌大运，丁酉大运，和丙申大运，这几个大运食伤生财，财星力量增加，地支比肩被冲克，对你整体事业财运有帮助，钱财收入都会增加。只是地支比劫逢冲，同样要注意理财，整体而言中年晚年后的大运对你较有帮助，晚年运还算可以。
          你的原局印星透出，八字比劫旺，印星又生比劫为忌，虽然八字有正偏财，但被克耗，又没有食伤来生助财星，财星不旺，格局层次打了折扣，整体格局层次不高，加上大运走势也不太理想，早年起色不大，到45岁后运势会慢慢的好转，收入也会随之增长，钱财富足无忧些，中晚年好运。
          `
  }]
}

export default {
  寅时
}