const 午时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正印   正官   日元   正官',
  天干: '庚(金) 戊(土) 癸(水) 戊(土)',
  地支: '辰(土) 寅(木) 卯(木) 午(火)',
  遁藏: '正官   伤官   食神   偏财',
  大运: '丁丑，丙子，乙亥，甲戌，癸酉，壬申，辛未，庚午，己巳，4岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/3354.html',
    命主甲: `广西南宁市，从小就学习不好，我是从小到大学习不好文化课成绩没有及格过。我性格很不讨喜性格内向，很不喜欢我的性格。好运没有降临在我身上，人也很怪异。
          初中因为学习不好，我放弃了中考，去读了技校，可能真的不是读书的料，专业没有学成，实习结束之后也没有找到工作，那时候的我很迷茫不知道怎么办？就这样和班里的小伙伴参加了大专的报名。
          那时候的我很憧憬读完大专以后的未来人生，命运就是很喜欢促弄人，在学校双选会上没有看到一家公司是专业对口的工作，我感到很无助，开始反思自己以前做的决定是对的吗？为什么面临准备毕业，还是没有找到一份比较满意的工作呢？
          毕业之后我穿梭于找工作和面试之中，多数情况下去试工一天就不去了，家人一直追问为什么毕业出来这么长时间了还没有一份稳定的工作，让我压力倍感增加，不知如何回复家人。
          后面经家人介绍了工作我去上班了，但只上了一个月多，我选择了离职，后续也是介绍的工作，做了相近四个月就辞职不做了，工作不应该频繁换的，我总是安定不下来，受点气就想着走人，我也知道这样不对。
          现在刚从一家公司离职出来，去培训了三天的时间，发现不是自己理想中的工作，经过考虑就辞职搬东西走人了。我真的很想找到一份可以稳定下来的工作。家人发了一份老家政府的招聘信息给我，是文职工作，不知道自己适不适合回老家发展，是否能面试通过 也知道自己现在的工作能力很差。
          `,
    珠玑: `八字分析：癸水日主生在寅月，为伤官格，日坐食神，食伤很旺，天干透戊，午火偏财生官，官星多而不贵。伤官格宜配印，现在是见了官，官星受克严重，只有印星有力才会有财运。
          事业分心：癸水被两个戊土正官贴身合克，一般来说比较的正直，传统，讲规矩，也比较保守一些，可以服从管教，有一定自制力，可以抵抗诱惑。
          但是，癸水日主太弱，戊土正官太旺为忌神，年干庚金通关无力，平常会有些胆小怕事，性格偏内向，有些自闭，容易压力大，担心忧虑的事情多，忧虑忧愁多，烦恼较多。
          同时月干戊土正官被月令寅木伤官截脚，为伤官克官的组合，加上地支寅卯辰三会木局为食伤局为忌神，有时候会天马行空，不切实际的幻想。
          天干可以代表外在，地支可以代表内心，可以说是属于有双重性格的一个人。虽然讲规矩，保守，但有的时候又不喜欢按部就班，想要创新。虽然有的时候正直，能够服从管教，但有的时候又叛逆，喜自由，有的时候容易给人感觉性格脾气怪异。对未来有美好的憧憬，但又顶不住压力。
          可以说是比较自我矛盾的一个人，犹如心里住着一个天使，和一个恶魔在打架，比较纠结的一个人，找不到自己的定位点，会让自己比较痛苦。
          地支食伤较旺，原局身弱，伤官克官，癸水日主在地支无根，体现为做事不容易坚持，自己缺乏主见，不能经受挫折和打击，较为自我，受不了半点委屈，有孤傲的一面，寅木伤官临驿马，想法也是比较多的，变化比较频繁，心性不定，较为浮躁，很难在一件事上专心致志，为不利之处。
          天干两个戊土官星高透，戊癸相合，正官合身，戊土官星相随，所以内心比较在乎荣誉、名声、地位等，代表人比较好面子，虚荣心较强，眼里容不得沙子。地支食伤生财，时柱财来生官，也代表自己比较在乎金钱和荣誉、地位等。地支食伤旺为忌，同时伤官克官，有的时候会过于理想化的幻想，不切实际，自己很难满足。
          地支寅卯辰三会木局，食伤较旺，适合依靠过硬的技术来求财，可以去做一些行政文员、设计策划、培训讲解、销售、艺术等方面的工作，正官格同时又正官合身，上班求财比较适合。
          地支寅卯辰三会木局，食伤较旺，地支食伤生财，时柱午火偏财来生戊土正官，财官入门户，又戊癸相合，正官合身，但由于身弱不能胜财官，癸水日主又在地支无根，
          月令寅木临驿马，年干庚金印星离癸水日主较远，故很难得到这个财和官，所以在找工作，求财求官上比较辛苦费力，能得到的财也较为有限，唯有大运助身，方能得到较多的财。
          身弱以印星为用，地支寅卯辰三会木局，寅木临驿马逢三会，故能回家乡发展较为有利，政府文职工作也比较适合你，要抓住这次机会，做最充分的准备，尽力展现自己，不是没有机会。
          2022壬寅年，天干壬水劫财透出，有一定贵人运，也代表此次政府文职工作想成功获取，能多找下这方面的关系概率会更大一些。
          婚姻分析：地支寅卯辰三会木局，食伤较旺，癸卯日出生，日坐卯木食神，对未来婚姻感情充满幻想，容易有些理想主义，月柱戊寅伤官克官，对另一半要求较高，有一定标准，一般人难入法眼，癸水日坐卯木食神，配偶一般都是自己钟爱的人，癸水日主被两个戊土官星合克，也代表对待婚姻感情容易有一些压力和烦恼。
          正官合身，戊土正官为忌神，同时戊癸相合，癸戊也叫无情之合，这种组合一般代表夫妻感情婚后会比较冷淡，属于是一种更偏向家庭责任义务，而少了一些你侬我侬的感情亲密关系，感情很容易冷淡僵化，丈夫对自己比较冷淡，脾气也不是很好，少了关心体贴，有一些大男子主义，人略显强势，会让自己感到一定压力，自己在婚姻中比较弱势。
          之前有先生说你容易遭遇家暴，说的是一种比较极端的情况，虽非必然，但丈夫强势，自己弱势，夫妻感情较为一般是基本要发生的，月柱戊寅伤官克官，同时地支食伤旺，也代表你对感情会有些理想浪漫主义的幻想，但求而不得，在感情中容易对对方挑剔不满，说话直接，易有口舌矛盾纠纷，这是要注意的。
          年支辰土为正官，但地支寅卯辰三会木局，辰土正官被合化，名存实亡，这种组合代表早年容易经历失败的感情，有失败的感情经历也相当于化解了部分感情不顺利的问题，天干两个戊土官星争合癸水日主，容易经历二婚，能选择晚婚为吉。
          2024甲辰年，地支辰土正官出现，但辰土被甲木盖头，为伤官克官，且寅卯辰三会，谈恋爱容易多败少成，容易经历失败的感情。
          2028戊申年，地支申金印星出现，命局天干庚金印星有了根，有成家之象，戊土正官透出，戊癸相合，正官合身，2030庚戌年，天干庚金印星高透，地支卯戌相合，戌土官星被合入，这两年有遇到并结婚的运气。
          大运分析：24岁—33岁走的是乙亥大运，此大运天干乙木食神高透，乙庚相合，庚金印星被合拌，唯一用神庚金被合拌，运势较为不利，总体较为低迷，容易错失良机，贵人运较为缺乏，求财辛苦，财运不济。但好在地支亥水为癸水日主的根，通过自己的辛苦付出，可以有一些回报。庚金印星逢合，要注意身体健康，不可太过劳累，要注意鼻子，肺部，肠道方面问题。
          34岁—43岁走的是甲戌大运，此大运地支戌土被天干甲木盖头，为伤官克官的大运，天干甲木来制戊土，也为伤官克官，此大运要注意官非口舌之事，容易对领导同事工作等有所不满，也易发生争吵不和，工作容易变动，不太稳定，也容易反映在婚姻上，易对丈夫不满挑剔，容易发生争吵矛盾，要多注意。
          44岁—53岁走的是癸酉大运，此大运行金水印比，大运来助身，总体运势有所改善，事业运和财运均有提升，事业上有升职发展的机会，要好好把握。天干戊癸相合，癸水比肩争合戊土，地支卯酉相冲，酉金桃花来冲婚姻宫，要注意丈夫身边异性情缘，防三角恋、婚外情，也要注意婚姻有所波动。
          54岁—63岁走的是壬申大运，此大运行金水印比，天干壬水劫财助身，地支申金来制食伤，总体运势较为不错，事业上较为顺利，可以得到贵人相助，有望做出成绩，施展才华，有升职机会，财运也较为不错，可以考虑去做一些小的投资，有望赚到钱。
          `
  }]
}

export default {
  午时
}