const 午时 = {
  公历: [{
    甲: '1993-05-06 11:15:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   比肩   日元   劫财',
  天干: '癸(水) 丁(火) 丁(火) 丙(火)',
  地支: '酉(金) 巳(火) 亥(水) 午(火)',
  遁藏: '偏财   劫财   正官   比肩',
  大运: '戊午，己未，庚申，辛酉，壬戌，癸亥，甲子，乙丑，丙寅，11岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/484.html',
    命主甲: `出生广东广州。原生家庭条件一般，从小比较懂事上进。我毕业后一直从事银行工作，工作业绩很好，但对未来发展迷茫。
          2020年中因为职业瓶颈主动离职，零基础开始自学法律，也为了学好法律更好地保护家人。不幸的是司法考试差几分没通过，打乱了通过后去律所工作的计划，2021年还需要继续考。但有信心二战必过，今年还需要考完注册会计师。
          现在迷茫的是应该继续脱产专心学习，还是先找工作。怕久了不工作容易跟社会脱节，脱产备考的成本也很高。父母年纪大了，想要努力给他们更好的生活。在我心中是家人第一，事业第二，感情比较随缘。
          之前有略懂八字的朋友给我看过，说我快要转大运了，下一个大运会很好的，他那句话给了我支撑和鼓励。
          `,
    珠玑: `八字分析：丁火生在已月，时干透出丙火，为劫财格。丙丁火皆旺，偏财酉金受比劫争夺，用官星亥水克制比劫护财。
          事业分析：丁亥日出生，坐下为正官用神，性格上比较正直，稳重，保守，人比较守信用，负责任，这个性格在事业上容易得到领导青睐。
          但比劫星较旺为忌神，阳刃得令，人比较固执要强，有时候不够灵活变通，这也是性格的缺点，是一个喜欢一条路走到“黑”的人。
          八字身旺而比劫重重，见七杀为吉，喜七杀来制比劫，身旺也可担杀，若大运再来助杀，能有一番作为。但原局官杀混杂少了贵气，巳火得令，火旺水囚金死，虽有酉金来生水，但酉金力量较弱，无土来生金，格局层次较为一般。
          年支酉金为偏财，也为独财，但原局没有食伤来生财，财星较弱，为身旺财弱之格，比劫旺而财弱，地支巳酉半合，构成比劫夺财，在钱财上花销较大，不能去合作求财，合作容易破财，和亲戚朋友之间金钱往来也要注意被坑骗。
          财星在年柱，在宾位不在主位，这个财很难成为自己的财，财运较为一般。财在年也代表远方之财，且月支巳火和日支亥水为驿马星，巳亥相冲则驿马逢冲，为外出求财，奔波求财之象，故要在外地发展为吉。
          日支亥水中暗藏壬水，时支午火中暗藏丁火，丁壬相合则亥水和午火暗合。午火为禄神代表自己，亥午暗合则为正官合身，代表自己可以得到这个官，适合上班求财，在正式单位上班较好。
          八字最喜见七杀，癸水七杀为用神在年干透出，坐酉金有力量，有财来滋养，则非常适合从事具有“破坏性”的事业，如军队，警察，法院，检察院，当然也适合学习法律。
          七杀代表名气，有大运助杀可以得名，成为业内知名专家，所以大概率会成为一位知名律师，可以朝这个方向去努力，求名也需要有过硬的实力才可以，所以现阶段最需要的是踏踏实实去学习。外贸和金融行业也是属金水的，从事相关行业是可以的，但不如从事法律相关行业适合。
          婚姻分析：比劫重重而难以制约，原局不见食伤，性格比较直来直去，不会变通，有时候甚至容易胡搅蛮缠，在温柔方面较为欠缺，这个性格是不利婚姻的，相处久了另一半难以感受到你的关心体贴。
          女命喜清不喜浊。年干癸水为七杀，日支亥水为正官，为官杀混杂的格局，为不利婚姻的体现。先见七杀后见正官，早婚易败，也代表婚前会经历一段失败的感情，遇到不好的缘分。
          但亥水正官星在日支夫宫，为夫在主位，早年虽感情较为坎坷，但终究会有一段稳定美满的婚姻。亥水正官为用神，以后丈夫比较有能力，对自己帮助较大。
          你的婚姻还有一些不吉之处，天干丁癸相冲，地支巳亥相冲，则冲了夫星和夫宫，又是劫财来冲，代表婚后会有一些不和之事，容易发生争吵和口角，感情上是一个不喜欢退让的人，这也是夫妻之间发生纠纷的一个重要原因，这个卦性格是要去改变的，且注意预防第三者女人干扰插足。
          日支亥水为驿马，巳亥相冲驿马逢冲，夫宫为驿马是不利婚姻的，代表婚姻容易变动，难以稳定。
          未来的丈夫身材较胖，肤色较黑，长相一般，身高170左右，人比较聪明机灵，热情好说，富有情调，比较顾家。
          2022年为壬寅年，丁壬相合，寅亥相合，为天合地合，壬水正官被自身合入，可以遇到心仪的另一半，也有结婚之象，要好好把握。
          大运分析：21岁-30岁走的是己未大运，此大运干支一气为食神大运，是非常不好的大运，天干己土去克了癸水七杀，地支未土和原局构成巳午未三会火局，旺了比劫星忌神，这个大运是不顺的，所求之事大多会夭折或功败垂成。事业上也会竞争大，压力大，大运不好的时候要沉下心多学习，你现在辞职了心态要保持稳定，以修身储能为第一要务。
          今年为辛丑年，天干丙辛相合，财星被合入主位，劫财来合，竞争大也会有些支出消耗。地支巳酉丑暗合财局，今年财运还是可以的，但地支丑午穿害，午火为禄神，禄神被伤害则要严防破财之事。
          2022年为壬寅年，也为己未大运的最后一年，前面也讲到，这一年和原局天合地合，是有婚姻运的。但地支寅木和原局构成寅巳刑，也要注意维护好关系，容易有些分歧矛盾滋生。地支寅木去生了比劫，比劫是克财星的，财运较为一般。
          31岁-40岁走的是庚申大运，此大运干支一气为财星大运，天干地支出现财星则去助杀为吉，构成身杀两停之局。此大运要比之前的大运好，事业上可以有一番作为，财运也会比之前好很多，身旺可以担此财。
          但地支巳申相合，为比肩夺财，要注意和亲戚朋友同事之间的金钱往来，容易破财。申亥穿害则夫宫和夫星受损，则是不利婚姻稳定的，会发生感情矛盾，要妥善化解，以防离婚之事。
          2023年为癸卯年，也代庚申大运的第一年，地支卯木去冲了酉金财星，财星受冲则不吉，花销会很大。
          41岁-50岁走的是辛酉大运，此大运和上个大运类似，干支一气为财星大运，辛金去生了癸水七杀星，身旺可以担财杀，利于事业和财运，天干丙辛相合，财入主位，此大运能获得较多钱财，也是事业的黄金期，想有所发展这个大运好好把握住。
          51岁-60岁走的是壬戌大运，此大运天干壬水正官被地支戌土戳脚，天干两个丁火去争合壬水正官星，此大运也是非常不利婚姻的，容易对丈夫不满，也会出现其他异性来干扰你的婚姻。地支酉戌穿害，财星受损，破财之象也是非常明显。
          癸亥大运，地支两个亥水去冲巳火，阳刃逢冲注意身体健康。甲子和乙丑大运就不好了，天干甲乙木去生了比劫星，地支子去冲害了午火禄神，则一定要注意身体健康。
          你的八字对大运组合要求很高，走金水运的时候会有很多起色，但官杀混杂格局层次低了些，要注意破财之事和夫妻关系。
          你现在还差两年进入金运，这两年要平稳过渡，最好的办法就是加强学习，闭关修炼。你现在一边准备司法考试，一边准备注会考试，这两个考试都是难度很高，较为逆天的考试，建议以司法考试为主，注会考试为辅，这样比较好。
          而且每个人的专注力是有限的，时间是有限的，专心做好一件事才能做好，不要捡了西瓜丢了芝麻，如果都想要做好，最终会身心俱疲，什么都做不好，太多事情分散了专注力，最终每件事情都是半桶水，变得平庸，拔不了尖。
          `
  }]
}

export default {
  午时
}