const 未时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正官   正印   日元   偏印',
  天干: '庚(金) 壬(水) 乙(木) 癸(水)',
  地支: '辰(土) 午(火) 丑(土) 未(土)',
  遁藏: ``,
  大运: '辛巳 庚辰 己卯 戊寅 丁丑 丙子 乙亥 甲戌',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/479.html',
    珠玑: `八字分析：乙木生于午月，为食神格，食神格喜欢生旺。乙木根气弱，又无明显七杀，地支却现重重偏财，土太重了日主无力承受，所以会过得很难受，身体也不是很好。
          事业分析：月令午火食神当令，食神生财，年柱庚辰财生官，财官者为人之所求，又逢庚金正官，和壬水正印，官印相生流通日主，为人是有进取心上进心的。
          但壬水和癸水双印夹生日主，地支没有强根，且地支财旺，地支丑未冲，容易伤到丑土中癸水印星，和未土中乙木根，印星代表学业，根者在日主弱而财旺的八字组合中更代表身体，加上八字财星力量旺，印星和乙木根受伤是很容易影响到学业和身体健康的，加上早年天干又是官杀，地支又是生助财星的组合，所以身体也会孱弱多病。
          从未来的学业运来看，今年辛丑财生七杀，官杀混杂，学业运不太理想，到2022年，2023年，印星力量大，又官印相生，地支逢强根，学业运比较好些，有学业考试计划的话，这两年把握下。
          乙木日干弱根，月干壬水正印和时干癸水偏印印夹生也会使得自己变得敏感，顾虑多，加上天干为喜官印流通，而地支食伤生财财重，表面上给人感觉风轻云淡，但财重食神来生，内心波涛汹涌，容易藏事情，也会比较的困惑担忧，久而久之容易导致些思想负担增加，甚至抑郁症。
          月柱为兄弟姐妹宫，天干为喜，官印相生，月支食神生财生到年支，日支，印流通官星，自己也会在意兄弟姐妹，地支午火生财星，午火与壬水兄弟宫自合，午火与日支逢破，所以容易影响到她和你的状态和关系，对于姐姐的相关担心及督促念叨，适可而止为好。
          你八字形成了财旺身弱的组合。容易因为钱财而辛苦奔波忙碌，有时付出努力，也没有好的发展收获，八字原局层次非常一般。八字中印比为喜用神，可以适当借力长辈及兄弟姐妹，同事的意见，只是但力量也不强，同时八字中的贵人星不显，很多时候靠自己亲力亲为多些。
          结合大运走势来看，31岁-51岁，地支走东方木的运气组合，对你事业发展有帮助，可以有小康偏上。51岁之后运势走食伤运而地支贪合的大运组合，也不会太差，晚年生活还算安稳。
          婚姻分析：婚姻宫丑土偏财为忌神，与时支未土相冲，婚姻宫不稳定，又是忌神相冲，月令午火又与婚姻宫相破，婚姻宫是不稳定的，感情不太和谐稳定。宫位忌神逢冲力量增强，又逢破，另一半出身条件算不上太好，对你没有明显的帮助。
          午火食神代表自己的想法与另一半的想法及相处方面，容易说不到一块，久而久之导致矛盾不合争吵。
          年干正官与壬水还是有流通，代表开始时丈夫对你还可以，后面会慢慢淡漠，对你不上心，或者表面对你不错而内心里也会有些彼此不相投，不一致的想法。
          加上你八字日柱刚好带寡宿，月令午火为桃花星，又都是忌神，也会遇到些烂桃花，也不利于婚姻稳定，整体婚姻不太理想。
          从你的结婚运来看，婚姻宫逢冲破，化解冲破关系时才有结婚的运气，到2029年，桃花星合婚姻宫，而婚姻宫又是官杀库时有结婚的运气。
          大运分析：21岁-30岁走的是庚辰大运，此大运与年柱伏吟，财旺生官，官也旺，天干官印相生，但地支财星过旺，事业压力大，容易招惹上些不怀好意的人，为事业劳心劳累，属于辛苦忙碌付出多才有收获的运气，且支出消耗也不小，发展收获不大。大运官星透出伏吟年柱，地支辰辰自刑，也属于忌神力量大，虽然也有结婚的运气，但不宜早婚，早婚容易闹分离。
          31岁-40岁走的是己卯大运，此大运己土坐卯力量被削弱，大运卯力量大些，整体属于好的运气组合，地支卯未半合比劫帮扶日主，天干财官印流通相生，所以此大运你财运会有所好转，收入增加，经济质量有所改善。婚姻宫逢冲，被大运解合，感情和谐稳定些，婚姻宫逢破还存在，也会有些分歧矛盾滋生，注意沟通。
          41岁-50岁走的是戊寅大运，此大运戊土坐寅，寅力量大些，整体也是好的运气组合，只是戊癸合偏印，也会有支出消耗，注意理财，同时注意防骗，不要随便借钱给他人，整体运势还算可以，收入不会太差，注意些土金干支一气的年份即可。地支劫财星与午火半合，和的是桃花星，又是劫财，容易遇到烂桃花，且婚姻宫也与大运地支暗合，注意提防第三者女人，整体婚姻运也有些不太平稳。
          后面走的是丙子大运，乙亥大运等，丙子大运天干伤官见官，地支子丑合，运势发展方面有利有弊，乙亥大运乙庚合，地支亥未拱合，运势方面还算可以，晚年运气不会差。
          你的八字属于日主偏弱，食神当令，食神生财，财星旺的八字组合，日主在地支没有强根，只有两个弱印和地支弱根帮扶，用神力量较弱而忌神力量太强又在地支，所以表面上天干官印相生是好的，而实际上地支忌神力量大无制，存在的问题阻碍不少，八字原局不是太理想。
          好在后面几个大运地支走的东方运气，对你的运势发展有帮助，事业有发展提升空间，收入增加，且晚年运势走的也不差，可以安度晚年。
  },{
    作者: '',
    出处: '',
    珠玑: ''
  }]
}

const 申时 = {

}

export default {
  未时,
  申时
}