const 辰时 = {
  公历: [{
    甲: '1995-08-29 8:00:00'
  }],
  农历: [{
    甲: ''
  }],
  十神: '伤官   食神   日元   食神',
  天干: '乙(木) 甲(木) 壬(水) 甲(木)',
  地支: '亥(水) 申(金) 辰(土) 辰(土)',
  遁藏: '比肩   枭神   七杀   七杀',
  大运: '癸未，壬午，辛巳，庚辰，己卯，戊寅，丁丑，丙子，8岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/500.html',
    命主甲: `大学去当了两年兵，去年才本科毕业。毕业后尝试考公职，结果也没考上。今年三月又很冲动的决定考研。最近压力特别大，对自己能不能考上研究生很没有信心。同时又想就算考上了，读完研究生也要29岁了，还是计算机专业，好像也没有太好的发展了。
          今年26岁了，同龄人都已经工作结婚生子或者在读博，而我事业爱情什么都没有，父母在老去，我到现在还没能让父母享福。我的人生难道就这样了吗，每次想到这些，都很压抑很迷茫。
          `,
    珠玑: `八字分析：壬水生申月，为有源；壬水坐辰，时支也为辰，为有库。年支为亥，申亥一穿，长生和禄互穿，此为不利信息。
          壬水日主偏旺，同时得生助，又逢禄帮身，也代表是一个有自己主见想法的人，同时地支申辰拱水局是比劫局，比劫天干五行木食伤，也较容易轻信他人，没有太多的坏心眼心机。天干甲乙木食伤透出泄秀，自己也是个较独立的一个人，同时也比较固执，认定的目标就一直做下去。同时食伤旺，也容易情绪化，有时候缺乏耐心。
          印比为忌神，食伤财为用神，官杀则各有利弊不算太好，申金印星当令，日支为辰土七杀，辰土七杀在日支被印星泄，杀印相生的组合，八字身旺，天干甲乙木透出泄秀，对你的运势发展也有帮助，
          同时辰土七杀在日支逢杀印相生，可以为我所用，适合旺公检法及法律相关的工作发展。而天干甲乙木食伤透出，不太适合往公务员发展，相对适合事业单位国企方面。
          月令是申金偏印，年支亥水比肩，被甲乙木食伤泄秀，也适合往文化教育，策划设计及技术技能相关的工作也不错。
          八字无财星，但八字食伤旺得生助，可以把食伤当财来看，命里会有一定的财富，不会太差，同时没有太明显的贵人运，食伤旺，更多的是靠自己亲力亲为付出。
          结合大运走势来看，天干运属于金木，土木相克的关系，不是太好。而地支走火木运气，对你的事业发展有帮助，整体格局不会太低，比上不足比下有余。
          学业分析：你当下走的是壬午大运，今年辛丑年，辛金印星透出，地支午丑破，伤官容易被克，不利于你的学业考试。不建议去考研究生，去考些国企事业单位比较好。
          从你未来学业来看，明年后年天干走比劫运气，竞争大，同时换辛巳大运，学业运也不算好，相比之下2023年比2022年稍好些，2022年地支三刑不稳定。往后到2024年走食神运气学业运也相对好些，考的话在2023年，2024年好好把握下。
          婚姻分析：辰土为婚姻宫，婚姻宫本为喜神，对你婚姻有帮助，但申辰拱比劫局，且婚姻宫和时支辰辰自刑，为比劫库刑，又是七杀，在感情上会有不少的烦恼和顾虑，不利于感情的和谐，另一方面另一半对你的帮助也打了折扣，也要注意第三者干扰。
          男命以财星代表妻子，你的八字中没有财星，而有食伤，也代表你比较渴望有感情姻缘，但实际上桃花又不太旺。同时食伤旺，对感情的渴望也有些急躁，容易情绪化，有时不太懂得哄女孩子开心，甚至容易适得其反。
          壬辰为魁罡格，婚姻宫为比劫库，感情久了容易忽视对方感受，又是阴差阳错日及华盖星，也有些孤独不利感情的信息。
          你要到财星透出且流通八字的时候，结婚运才旺些，辛巳大运的2026年，2027年的时候，有结婚的信息。
          大运分析：18岁-27岁走的是壬午大运，天干比肩为忌，地支正财为喜，食伤泄大运比肩和日主，地支财生七杀，对你的学业不利，竞争大，学业路上不太顺，而食伤有利，通过自己努力最终还是进步收获，但想继续深造学业不太适合。事业虽然竞争大，但食伤泄秀，尽量做好自己的本职工作也会有进步，地支财生七杀也能获得他人的认可。
          28岁-37岁走的是辛巳大运，此大运与年柱天克地冲，天干伤官被克，地支比肩冲财，比肩为禄驿马冲财，代表身先士卒，亲力亲为，辛苦求财，金水旺的年份不太好，要多注意。食伤多现，食伤克不尽，又有比肩通印星，属于辛苦忙碌，一分耕耘一分收获的运气组合。
          庚辰大运，枭神夺食，逢乙庚合解，地支辰土七杀制水，预防事业上的过失失误，杀印还算流通，整体运势虽然不稳定，但整体不会太差。
          己卯大运，天干有伤官见官，地支亥卯半合伤官泄秀力量强，也会有进步收获，适合多发挥个人的主观努力及聪明才智，只是要注意人际关系，容易不受人待见。
          戊寅大运，相对好些，只是地支寅亥合贪合不冲，整体事业运还可以，个别年份会有些不稳定。
          丁丑大运，属于天干地支流通的运气组合，故而晚年运气整体还不错。
          你的八字壬水日主当令且年支见日禄，地支又拱和比劫局，八字偏旺是可以担起财官的，只是八字中财星不显，见七杀不见正官，食伤在天干泄秀，求财上压力大，竞争大，需要靠自己多努力付才能有发展，属于一份付出一份收获的组合，结合大运来看，大运走势算不上太好，但也不至于太差，食伤泄秀无明显受伤，整体格局层次还可以。
          `
  }]
}

export default {
  辰时
}