const 巳时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '七杀   正印   日元   枭神',
  天干: '癸(水) 甲(木) 丁(火) 乙(木)',
  地支: '酉(金) 寅(木) 丑(土) 巳(火)',
  遁藏: '偏财   正印   食神   劫财',
  大运: '乙卯，丙辰，丁巳，戊午，己未，庚申，辛酉，壬戌，癸亥，3岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/439.html',
    命主甲: `我曾做过行政文员、机场地勤、平面设计、书店和剧院的运营策划，但最长的工作不超过3年，最短的2个月就离职了。离职的原因通常是我觉得没意思，不知道自己想要什么，做的事情像在浪费时因为马上也快三十了，所以想要谨慎的选择下一份职业，毕竟这个社会对于三十左右的女性不算十分友好。
          目前的我有创业的念头，开咖啡馆。但因为没有经验，打算到咖啡店当学徒，稳定几年之后再创业。但家人不太同意我做这份工作。
          父母希望我能找份办公室文员的工作踏实地干，再考虑结婚的问题。我单身。家人都很担心我的婚恋状况，给我安排了相亲我都不去，他们都怀疑我的性取向了～让我有点哭笑不得。但其实我是希望自己的生活稳定了，再考虑这问题，又害怕会错过正缘。之前我找人算过，他说我错过一次正缘了，是我一个朋友。
          他也描述出那个人相貌特征跟年龄，是符合的。他说我下次在三十岁以前会再遇到一个，错过了可能就要等很长时间，我也不知道该不该信。很迷茫。
          `,
    珠玑: `八字分析：丁火日主生在寅月得令，月柱甲寅干支一气来生身，时柱乙巳木火相生来助身，时支巳火阳刃为丁火的强根，虽有年干癸水来克身，年支酉金和日支丑土来耗泄自身，但依旧身旺。月干甲木从寅木中透出，为正印格。水在天干和地支都不喜见，岁可以克泄日干丁火，但水会去生木，木再来生身不吉。
          事业分析：你地支虽有巳酉丑三合金局之象，但由于寅巳穿害且年支酉金空亡而破局，所以难以合化。
          八字属于五行较为流通的组合，年支酉金偏财生年干的癸水七杀，癸水又去生了月干的甲木正印，甲木又来生丁火，属于财生官，官生印，印生身的组合，但身旺的八字，不喜财官印流通入自身，喜财来制印，所以整体为用神化为忌神组合。
          月令寅木克了日支丑土，丑土为用神，本得到时支巳火的生扶，巳火得到时干乙木的生扶，为忌神化为用神，但巳火被寅木穿害受损，丑土无力，则构成枭神夺食不吉。
          整体八字原局要么是用神化为忌神，要么是用神无力被克损，忌神旺而无制，组合方面不太好，代表求财较为辛苦，想要有一番成就非常难，但如果安分守己，找一份踏实稳定的工作，还是可以衣食无忧的。
          八字印多为病，正印和枭神贴身日主，性格缺点是非常明显的，容易度量不大，小肚鸡肠，缺乏魄力，做事较为懒散。
          印星本来是保护自己的，但太多则过犹不及，导致自己给自己设限太多，瞻前顾后，做事难以善始善终，容易半途而废，阻碍事业的发展。
          印旺为忌神，财星无力，印星混杂，读书运不是很好，结合你的大运来看，早年走的是印星大运，难以取得理想的成绩和文凭。
          八字虽财官印全，但偏神多于正神，内心是不安分的，且印星为忌，不适合从事文化相关的行业，比如父母极力推崇的办公室文员。因为丑土食伤无力受损，则也不适合从事设计策划等相关行业。书店行业属木，木为你的最大忌神，也不适合，你想着转行是对的。
          日主丁火被枭神贴身，坐天医星，则比较适合从事医疗相关，或服务行业为佳。但如果你学的不是医学相关专业，在当今社会想一下子去做这一行还是很难的，条件不具备就从事服务行业。
          你的八字为身旺财弱之命，有能力去担财，只是无财可担，酉金偏财在年柱代表远方之财，财星空亡则财运不好，获取钱财较为辛苦，也会面对很多障碍，难以聚财容易破财。
          但财星进入了日时藏干，为财入主位，大财难求，小财还是可以通过努力而获得的。年柱空亡则祖上无靠，难以得到父母帮助，出生不好。
          综合而论，你不适合去投资创业从商的，有一技之长，去大一点的企业或平台去从事服务行业是最佳的，比如大健康、中医养身、心理医生等行业。
          开咖啡馆也属于服务行业，但你去当学徒，从职业规划上看以后难以有更大发展，开店求财也不容易赚到钱，不建议你去咖啡馆上班。
          婚姻分析：日柱为阴差阳错，临华盖星，又有太极贵人，且印星旺为忌神，内心较为孤独，性格上较为自闭，凡事习惯于为自己考虑，不太会体谅和关心别人，导致异性缘分不好，感情较为不顺。
          八字不见正官星，则以年干癸水七杀星代表丈夫，年柱空亡则异性缘分较弱。日支为婚姻宫，癸水见丑为入墓，则为夫星入墓，夫星入墓则冲开墓库才可结婚。
          丑土为食伤暗藏癸水七杀星，食伤是克七杀的，体现为对未来丈夫的不满。日支坐丑，则未来丈夫性格沉稳，用情专一，缺乏浪漫，长相比较普通，气质一般，个子不高，体型微胖，单眼皮，眼睛不大，眉毛直，嘴唇上厚下薄，皮肤有点黄，年龄比你大。
          日支丑土食伤被克损，构成枭神夺食。时支为巳火阳刃，阳刃为忌神则在哪个宫位哪个宫位对应的六亲则不吉，时柱为子女宫，时干为乙木枭神，印星是来克食伤星的，则子女缘分较弱，婚后要孩子一定要先调理再要孩子，相比其他人容易要孩子困难，不顺利。阳刃较旺，也代表很容易剖腹产，孩子身体不好。
          大运分析：23岁-32岁走的是丁巳大运，此大运干支一气为比劫大运，也为忌神大运，巳火在地支伏吟两次，为阳刃重重，则要注意手术和意外安全之事。比劫也会去夺财和夺官，对求财和感情都有不利，你的婚姻运必须把墓库打开才可以，之前的算命先生说你错过了一次婚姻，从流年来看，为2015乙未年，地支丑未相冲，墓库打开则有婚姻缘分。
          33岁-42岁走的是戊午大运，此大运地支丑午穿害，则打开了墓库，这步大运要好好把握。2026年为丙午年，大运和流年两个午火去穿丑土，则为动婚之象。2027年为丁未年，地支丑未相冲，则也要好好把握住，错过这两年后面就很难了。天干戊土透出，去合克癸水，造成伤官见官，这个大运要注意夫妻关系，任性而为则会离婚。
          43岁-52岁走的是己未大运，此大运干支一气为食伤大运，地支丑未相冲，动了婚姻宫，则婚姻动荡，容易家庭不和，发生口舌之事。天干甲己相合，则构成枭神夺食，食神与印星合拌，导致食神难泄秀，才华难以发挥出来，会有怀才不遇之感。也代表你有很多想法，但多是空想，不能得到好的实现。这个大运心情状态会不太好，其次脾胃不好，要注意的。
          你要考虑的不是什么行业适合你，而是你能不能克夫自己的缺陷，在一份工作上好好坚持下去，不是选择什么行业能做下去，而是你着这样的心态，做什么工作都难持久。不是工作没意思浪费时间，而是你工作换来换去浪费了时间。
          三十不发，四十不富，当你羡慕身边人到四十岁时有一定财富收入和社会地位，其实是他在三十岁时打下的基础，通过十年的努力去积累获得的。
          而三十岁打下的基础，离不开二十几岁时进入社会时对自己事业的规划，以及努力付出。
          一个人来到世上的命是无法选择的，但你成年后的运可以自己选择，运可以通过自己后天学习，规划，努力使得自己大运走的更好，当然这种好不是一蹴而就的，有的人发愤图强说要早睡早起，坚持三天又打回原形，然后说命运不公，运的改变至少是几年甚至十几年的坚持的来的。
          至少你在前面的运是没有修好，浪费了好几年时光，希望你能够意识到自己的问题，要大力去克服，最好可以掌握一门过硬的技术，多去深入钻研，技多不压身，靠技术来吃饭为吉。
          `
  }]
}

export default {
  巳时
}