const 亥时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: ''
  }],
  十神: '正印   正财   日元   正印',
  天干: '辛(金) 丁(火) 壬(水) 辛(金)',
  地支: '丑(土) 酉(金) 寅(木) 亥(水)',
  遁藏: '正官   正印   食神   比肩',
  大运: '丙申 乙未 甲午 癸巳 壬辰 辛卯',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/62.html',
    命主甲: `正印太过，逢财则吉`,
    珠玑: `此造日干为壬水，属壬水命，生在秋天八月酉金当旺之时，金旺、水相（即指秋天金最旺、水次旺），金能生水，壬水日主秉时得令本身就不弱。
          再见时柱又是辛金、亥水，亥水为壬水之禄旺强根，再得辛金之生，此时壬水命已经生旺太过了。又见年柱辛金、丑土，酉丑半合金局，使得命中印星辛金再见强旺，便成印（金）旺、身（壬水日主）强之象。
          此命属于标准的正印格，印有官生，年时两透，已属太过。“正印太过，逢财则吉”，丁火为日主的正财，克去一个辛金，让天干之印一字清纯。八字之中，以独一无二清纯不杂为妙，多则层次降低。
          另外，酉月金寒水冷，寅中丙火为偏财，作用可谓非常大，一是以寅亥合的方式牵制壬水，二是起到调候的作用。一阴一阳谓之道，八字最忌全局阴寒，所以此造完全需要丙火调节。
          此局病在食伤过弱，甲木在酉月处死地，而且天干辛金虎视眈眈。食伤为日主的表达能力，以及做生意的财源，食伤太弱未免表达能力有限，而且也不太适合做生意。
          不过，甲木虽处死地却是此造的关键，泄水生火，甲木乃松、柏参天大树之木，生起丁火源源不断，此为用神有力。
          绝妙的是，日、时两地支寅亥合木，将多余的亥水合化为木。且喜用丁火和寅木就在壬水日主的贴身周围，气势团结，配合有情。
          这样一来，一个好命就生成了。人们常问：什么是好命？凡格局、用神配合有情有力，行运不背，则必为富为贵，或富贵双全之命。
          青年甲午运独立创业，其后几十年东南木火喜用之地，发财无数。
          `
  }]
}

export default {
  亥时
}