const 卯时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1991年十月初九卯时'
  }],
  十神: '伤官   劫财   日元   正官',
  天干: '辛(金) 己(土) 戊(土) 乙(木)',
  地支: '未(土) 亥(水) 子(水) 卯(木)',
  遁藏: '劫财   偏财   正财   正官',
  大运: '庚子，辛丑，壬寅，癸卯，甲辰，乙巳，丙午，丁未，戊申，9岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/516.html',
    命主甲: `大专学历。因为计划生育，亲生父母重男轻女，想要个儿子，我是第二个孩子，给了舅舅家。大学毕业，工作了一年左右，已经25了，养母就开始给我张罗相亲对象了。相了好几个，都是没有母亲的居多。
          当时有个师父帮我看了八字，说我15年不结婚，要等到18年，时间太长了，我养母早已迫不及待想让我嫁人了，我就像她的包袱，恨不得早日甩出去。这个师父还说我未来的对象比较有能力，长相也可以。我丈夫长相不错，能力到现在也没看出来。一直做苦力活。
          当时家里人个个都说挺好的，压力也很大。再加上师傅说错过就要到18年，我的养母不可能让我等那么久，当时也想尽快结束在养父母家憋屈的日子，基于各种原因，15年劳动节和丈夫订婚了。我丈夫也是没有母亲的。并且订婚后才发现他家还有个癫痫的弟弟。
          15年6月份的样子吧，我怀孕了，但是孩子长到4个月b超发现左手没有发育好，当时一直不死心，一直等到5个月，还是同样结果，只能忍痛引产，引产下来发现宝宝小臂和大臂粘在一起，每次回想起来都心痛难当。是个男宝。
          有时候觉得是不是当时看八字的师父说的不准，我的丈夫并不是我选的这个才会这样。后面一直也不敢要孩子，17年又再怀了一个，谢天谢地，18年生了个健康的女孩子。
          有了孩子以后我才更深刻的意识到自己根本没有父母亲情，怀孕的时候即使是被油烟熏的吐得不行，也咬牙自己做饭，坚持到生。生产的那天养母仍旧说让我亲生母亲到医院照顾下我，但怎么可能呢？怀孕都只看过我一次。
          坐月子的时候原本养母说要过来，后面又说家里有鸡鸭不想来了。养母家的村子到县城，电动车也就十多分钟。后面我老公自己放下活计来照顾。都已经快出月子了，养母才来个电话，你要不然来家里住几天？经历了好多这样的事才发现我不过只有自己而已，他们根本没有我想象的对我有过多少爱。
          心已经凉了，从此以后，除了逢年过节基本不会回去，因为知道自己对他们来说没有任何意义。
          有时候真的不知道自己的人生为什么会是这样的，没有结婚之前我从不看重钱财多少，吃饱喝足就觉得万事不愁了，后来才发现无论是养父母还是亲生父母，若我经济条件好绝不会是这样的态度。
          明明看淡身外之外的人，却被逼的一步步看重钱财。然而我还是羡慕别人拥有的父母亲情，无论何时想到这些，仍旧让我伤怀。
          我丈夫八字我也不太了解，在他十五岁左右的时候，婆婆就出车祸走了。公公一事无成，还拖着个癫痫的儿子。我自己因为没有婆婆，小孩只能靠自己，四年了一直是个家庭主妇，想去工作也有心无力。
          也想过很多办法赚点外快，但也是杯水车薪。丈夫又光靠苦力赚钱。有时候真觉得生活一点希望都没有，这样的日子什么时候是个头呢？
          `,
    珠玑: `八字分析：戊土生于亥月，为偏财格。未中丁火为亲生母亲，未穿坐支子水无情，得不到多少母爱。子卯刑子女宫，辛金子女星所处位置不佳，所以有点刑克子女。好在子女宫乙卯为正官星，所以子女以后会有出息，自己晚年运也算不错。
          事业分析：八字财星得令较旺，日坐财星，比较爱慕虚荣。亥月水旺与子相连水更旺，去生五行木，时柱乙卯正官是较旺的，为人会比较自律讲规矩，但八字身弱不担官杀，会忧虑忧愁多，压抑自己，而八字缺火，也是不太开朗乐观，内心容易被阴暗面占据，凡事不喜欢往好处想，做事思虑重重，缺乏魄力，对你处事，和人际关系都有影响。
          以印星为用，但缺印，缺乏安全感，心里比较缺爱的一个人，印星代表母亲，也代表和母亲缘分弱，年柱空亡，难得祖上之业，难以得到父母帮助，多是靠自己，也代表自己贵人运较差，八字劫财为用，依靠自己辛勤劳动来立业。
          八字身弱，年干辛金伤官泄身，时柱乙卯正官克身，压力大，烦恼多，身体比较劳累，精神状态不太好，做事不容易坚持到底。正官旺为忌神，在婚姻中，容易对另一半依赖，身弱官星为忌，另一半对自己事业财运帮助不大。
          财星得令较旺，身弱难以担财，求财会有些辛苦劳累，依靠劫财去制财，也容易从事体力劳动方面的工作，赚到的钱财有限，只有大运来助身，方有好转的机会和运气。
          正官贴身较旺，有的时候容易相信别人，也容易被欺骗，八字身弱不担财，地支子未相害，有破财的信息。劫财帮身制财的同时对事业财发展有些帮助，同时也有夺财分财之象，伤官在原局难以来生财，这样的组合，都是代表不适合投资做生意的。
          年支未土为官杀库，时干乙木正官从未土官杀库中透出，乙木坐卯木之上坐实，官入门户则可以得到这个官，官杀库在年，也代表外出求财，为别人打工，跟着别人做之象，能去找一个大一点的平台，从事较为稳定的工作比较适合你，去出生地的南方，东北方，西南方比较旺你。
          子女分析：女命以食神代表女儿，以伤官代表儿子，年干辛金为伤官星，但年柱空亡，且与子女宫属于伤官见官两相克的组合，相克故而代表儿子缘分较弱。日支子水，子卯相刑，容易早夭流产。儿子夭折为命中之象，得一千金，多借助另一半的运气。
          时柱为子女宫，干支一气为乙卯正官星，没有印星来通关，子卯相刑，卯木受损，多生育不顺畅之象，容易出现流产小产之事，在生育过程中容易剖腹产。
          今年辛丑年，天干辛金伤官星高透，原局辛金填实，地支子丑相合，丑未相冲，可以考虑备孕，有生儿子的运气，但是也犯伤官见官，也算不上太好，同样注意调理身体。过了今年要等很久，要到2029己酉年，酉金伤官星出现，地支卯酉相冲，冲了时支子女宫，或2030庚戌年，地支卯戌相合，属于生男孩的机会，但是年纪大是个问题。
          大运分析：29岁-38岁走的是壬寅大运，此大运为驿马大运，会比较奔波辛苦，天干壬水偏财透出，月干己土劫财去制财，求财辛苦忙碌付出多，财运较为一般，回报不明显，地支寅木七杀出现，压力较大，容易遇到小人，感情上也要注意和其他男性之间的交往分寸。
          39岁-48岁走的是癸卯大运，此大运为财官相生的大运，和上一个大运相似，身弱不担财官，会为财官所累，财运不太好，地支卯木引动原局子卯相刑，日支子水财星受损不吉，要注意破财之事，同时也要注意丈夫身体健康，和另一半关系容易僵化，容易犯口舌，发生口角，要多注意。
          49岁-58岁走的是甲辰大运，此大运地支辰土被天干甲木盖头，天干甲己相合，事业上难得贵人相助，要注意脾胃方面疾病。辰土为财库，又是强根帮扶日主，对命局运势有好的帮助，财运会有所好转些。
          乙巳大运，丙午大运，印星出现，总体晚年运势有所好转。乙巳大运，地支巳火助身，可以担财，巳亥相冲，会因为房子的事情开支花销较大，也要注意身体健康问题。丙午大运，干支一气为印星运，大运助身来担财，财运不差，但丙辛相合，枭神夺食，要注意身体健康，子午相冲，财星冲印，花销也是较大。
          家家都有一本难念的经，每个家庭，都会有让人不满意，不如意的对方，即使你出生在原生家庭，一样会有各种问题，甚至不比你现在少，建议你也可以去问问身边人，或者大家也可以说说自己经历，开导下今天案例中这位朋友。
          大多数父母，只是平凡人，他们辛苦操劳一辈子，把你拉扯大，到了晚年，只想安静下，没有多少老人，会发自内心喜欢每天带小孩，带孩子不但很累，还容易因为养育孩子的新旧观念的不同，生活习惯的不同，和年轻人产生矛盾，带孩子有的时候只是形势无奈，他们也想享受下人生，一个人清闲自在，把你养育成人完成了他们的责任，没有义务一定要给你带孩子。
          有句老话讲：生而未养，断指可还。生而养之，断头可还。未生而养，百世难还。你从小亲生父母把你送人，可以不去报答他们，但你养父母的养育之恩，你这辈子都是还不清的，他们把你养育成人，让你上大学，完成学业，张罗你的婚事，让你成家，对你是不错了。
          算命说你25岁要结婚，要不然要等到28岁，养母马上给你张罗婚事，她心里想的可能是，我家闺女今年要是不结婚，那要到28岁才可以结婚，在农村等到28岁，该结婚的都结婚，找不到对象，很难嫁出去了，要赶紧张罗婚事。而你想的是，养母想把你赶紧送出去，未免格局小了。
          你觉得自己在怀孕和坐月子没有得到照顾，而养父母心里可能会想，这孩子，不是自己亲生的，自己还费心费力拉扯这么大，却对自己不那么好，反正她也长大了，让她自己搞定吧。
          都说清官难断家务事，家庭的事情是复杂的，我并不是要和你讨论，你提到的具体事情的对错，而是建议你从另外的角度去思考这些问题。
          `
  }]
}

export default {
  卯时
}