const 辰时 = {
  公历: [{
    甲: ''
  }],
  农历: [{
    甲: '1991年十月十四日辰时'
  }],
  十神: '枭神   七杀   日元   正财',
  天干: '辛(金) 己(土) 癸(水) 丙(火)',
  地支: '未(土) 亥(水) 巳(火) 辰(土)',
  遁藏: '七杀   劫财   正财   正官',
  大运: '庚子，辛丑，壬寅，癸卯，甲辰，乙巳，丙午，丁未，8岁运',
  批注: [{
    作者: '吉言网',
    出处: 'https://www.58jieyan.com/bzfx/361.html',
    命主甲: `我现在是大龄剩女。11年考了本科读了专科，是一名教师。16年到现在都因为赌博的弟弟，一直没有存到钱，或者三五天就借一次钱给表妹。
          性格：没有耐心，有时很急躁，很凶，但是心底是柔弱善良的，很有共情能力，超级易掉眼泪。能力：做事拖拉，懒，有时做事不怕后果，想做就做想说就说不怕得罪人，但还算得领导器重，因为教学能力还行。
          感情：16年认识初恋，17年拍拖，同年8月分手。19年认识第二任，20年5月分手。两次都有小同居，对象都是90年丙火日柱。我对对方都超好，不舍得他们为自己花钱。超级颜控。
          `,
    珠玑: `八字分析：癸水生于亥月，为劫财格，己亥月伤官合杀人聪明。年上偏印七杀，祖上环境不好，但自身学习较为刻苦，因此能有一定的学历。中年已亥冲，夫宫已火处于动荡不安的境地，加之偏印劫财，七杀又为偏夫，所以有恋爱同居却不是正缘。
          七杀在前，正官在后，必然会遇到一些感情的挫折，这也是命中注定。此八字七杀无制，偏印化杀结构不好力量有限，幸好丙火正财得禄，辰土又有高台之像，所以是一名教师。
          事业分析：月干己土七杀透出，地支有辰土正官，未土七杀，还有财生官杀，属于官杀混杂影响到格局层次，八字官杀混杂逢印，且羊刃带驿马逢冲，情绪容易焦虑，躁动，冲动，特别是对熟悉的人，脾气不太好，而人际方面容易说话偏激，有时候口无遮拦，太过直接而和冲动，而影响到人际关系。
          年干透出偏印泄化泄七杀，七杀为凶神喜制，杀印相生，有事业心，且能获得些领导的认可，只是八字官杀混杂而旺，财星又透出，丙辛合，且印星在地支无根，也就导致己土偏印化官杀的力量有限，官杀的负面作用还是存在的，对事业也会带来些不利的影响。
          结合大运走势来看，一路走的大运天干金水，地支水木火相生，地支财星力量增加，财生官杀，官杀混杂且旺，也容易导致消耗，破耗发生，平时要多注意理财，整体格局层次不太高，小康左右。
          婚姻分析：巳火为婚姻宫，藏有财官印，且婚姻宫生正官夫星，代表自己对对象还不错，也愿意付出，但八字官杀混杂，且财来生官，官杀旺，这种付出会比较多，但也因为你对感情付出多，有些过度关注，有时候会希望对方也有相应的回馈，不然自己会心里不平衡，甚至缺乏安全感，久而久之，影响到感情发展。
          八字七杀在年月且透出，时支为正官，官杀混杂不利感情，虽然有桃花但不稳定，八字先七杀后正官，正官在时柱也代表晚婚，同时要注意烂桃花，受到感情伤害，要谈几段感情才能修成正果，感情之路不太平顺，且八字犯阴差阳错，寡宿，有时候内心也很容易有种孤独感，婚姻组合容易有闹分离的隐患。
          你目前走的是壬寅大运，劫财代表是阻碍和竞争，地支虽然是寅木伤官，不利女命婚姻，但寅亥生合，水木火相生，解了婚姻宫的冲，也有吉利的一面，还是有些结婚运气的，
          2023年太岁与八字亥卯未八字地支食伤旺，七杀未土被克制的时候机会大些，但地支木火土相生，也代表容易竞争和阻碍，比如你喜欢的对象也有其他选择，建议好好把握下，错过要到2028年才有好的机会。
          对象身高中等左右，五官端正，脸型微方，肤色有点黄白，眼睛不大，单眼皮但比较有神，鼻梁挺直，准头肉多，且有点悬胆鼻，嘴唇微厚，声音敞亮，身高在176厘米左右。
          大运分析：28岁-37岁走的是壬寅大运，此大运天干帮扶日主，地支寅亥合解了巳亥冲，对你事业是有帮助的，能够有发展提升，只是壬水与时干壬丙冲，容易引导地支巳亥冲，因为壬的禄在亥，丙的禄在巳，两者相冲是一体的，此大运财来财去不稳定。
          而感情方面，壬寅劫财加伤官，劫财透出感情竞争大，对象容易被人合走抢走，婚姻宫逢冲大运介入而逢合，所以还是有结婚的运气。
          38岁-47岁走的是癸卯大运，此大运天干比肩帮身，对八字整体发展也是有帮助的，亥卯未解冲，地支木火土流通相生，事业可以朝好的方向发展，但压力和挑战也会大，食伤旺泄日主，代表自己付出的努力和精力也更多，此大运同样要注意理财。感情主要防止被插足，滋生争吵矛盾导致婚姻危机，2032年-2035年的时候注意下。
          甲辰大运天干甲己贪合，地支正官自刑泄财星，天干七杀被合，印星直接生日主，对你的运势也有帮助，地支财星被消耗，花销破耗也是比较多，属于有利有弊的运气。
          乙巳大运天干水木火土流通相生，地支巳火生正官，属于食神生财，财生官的组合，容易财来财去，且患得患失，运势不太好，都是消耗日主的五行，且财旺容易合克印辛，也是不吉的。晚年走的是食神，财的大运注意理财，钱财容易不稳定波动，晚年运较一般。
          你的八字官杀混杂影响格局层次 ，加上八字财生官杀，财星逢冲带驿马，容易留不住财，财来财去的不稳定，同时事业上会有压力和阻碍。好在八字年月柱有杀印相生，日支藏财官印，对你的事业发展有些帮助，且大运开始运势走的也还算可以，所以会有所收获。
          但是你八字一生都要注意理财，避免不必要的破财，有钱了可以投资一些好的固定资产，通过这样的方式守住钱财，留太多现金，容易因为各种各样的原因破财而留不住。
          `
  }]
}

export default {
  辰时
}